{"name":"Chicken Bacon Garlic Alfredo Roll Ups","ingredients":["▢ 8 Lasagne noodles","▢ 2 cups chicken cooked and shredded, I used rotisserie","▢ 1 pound bacon cooked and crumbled","▢ 2 cups mozzarella cheese shredded","▢ 1/2 cup butter","▢ 1 pint heavy whipping cream 2 cups","▢ 4 ounces cream cheese","▢ 1/2 teaspoon garlic minced","▢ 1 teaspoon garlic powder","▢ 1 teaspoon italian seasoning","▢ 1/4 teaspoon salt","▢ 1/4 teaspoon pepper","▢ 1 cup parmesan cheese grated"],"instructions":["Preheat oven to 350 degrees. Spray an 9x13 inch pan with cooking spray and set aside.","Cook the lasagna noodles according to package directions until al dente. Drain and rinse the noodles with cold water and lay them on a paper towel to remove excess water.","In a medium saucepan add butter, heavy whipping cream, and cream cheese. Cook over medium heat and whisk until melted. Add the minced garlic, garlic powder, italian seasoning, salt and pepper. Continue to whisk until smooth. Add the grated parmesan cheese. Bring to a simmer and continue to cook for about 3-5 minutes or until it starts to thicken. ","Line the bottom of the 9x13 inch pan with 1 cup of the alfredo sauce.","Spread 2 Tbs of the alfredo sauce over each noodle. Take 1/8th of the shredded chicken and bacon and spread evenly over each noodle and top with about 3 Tbs shredded cheese. ","Carefully roll up each lasagna noodle and place seam side down in your 9×13 prepared pan. Repeat.","Once they are all in the pan, pour the remaining alfredo sauce over the top and top with remaining cheese. Bake at 350 for about 30 minutes until heated through and cheese is bubbly."],"tags":[],"time":{"prep":"20 minutes","cook":"","active":"","inactive":"","ready":"","total":"50 minutes"},"servings":"88","image":"data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20300%20300'%3E%3C/svg%3E","slug":"34-chicken-bacon-garlic-alfredo-roll-ups.json","url":"https://therecipecritic.com/chicken-bacon-garlic-alfredo-roll-ups/"}