{"name":"Cinnabons Cinnamon Rolls","ingredients":[" 2 ¼ teaspoon active dry yeast or instant yeast"," 1 cup milk lukewarm"," ½ cup granulated sugar"," ⅓ cup butter unsalted, softened, or margarine"," 1 teaspoon salt"," 2 eggs"," 4 cups all-purpose flour"," 1 cup brown sugar packed"," 3 tablespoon cinnamon"," ⅓ cup butter unsalted, softened, or margarine"," 6 tablespoon butter unsalted, softened, or margarine"," 1 ½ cups powdered sugar also known as icing sugar, or confectioner’s sugar"," ¼ cup cream cheese at room temperature"," ½ teaspoon vanilla extract"," ⅛ teaspoon salt"],"instructions":["For the rolls, dissolve the yeast in the warm milk with a tsp of sugar (you can take a tsp out of the 1/2 cup of sugar) in a large bowl. Let it sit for about 5 minutes. If the yeast is good, it will start to froth up.","To the bowl of your mixer add the sugar, butter or margarine, salt, eggs, and flour and mix until well incorporated.","Pour the milk/yeast mixture over the flour mixture and using the dough hook, mix well until well incorporated and the dough comes clean from the side of the bowl.","Place the dough into an oiled bowl, cover and let rise in a warm place about 1 hour or until the dough has doubled in size.","Combine the brown sugar and cinnamon in a bowl.","Grease a 9×13 inch baking dish with cooking spray or butter.","Roll the dough out on a lightly floured surface, until it is approximately 16 inches long by 12 inches wide. It should be approximately 1/4 inch in thickness.","Spread the 1/3 cup of butter evenly over the dough, then sprinkle with the sugar evenly over the surface of the dough.","Working carefully, from the long edge, roll the dough down to the bottom edge.","Cut the dough into 1 1/2 inch slices, and place in a lightly greased baking pan. You can also use floss to cut into slices, as seen in the video. Place the cut rolls in the prepared pan. Cover with a clean kitchen towel or plastic wrap and let them rise for another 30 minutes, or until doubled in size.","Preheat oven to 350°F. ","Place the baking pan in the oven and bake for 20 minutes or until golden brown. Cooking time can vary greatly!","While the rolls are baking make the icing by mixing all the icing ingredients and beat well with an electric mixer until fluffy and smooth.","When the rolls are done, spread generously with icing."],"tags":[],"time":{"prep":"20","cook":"20","total":"10"},"servings":null,"image":"data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20200%20200'%3E%3C/svg%3E","slug":"36-cinnabons-cinnamon-rolls.json","url":"https://www.jocooks.com/recipes/cinnabons-cinnamon-rolls/"}