{"name":"The Best Gluten Free Cake Recipe","ingredients":[" 1 ½ cups (202.5 grams) gfJules® All Purpose Gluten Free Flour"," 1 cup less 1 Tbs. granulated cane sugar (Monkfruit works as a sub)"," 2 tsp. baking powder"," 1/3 tsp. baking soda"," 1/2 tsp. salt (optional)"," 2 eggs or substitute (for white cake, use 4 egg whites instead)**"," 1/3 cup mild flavored vegetable oil of choice (safflower, non-GMO canola, avocado oil, extra virgin olive oil, coconut oil melted, etc.)"," 1 Tbs. white vinegar (lemon juice works as a sub but imparts lemon flavor)"," 1 tsp. pure vanilla extract (I like Rodelle®)"," ½ cup milk of choice (dairy or non-dairy; skim or fat-free not recommended)"],"instructions":["Preheat oven to 325° F.","Line with parchment rounds or oil one 8 or 9-inch round cake pan or line 12 muffin cups with cupcake papers.","Bring all ingredients to room temperature. Sift the dry ingredients (including sugar) together in a bowl.","In a separate mixing bowl, whisk together liquid ingredients except milk. If making white cake, first whip egg whites quickly to fluff, then add other liquids: oil; vinegar and vanilla.","Slowly pour dry mix into the liquids and begin to stir, adding the milk while stirring to keep the flour from flying up and out of the bowl while mixing. Continue to beat at medium speed just until the lumps are gone and the batter is smooth and no longer lumpy.","Pour batter into prepared pan(s). Allow to rest in the pan before baking for 10 minutes (not required if pressed for time).","Bake for approximately 30-35 minutes for cakes or 20-25 minutes for cupcakes. Test with a toothpick before removing from the oven. When done, the toothpick should come out clean (not wet) or with a few crumbs attached when inserted into the center of the cake.","Glass, metal and ceramic pans all alter the bake time, so check for done-ness before removing from the oven. Pressing gently onto the top of the cake, it should feel firm and bounce back.","Remove to cool on a wire rack. To remove the cake, gently invert the cake by flipping it upside down onto your hand, removing the pan, then returning the cake to the wire rack or a serving plate.","Frost with white or chocolate frosting. (There are plenty more frosting recipes where that came from - just search the \"recipes\" tab on my site!)"],"tags":[],"time":{"prep":"15 minutes","cook":"45 minutes","total":""},"servings":null,"image":"","slug":"6-the-best-gluten-free-cake-recipe.json","url":"https://gfjules.com/recipes/the-best-gluten-free-cake-recipe/"}