{"name":"Easy Honey Chipotle Chicken Tacos","ingredients":["2 tablespoons avocado oil or neutral high smoke point oil of choice","1 ½ pounds boneless, skinless chicken thighs or breasts (if using breasts, pound to even thickness or butterfly into 2 (two) 1-inch pieces)","1 teaspoon chili powder","1 teaspoon ground cumin","1 teaspoon smoked paprika","½ teaspoon onion powder","2 chipotle peppers (from a can, packed in adobo sauce), finely chopped","1 tablespoon adobo sauce (from a can of chipotle peppers)","¼ cup honey","½ cup light beer of choice (such as Modelo Especial)","1 lime, juiced","optional: cornstarch slurry (1 teaspoon cornstarch whisked into ¼ cup water)","kosher salt & ground black pepper, to season","for serving, as desired: charred corn or flour tortillas, cilantro lime rice, black beans, sour cream or cashew crema, pickled red onions, freshly chopped cilantro, queso fresco or cheese of choice, salsa of choice, lime wedges, etc."],"instructions":["Preheat the oven to 375 degrees F. Gather & prep all ingredients according to Ingredients List, above. ","Brown the chicken: Add the oil to a medium oven-safe skillet over medium heat. While the oil heats, season the chicken with chili powder, cumin, smoked paprika, onion powder, 1 ½ teaspoons kosher salt & ground black pepper as desired. Once the oil is hot & shimmers in the pan, carefully add the chicken to the skillet. Cook 2-3 minutes per side, until browned. The chicken will not yet be fully cooked – this is expected & totally fine.","Mix the chipotle honey sauce: Meanwhile, as the chicken browns, whisk together the chipotle honey sauce. Add the chipotle peppers, adobo sauce, honey, & beer to a small bowl or jar. Whisk or shake to combine. Set aside. ","Roast the chicken: Once browned, remove the skillet from the heat. Pour the chipotle honey sauce over the browned chicken, turning to coat in the sauce. Transfer to the oven & roast for 15-20 minutes, or until an instant-read thermometer inserted in the thickest portion of the chicken registers an internal temperature of 165 degrees F. Set aside to cool slightly.","Shred the honey chipotle chicken: Once cool enough to handle, carefully shred the chicken into bite-sized pieces – you can do so using 2 forks, or my favorite trick: pop the chicken thighs directly into in a stand mixer & let the paddle attachment do the work for you (I swear this works!). Transfer the shredded chicken back into the skillet. Squeeze in the lime juice, and toss to combine. If needed or desired, stir in a cornstarch slurry to tighten up the sauce a bit. ","Serve immediately as desired. Place in tortillas for honey chipotle chicken tacos or make a burrito bowl with rice & beans. Finish with your favorite taco night toppings of choice: sour cream or Mexican crema (or try our famous dairy-free Cashew Crema!), pickled red onions, cilantro, etc. Enjoy!"],"tags":[],"time":{"prep":"","cook":"","total":"35 minutes"},"servings":null,"image":"https://playswellwithbutter.com/wp-content/uploads/2020/12/Chipotle-Honey-Chicken-8-150x150.jpg","slug":"63-easy-honey-chipotle-chicken-tacos.json","url":"https://playswellwithbutter.com/honey-chipotle-chicken-tacos/"}