{"name":"Bacon, Butter, Cheese & Garlic","ingredients":["cjralsonJuly 26, 2013 at 10:19 AMI bet this would be FABULOUS with Julio's chips!! Gonna have to have mom send me a care package soon...Texan born and raised, temporarily displaced as a PROUD Coastie wife!ReplyDeleteRepliesBacon, Butter, Cheese & GarlicJuly 31, 2013 at 4:33 PMGreat!  Let me know how it turns out for you!DeleteRepliesReplyUnknownSeptember 13, 2013 at 12:14 PMI tried this last night, and it was wonderful.  I had sauce let over and will keep it in the fridge for chip dip.  Thanks for posting!DeleteRepliesReplyBacon, Butter, Cheese & GarlicSeptember 14, 2013 at 4:33 PMThat's great, Shannon!  That sauce is so good.  I never thought about dipping chips in it!DeleteRepliesReplyAnonymousApril 2, 2014 at 10:15 PMChuy's mexican restaurants here in Texas serve that dip (minus the avocados) for chips, which is so very addictive and super popular...  make extra and have more tortilla chips on hand.. I like On The Boarder Cantina Thins, best with it! .. can't WAIT to try it with this chicken!! I know it's good with steak dipped in it, too ;)DeleteRepliesReplyReply","AnonymousJuly 31, 2013 at 7:52 AMThat looks AH-mazing! What do you serve it with? ReplyDeleteRepliesBacon, Butter, Cheese & GarlicJuly 31, 2013 at 4:34 PMThank you so much!  I served it with rice and pinto beans that I cooked in the crockpot with garlic, onions, and serrano peppers.  DeleteRepliesReplyReply","UnknownAugust 4, 2013 at 10:01 AMI made this for dinner last night and it was fabulous! We had my husband's grandma and grandpa over for dinner and they just loved it. I doubled the recipe and there are no leftovers! Even my 8 year old daughter ate it! Thanks for sharing the recipe!ReplyDeleteRepliesBacon, Butter, Cheese & GarlicAugust 4, 2013 at 10:04 AMThat's great, Kimberly!  I'm so glad it turned out well for you.  Thank you for the compliment and for letting me know how it turned out!DeleteRepliesReplyReply","Roxy C.August 9, 2013 at 1:18 AMThis recipe sounds heavenly! I am definitely adding this to the menu. :) I do have a question though.. I know you stated to use jalapeños out of a jar, but have you tried using fresh ones? I just don't find the jar jalapeños very spicy. I would love to hear your input. Thanks!ReplyDeleteRepliesBacon, Butter, Cheese & GarlicAugust 9, 2013 at 9:36 AMThank you!  I haven't tried fresh jalapeños, but I think you certainly could use them especially since the sauce gets blended.  I just didn't have any fresh on hand that day.  Great question!DeleteRepliesReplyRoxy C.August 9, 2013 at 3:54 PMThank you for repsonding! I think I will attempt to make your recipe with fresh jalapeños. Like you said, it should be fine since everything will be blended. Can't wait! I will let yoi know how it turns out. Thank you for sharing your recipe.. It is fabulous! P.S. Love your blog!DeleteRepliesReplyBacon, Butter, Cheese & GarlicAugust 9, 2013 at 5:33 PMThank you so much for the compliments, Roxy!  Please do let me know how it turns out.DeleteRepliesReplyReply","katieAugust 9, 2013 at 2:15 AMwhat if i dont have a food processor? is there any other way to blend the ingredients than with a food processor??ReplyDeleteRepliesBacon, Butter, Cheese & GarlicAugust 9, 2013 at 9:37 AMThat's a good question, Katie.  You could use a blender or even put the chips in a zipper bag and crush them with a pot or a rolling pin.DeleteRepliesReplyReply","AnonymousAugust 9, 2013 at 11:22 AMGoing to give this a try tonight! My daughter has been diagnosed with a Gluten allergy this would be a wonderful for that!!  ReplyDeleteRepliesBacon, Butter, Cheese & GarlicAugust 9, 2013 at 5:34 PMOh, great!  Please let me know how it turns out for you and your daughter!DeleteRepliesReplyAnonymousAugust 9, 2013 at 7:03 PMTurned out AMAZING!! made it with a Black Bean Salad with Corn, Red Peppers, Avocado & Lime-Cilantro Vinaigrette That I also found on pinterest. Will be one of our new go to meals!!  Thanks!! DeleteRepliesReplyBacon, Butter, Cheese & GarlicAugust 10, 2013 at 4:52 PMI'm so glad you liked it!  Thank you for letting me know!DeleteRepliesReplyUnknownAugust 11, 2013 at 11:03 AMNot only does the chicken sound delicious but so does this black bean salad. What's that recipe?DeleteRepliesReplyBacon, Butter, Cheese & GarlicAugust 11, 2013 at 11:27 AMThank you, Brandi.  I'm sorry to say that the black bean salad isn't my recipe.  However, I do have an Avocado, Black Bean & Corn Salsa recipe under my appetizers tab that sounds very similar.  It has corn, tomatoes, black beans, red onion, serrano peppers, avocados, and cilantro and lime.  Maybe you'll enjoy that one!DeleteRepliesReplyReply","AnonymousAugust 10, 2013 at 8:52 AMOn the menu for this week. Excited to see how it turns out. Gosh, I love the blog-o-sphere for such amazing recipes! ReplyDeleteRepliesBacon, Butter, Cheese & GarlicAugust 10, 2013 at 4:53 PMThat's great!  Let me know how it turns out!DeleteRepliesReplyReply","AnonymousAugust 10, 2013 at 1:08 PMJust to let you know, I didn't even have to look at the recipe - I fell in love with the ingredients and shared it on FB.  Only missing a few items and they are going to be on today's shopping list1ReplyDeleteRepliesBacon, Butter, Cheese & GarlicAugust 10, 2013 at 4:55 PMThank you so much for sharing it!  I look forward to hearing how it turns out for you!DeleteRepliesReplyReply","UnknownAugust 15, 2013 at 2:50 PMDo you have any issues with the juice from the chicken making this soggy I haven't made it yet butI have had that issue before with baked recipes that have a breading on them. Any suggestions?  ReplyDeleteRepliesBacon, Butter, Cheese & GarlicAugust 15, 2013 at 3:32 PMGood question, Annie.  I didn't have that problem when I made this.  The only thing I'm thinking is that the mayo acts as a grease and cooks the chips.  I'm not sure really.  Let me know if it does turn out soggy though.DeleteRepliesReplyAnonymousMarch 26, 2014 at 12:18 PMcook it on a broiler pan so that the \"drippings\" fall down and don't soak up in the crumbs. Just be sure to put a tiny bit of water in the bottom of your broiler pan so it doesn't burn.DeleteRepliesReplyBacon, Butter, Cheese & GarlicMarch 26, 2014 at 4:18 PMGreat idea!  Thank you for sharing!DeleteRepliesReplyHomeward Bound Cat Rescue TXJanuary 6, 2017 at 5:22 PMcook on a rack DeleteRepliesReplyBacon, Butter, Cheese & GarlicJanuary 7, 2017 at 4:51 PMAnother great idea!DeleteRepliesReplyReply","AnonymousAugust 27, 2013 at 8:55 AMI want to try this using light/low-fat sour cream, cheese & mayo....hope it turns out just as well! Sounds delicious!ReplyDeleteRepliesBacon, Butter, Cheese & GarlicAugust 27, 2013 at 4:52 PMThank you!  I'm sure the light/low fat ingredients will work great if that's what you are used to using.  Let me know how it works for you!DeleteRepliesReplyReply","AnonymousAugust 28, 2013 at 2:17 PMI can't wait to try this!  it sounds delicious!  Thanks for the recipe!ReplyDeleteRepliesBacon, Butter, Cheese & GarlicAugust 29, 2013 at 3:58 PMYou're welcome!  Let me know how it turns out.DeleteRepliesReplyReply","AnonymousAugust 29, 2013 at 12:24 PMcould i use this on pork chops? my husband is allergic to chickenReplyDeleteRepliesBacon, Butter, Cheese & GarlicAugust 29, 2013 at 3:58 PMThat's a great question and a great idea!  I think pork chops would work great.  I'd love to hear how it turns out!DeleteRepliesReplyReply","AnonymousSeptember 7, 2013 at 12:48 AMCould greek yogurt be substituted for the mayo? Looks delicious, but I'd like to find a way to make it healthier!ReplyDeleteRepliesBacon, Butter, Cheese & GarlicSeptember 8, 2013 at 9:13 AMI haven't cooked with Greek yogurt a lot, but I think it would work fine if the yogurt is thick enough to make the chips stick to it.  Great question!  Let me know if it works out!DeleteRepliesReplyReply","AnonymousSeptember 7, 2013 at 7:09 PMThis looks absolutely delicious! I can't wait to try it, but I'm worried because my husband doesn't really like spicy food. How is this dish on the spicy scale? ReplyDeleteRepliesBacon, Butter, Cheese & GarlicSeptember 8, 2013 at 9:15 AMThank you!  I really like spicy food, but this wasn't spicy to me.  You can swap the Pepper Jack cheese with Monterrey Jack cheese on the chicken.  For the ranch sauce, you can use very little jalapenos or you can even leave it out.  Let me know how it turns out!DeleteRepliesReplyReply","AnonymousSeptember 7, 2013 at 8:47 PMMade this for dinner tonight and it was AMAZING! Thanks so much for sharing! ReplyDeleteRepliesBacon, Butter, Cheese & GarlicSeptember 8, 2013 at 9:16 AMThat's great!  Thank you for letting me know and thank you for the compliment!DeleteRepliesReplyReply","AnonymousSeptember 13, 2013 at 5:40 PMDoes the \"T\" in your recipe stand for tablespoon or teaspoon?  I usually interpret a capital T as tablespoon but want to be sure as I'm not used to seeing 1/2 tablespoon as a measure.  I'm making this tonight.  Thanks for sharing. --VickieReplyDeleteRepliesBacon, Butter, Cheese & GarlicSeptember 14, 2013 at 4:29 PMHi, Vickie. The T does stand for tablespoon.  I usually spell out teaspoon.  Let me know how it turns out!DeleteRepliesReplyReply","UnknownSeptember 16, 2013 at 8:21 PMWow does this sound delicious and simple! Will definitely be giving it a try soon!ReplyDeleteRepliesBacon, Butter, Cheese & GarlicSeptember 18, 2013 at 4:19 PMThank you, Angela!  Let me know how it turns out!DeleteRepliesReplyReply","AnonymousOctober 6, 2013 at 1:48 PMFound this on Pinterest and I have cooked it many times for my husband and I. WE LOVE IT!!! its on our menu often :) Great recipe!!!ReplyDeleteRepliesBacon, Butter, Cheese & GarlicOctober 6, 2013 at 2:35 PMThank you!  I'm so glad you found it and y'all love it!DeleteRepliesReplyReply","AnonymousOctober 11, 2013 at 9:19 PMI made this for my fiance tonight and he loved it! I used plain greek yogurt instead of mayonnaise and low-fat sour cream because those are our preferences :)We would like to try adding cilantro to the green sauce next time-- I didn't add the jalapenos because I am a sissy when it comes to really spicy things!We also would like to make a version of the sauce without the ranch to eat with sushi when we make that! Thank you for sharing!!ReplyDeleteRepliesBacon, Butter, Cheese & GarlicOctober 12, 2013 at 5:18 PMThat's great!  I'm sure some of the other people who want to make this healthier will be glad to know that.  And the sauce without the Ranch for sushi sounds great!  Let me know if you make it and how it turns out!DeleteRepliesReplyReply","AnonymousOctober 26, 2013 at 12:12 PMwhat would you serve with this dish?ReplyDeleteRepliesBacon, Butter, Cheese & GarlicOctober 26, 2013 at 6:08 PMYou could serve refried beans and rice or salad if you want to go lighter.  You could also serve my Avocado, Black Bean & Corn Salsa.  Really, you could pair your favorite vegetable with it too!DeleteRepliesReplyReply","UnknownJanuary 3, 2014 at 7:08 PMThis chicken was AMAZING OMG!!!! I made it with my mom tonight for dinner and it was delicious! The chicken was nice and moist and the sauce, oh the sauce. Lovely is the word I would use. However I do have a few pointers for future cookers of this amazing chicken.1. If you have thick chicken breasts like I did it was necessary to cook them for 55 minutes.2. USE THE WHOLE BAG OF CHEESE in the chip mixture. I only used half the bag and the chips didn't stick as nicely as they would if you used all the cheese.3. The sauce recipe makes A LOT of sauce so you could cut it in half and still have enough sauce to bathe in.4. The recipe makes 7 large chicken breasts comfortably so if you have small chicken breasts maybe cut the recipe down a bit.Other than that it was the best chicken I've had in a while. Even my mom who hates jalepenos and avocado together LOVED the chicken. Thank you so much:)ReplyDeleteRepliesBacon, Butter, Cheese & GarlicJanuary 4, 2014 at 3:48 PMThank you so much, Alycia!  We really loved this one too.  And you're right about the sauce.  It's something I make often and use with a lot of stuff.  It's really good on Tex-Mex or Southwestern type salads.  Glad you all enjoyed it!DeleteRepliesReplyBFebruary 16, 2014 at 6:02 PMAgreed on your pointers-- I had very thick chicken and think I'd halve and maybe pound them and roll them loosely if I had thick ones.  Definitely use more cheese and could certainly cut the sauce recipe in half.  Good stuff!DeleteRepliesReplyReply","AnonymousJanuary 25, 2014 at 5:41 PMthis is such an amazing recipe. I found it on Pintrest and we made it just to fill one of our weekly dinners. we were pleasantly surprised! we have made it often and tonight is my mom's birthday and since she loves it so much we are making it again!ReplyDeleteRepliesBacon, Butter, Cheese & GarlicFebruary 7, 2014 at 4:41 PMThank you so much!  So glad you liked it!DeleteRepliesReplyReply","AnonymousFebruary 6, 2014 at 6:29 PMMade it tonight for our wedding anniversary.  We both loved it so much that I am making it again soon.  I used multi grain Tostitos n it gave it a nice flavor. Also, I used the thin cut chicken breast because I feel it bskes best.  Thanks for sharing recipe,  its amazingReplyDeleteRepliesBacon, Butter, Cheese & GarlicFebruary 7, 2014 at 4:42 PMThank you so much for the compliment!  I'm so happy you liked it!DeleteRepliesReplyReply","AnonymousFebruary 23, 2014 at 6:01 PMMade this tonight, big hit with the family! Will definitely make again!ReplyDeleteRepliesBacon, Butter, Cheese & GarlicFebruary 25, 2014 at 6:07 PMThat's great!  Thank you for letting me know!DeleteRepliesReplyReply","AnonymousMarch 31, 2014 at 5:40 PMI just made this for dinner. It was amazing!!!!  Will definitely make it again!!!!!ReplyDeleteRepliesBacon, Butter, Cheese & GarlicMarch 31, 2014 at 6:23 PMThat's great!  Thank you for letting me know!DeleteRepliesReplyReply","AnonymousApril 8, 2014 at 3:09 PMSo what pan would be best to cook the chicken in? Do you think a glass one would work, or a cookie sheet?ReplyDeleteRepliesBacon, Butter, Cheese & GarlicApril 8, 2014 at 3:44 PMFor me, I think a cookie sheet works better, but I think a glass pan would work too.DeleteRepliesReplyReply","Carrie SernaApril 11, 2014 at 6:19 PMThis is baking right now...will review tonight! My house smells so good!ReplyDeleteRepliesReply","AnonymousJuly 5, 2014 at 2:44 PMCan't wait to try this! Do you recommend a plain chip or a spicy, flavored chip? ReplyDeleteRepliesBacon, Butter, Cheese & GarlicJuly 5, 2014 at 5:05 PMI used plain tortilla chips, but I think any flavor, spicy or something else, would work great here.  I'd love to know what you try and how it turns out!DeleteRepliesReplyReply","AsmitaJuly 8, 2014 at 12:58 PMThis recipe was amazing! It turned out great and tasted absolutely amazing. The dip lasted a really long time in the fridge, also. Thanks for posting this!ReplyDeleteRepliesReply","ElaineJuly 15, 2014 at 12:13 PMI was a little hesitant to make this since my boyfriend doesn't like dairy products and meat together. However, since I do most of our cooking, I tend to get a little selfish and make what I feel like making. >:DI don't have a food processor so I crushed the chips up between two sheets of parchment paper using a meat tenderizer. Also, I only thawed two chicken breasts, but they were HUGE. I had trouble cooking others from the same package, so this time I cut them into strips and really went all out coating them. Kept 'em in for 25 minutes and I could hardly wait for them to cool. The edges of each strip got so brown (which I love) and they were super crunchy. When I presented them to my boyfriend, he said, \"Ooh cool, schnitzel!\" Sure, bud. If thinking it's schnitzel will get you to eat it, it's schnitzel. He liked it very much, even after I told him about all the dairy inside. As for the sauce, I have a ton left over, which is fine by me. Mine came out a little too ranchy because one of my avocados went bad and I couldn't use it, but I'm still gonna chow down.This is definitely a dish I plan to make regularly! Thanks so much for your brilliance! ReplyDeleteRepliesBacon, Butter, Cheese & GarlicJuly 15, 2014 at 3:34 PMYou're so welcome, Elaine!  I'm so glad the two of you liked it, and I really appreciate the compliments!DeleteRepliesReplyReply","AnonymousJuly 23, 2014 at 3:59 PMI made this for my freezer meal group.  Prepped the raw chicken and froze it (chip-coated) in a disposible tin dish.  I also froze the sauce and it all turned out great!  Thawed it out in the fridge and baked for 35-40 mins.  Perfect!   ReplyDeleteRepliesReply","AnonymousOctober 7, 2014 at 2:42 AMSeriously this was incredible. I'm going to have to go through all your recipes now - I hope they're all equally amazing!!ReplyDeleteRepliesBacon, Butter, Cheese & GarlicOctober 7, 2014 at 3:34 PMThank you so much!  I'm so glad you enjoyed it!DeleteRepliesReplyReply","AnonymousJanuary 6, 2015 at 2:21 PMDo you think this would freeze alright? I freeze a lot of leftovers for my husband to take to work. ReplyDeleteRepliesBacon, Butter, Cheese & GarlicJanuary 6, 2015 at 4:36 PMI'm not sure how the chips would do after being thawed out.  I'm afraid they might get soggy.  If you do try it, please let us know!DeleteRepliesReplyReply","AnonymousApril 25, 2015 at 2:43 AMMade this tonight and it was a big hit even with the fussy kids. I don't use the processed ranch packets so made my own with the recipe from heavenly homemakers blog. I would likely only make a quarter of the sauce next time, there was a lot. I couldn't stop eating the leftover crispy bits from the pan when I was cleaning up. Definitely a keeper thanks!ReplyDeleteRepliesBacon, Butter, Cheese & GarlicApril 25, 2015 at 4:07 PMYou're so welcome!  So glad you liked it!DeleteRepliesReplyReply","AnonymousDecember 11, 2015 at 7:30 PMI read the recipe wrong and thought it said milk so i do not have buttermilk on hand.. what can i used instead ? ReplyDeleteRepliesBacon, Butter, Cheese & GarlicDecember 12, 2015 at 5:16 PMYou could probably use regular milk, but you may need to add a little more mayo to thicken it up.  Enjoy!DeleteRepliesReplyReply","AnonymousAugust 16, 2016 at 7:43 PMI used the lime tortilla chips and it was great. ReplyDeleteRepliesBacon, Butter, Cheese & GarlicAugust 17, 2016 at 4:50 PMSounds fantastic! So glad you enjoyed it!DeleteRepliesReplyReply","Harmony INovember 7, 2016 at 7:26 PMI've made this a few times after seeing this recipe. ALWAYS a hit. Not soggy at all. I bring the chicken to room temperature before dredging them. Incredible taste, delicious sauce. Best chicken I have EVER made and best I have ever HAD.ReplyDeleteRepliesBacon, Butter, Cheese & GarlicNovember 8, 2016 at 4:49 PMThank you so much for the kind words, Harmony!  I'm so happy that you enjoy it!DeleteRepliesReplyReply","AnonymousFebruary 14, 2017 at 3:32 PMAfter I prepared the chicken, I put them on a brioche bun and made into a sandwich. Tasted greatReplyDeleteRepliesBacon, Butter, Cheese & GarlicFebruary 14, 2017 at 4:38 PMSounds great!  So glad you enjoyed it!DeleteRepliesReplyReply"],"instructions":["\nHome\n","\nContact Me\n","\nBloggers\n","Crockpot meals","Football food","Gnocchi from scratch","Homemade Buffalo wing sauce","A Special Meal for my ValentineUPDATE:If you leave a comment on this post, it will get published.However since there are so many comments, for some strange reason,...","Time to ImpressSo I made this baked chicken last night.And I was impressed.It was one of those wow moments you get when something turns out really...","Going CrazyIf you're on Pinterest, I'm sure you've seen a version of Crazy Bread out there.We've tried a few, and this stuff is aw...","The Wow FactorI was looking for a quick and tasty chicken dinner last week, and one thing I saw over and over was a recipe called Chicken Lazone.It...","Happy DanceDo you ever get in the kitchen and create something that makes you do a little happy dance?Even better, has your family ever done a hap...","Restaurant RedoOne of my readers, Debbie, recently emailed me and asked me if I had a recipe for Eat'N Park's Seafood Pasta Bake.I told her I ...","Volcano PotatoesHere is an interesting new way to cook potatoes.These are Volcano Potatoes.I parbaked potatoes, hollowed them out, stuffed them, wrap...","I Love ChipsDrop everything you're doing right now.Seriously.What I'm about to share with you is mind blowing.I made a touchdown in the...","Fire CrackersI'm really really sorry to do this to you.It's really not fair of me to post something so ridiculously addicting.These Fire ...","Corn CasseroleCORN CASSEROLE1/4 stick butter1/4 C flour1 C chicken stock1/2 C milk1/2 C sour cream1 box Jiffy cornbread mix2 eggs1 1/...","There are an average of 8 peas in pea pods.","Facebook videos about animals","Foosball","\"Lost\" the TV show (I know, I'm behind)","Smoked gouda","►2016(71)December(2)November(3)October(7)September(3)August(7)July(6)June(3)May(8)April(6)March(8)February(9)January(9)","December(2)\n","November(3)\n","October(7)\n","September(3)\n","August(7)\n","July(6)\n","June(3)\n","May(8)\n","April(6)\n","March(8)\n","February(9)\n","January(9)\n","►2015(161)December(7)November(5)October(12)September(15)August(11)July(13)June(17)May(11)April(17)March(17)February(18)January(18)","December(7)\n","November(5)\n","October(12)\n","September(15)\n","August(11)\n","July(13)\n","June(17)\n","May(11)\n","April(17)\n","March(17)\n","February(18)\n","January(18)\n","►2014(227)December(22)November(14)October(12)September(13)August(15)July(17)June(21)May(19)April(22)March(27)February(25)January(20)","December(22)\n","November(14)\n","October(12)\n","September(13)\n","August(15)\n","July(17)\n","June(21)\n","May(19)\n","April(22)\n","March(27)\n","February(25)\n","January(20)\n","▼2013(302)December(15)November(17)October(16)September(19)August(19)July(29)June(27)May(25)April(29)March(41)February(33)January(32)","December(15)\n","November(17)\n","October(16)\n","September(19)\n","August(19)\n","July(29)\n","June(27)\n","May(25)\n","April(29)\n","March(41)\n","February(33)\n","January(32)\n","►2012(3)December(3)","December(3)\n","►2011(3)October(1)September(2)","October(1)\n","September(2)\n","►2010(1)July(1)","July(1)\n"],"tags":[],"time":{"prep":"","cook":"","total":""},"servings":null,"image":"","Image":"","url":"https://baconbuttercheesegarlic.blogspot.com/2013/07/i-love-chips.html"}