{"name":"Chicken Pillows with Creamy Parmesan Sauce","ingredients":["\n\t\t\t\t\t\t4 large boneless, skinless chicken breasts (about 2 1/2 – 3 pounds)\t\t\t\t\t","\n\t\t\t\t\t\t2 packages (8 ounces each) cream cheese, light or regular, softened to room temperature\t\t\t\t\t","\n\t\t\t\t\t\t1 teaspoon garlic powder\t\t\t\t\t","\n\t\t\t\t\t\t1 teaspoon salt\t\t\t\t\t","\n\t\t\t\t\t\t1 batch buttery crescent rolls\t\t\t\t\t","\n\t\t\t\t\t\t1/2 cup (1 stick) butter, melted\t\t\t\t\t","\n\t\t\t\t\t\t2 cups panko bread crumbs\t\t\t\t\t","\n\t\t\t\t\t\t1/2 cup freshly grated Parmesan cheese\t\t\t\t\t","\n\t\t\t\t\t\t3 tablespoons butter\t\t\t\t\t","\n\t\t\t\t\t\t3 tablespoons flour\t\t\t\t\t","\n\t\t\t\t\t\t1 chicken bouillon cube or 1 teaspoon chicken bouillon granules\t\t\t\t\t","\n\t\t\t\t\t\t1/2 teaspoon salt\t\t\t\t\t","\n\t\t\t\t\t\t1/4 teaspoon black pepper\t\t\t\t\t","\n\t\t\t\t\t\t1 1/2 cups milk\t\t\t\t\t","\n\t\t\t\t\t\t3/4 cup freshly grated Parmesan cheese\t\t\t\t\t","\n\t\t\t\t\t\t1 cup sour cream, light or regular\t\t\t\t\t"],"instructions":["AboutAboutContactFAQFavorite ThingsFriday ThoughtsGift Guides","About","Contact","FAQ","Favorite Things","Friday Thoughts","Gift Guides","RecipesRecipe IndexMain DishesDessertsHealthy Recipes30-Minute MealsBreakfastMake-Ahead Meals","Recipe Index","Main Dishes","Desserts","Healthy Recipes","30-Minute Meals","Breakfast","Make-Ahead Meals","The Best Recipes","Menu Plans","AboutAboutContactFAQFavorite ThingsFriday ThoughtsGift Guides","About","Contact","FAQ","Favorite Things","Friday Thoughts","Gift Guides","RecipesRecipe IndexMain DishesDessertsHealthy Recipes30-Minute MealsBreakfastMake-Ahead Meals","Recipe Index","Main Dishes","Desserts","Healthy Recipes","30-Minute Meals","Breakfast","Make-Ahead Meals","The Best Recipes","Menu Plans","4 large boneless, skinless chicken breasts (about 2 1/2 – 3 pounds)","2 packages (8 ounces each) cream cheese, light or regular, softened to room temperature","1 teaspoon garlic powder","1 teaspoon salt","1 batch buttery crescent rolls","1/2 cup (1 stick) butter, melted","2 cups panko bread crumbs","1/2 cup freshly grated Parmesan cheese","3 tablespoons butter","3 tablespoons flour","1 chicken bouillon cube or 1 teaspoon chicken bouillon granules","1/2 teaspoon salt","1/4 teaspoon black pepper","1 1/2 cups milk","3/4 cup freshly grated Parmesan cheese","1 cup sour cream, light or regular","Mixing Bowl","Pizza Cutter","Cookie Sheet {Half Sheet Pan}","Mel—June 22, 2020 @ 11:38 pmReplyTry baking them with one rack in the top third of the oven and the other rack in the bottom third and rotate halfway through. If they are unbaked, you can bake from frozen (reduce the oven temp by 25 degrees and add time as needed until they are cooked through OR thaw in the fridge overnight and bake as directed in the recipe).","Mel—January 14, 2019 @ 7:26 amReplyYes, I bake them once the filling is wrapped inside the dough. You can let them rest for 15-20 minutes before baking if you want a puffier outside crust, but I usually don’t.","Mel—October 30, 2018 @ 8:34 pmReplyDid you freeze them unbaked or already baked?","Mel—February 20, 2018 @ 9:31 pmReplyProbably a month or two.","Mel—September 7, 2017 @ 3:42 pmReplyIt’s such a thin layer of dough around the filling that it doesn’t need to rise like if you were making rolls. As they rest (while the oven preheats), they’ll puff a little and that’s perfect.","Mel—April 18, 2017 @ 11:05 pmReplyI usually pop them in the oven and reheat that way (from frozen, I cover with foil so they don’t get too browned and then uncover for the last few minutes of baking).Chantelle Ivie—April 5, 2018 @ 6:18 pmReplyHow long do you reheat them in the oven?Mel—April 9, 2018 @ 10:34 amReply15 minutes or so on 250 degrees.","Chantelle Ivie—April 5, 2018 @ 6:18 pmReplyHow long do you reheat them in the oven?Mel—April 9, 2018 @ 10:34 amReply15 minutes or so on 250 degrees.","Mel—April 9, 2018 @ 10:34 amReply15 minutes or so on 250 degrees.","Mel—April 11, 2016 @ 2:25 pmReplyI’ve done both, Shelby. It’s a little faster (when you want to eat them) to bake them and then freeze because then you only have to thaw and reheat instead of thawing, letting them rest and rise a bit and then bake.","Mel—March 9, 2016 @ 1:42 pmReplyHi Andrea – basically, you just want rectangles or squares of dough probably 1/4-inch thick and about 2X3-inches or 3X3-inches or thereabouts. It’s not an exact science, I just try not to get the dough too thick. I’ll try to remember to take pictures next time I make them (sometimes it’s a little crazy around here during dinner time!)","Mel—January 23, 2015 @ 8:41 pmReplyThese freeze great, Kelly! After I’ve dipped them in the butter/crumbs, I freeze them on a baking tray and after frozen, I pop them into a freezer ziploc bag. I’ve frozen the sauce a time or two – it works pretty well but it is slightly grainy after thawing and heating so usually I just make the sauce the day of. Hope that helps!","Mel—August 4, 2014 @ 9:03 pmReplyJen – Each piece of dough should be about 6 1/2-inches long and 1 1/2 or slightly more inches wide…then press them flat a little to make them even a bit wider. If you find another way works to cut the dough, that’s great, too, since it doesn’t have to be exact. I press the dough into a rectangle with the long sides parallel to the counter and cut it in half like a hot dog bun and then cut the strips from there.","Mel—April 14, 2014 @ 2:51 pmReplyLeslie – Yes, it can be frozen.","Mel—January 24, 2014 @ 1:44 pmReplyMarci – I always put the panko crust on them while I’m making them. It makes them maybe slightly less crunchy but I like to get all the mess of preparation out of the way at once. You certainly could wait, though, and bread them before baking. If you refrigerate them for the day, I’d let them sit out of the refrigerator for a half hour or so before baking. And yes, you could make the dough the night before and refrigerate it. Make sure you take it out of the refrigerator an hour or so before using in the recipe – cold dough is a beast to work with!","Mel—May 14, 2013 @ 1:53 pmReplySusie – you could definitely try it although my experience has been that creamy sauces like this turn a little grainy and sometimes separate after being frozen and reheated.","Mel—April 12, 2013 @ 3:02 pmReplyHi Trish – I haven’t tried that. I think it would make the consistency of the filling a bit too runny. The thick cream cheese helps give it some stability.","Mel—November 18, 2011 @ 10:25 pmReplyHi Kris – I’ve frozen these a time or two and I bake them from frozen (because usually I’m not on top of things to remember to thaw them first). I bake them at the same temperature but add on an additional 15-20 minutes for baking. You’ll want to check them often and potentially decrease or increase that time based on your oven since all ovens vary a bit. Good luck!","Mel—July 7, 2011 @ 1:25 pmReplyAmy – I like Melissa’s idea, too. I think the filling would work great in a braid because it is very hearty and probably wouldn’t melt out of the braid. The only disadvantage to a braid, in my opinion, is less buttery bread around the filling, but overall, I think the idea is great.","Mel—July 7, 2011 @ 1:26 pmReplyAmy – good question, for this full batch, I would say I probably used maybe 3-4 cups.","Mel—July 7, 2011 @ 1:26 pmReplyClaire – I throw it in frozen since that’s usually what I have on hand (and haven’t taken the time to thaw it).","Mel—July 7, 2011 @ 1:29 pmReplyJody – I agree with Kim who chimed in on this issue…yes, I definitely think you can freeze these, but if it were me, I’d fill the rolls, coat them in crumbs and freeze them. You could probably even pop them right out of the freezer and into the oven and add maybe 5-7 minutes (just a guess) onto the baking time.","^ Back to Top","Home","Recipes","About","Contact","FAQ","Privacy Policy"],"tags":[],"time":{"prep":"30 minutes","cook":"45 minutes","total":"15 minutes"},"servings":null,"image":"","Image":"","url":"https://www.melskitchencafe.com/chicken-pillows-with-creamy-parmesan-sauce/"}