{
  "name": "Chicken Pillows with Creamy Parmesan Sauce",
  "ingredients": [
    "\n\t\t\t\t\t\t4 large boneless, skinless chicken breasts (about 2 1/2 – 3 pounds)\t\t\t\t\t",
    "\n\t\t\t\t\t\t2 packages (8 ounces each) cream cheese, light or regular, softened to room temperature\t\t\t\t\t",
    "\n\t\t\t\t\t\t1 teaspoon garlic powder\t\t\t\t\t",
    "\n\t\t\t\t\t\t1 teaspoon salt\t\t\t\t\t",
    "\n\t\t\t\t\t\t1 batch buttery crescent rolls\t\t\t\t\t",
    "\n\t\t\t\t\t\t1/2 cup (1 stick) butter, melted\t\t\t\t\t",
    "\n\t\t\t\t\t\t2 cups panko bread crumbs\t\t\t\t\t",
    "\n\t\t\t\t\t\t1/2 cup freshly grated Parmesan cheese\t\t\t\t\t",
    "\n\t\t\t\t\t\t3 tablespoons butter\t\t\t\t\t",
    "\n\t\t\t\t\t\t3 tablespoons flour\t\t\t\t\t",
    "\n\t\t\t\t\t\t1 chicken bouillon cube or 1 teaspoon chicken bouillon granules\t\t\t\t\t",
    "\n\t\t\t\t\t\t1/2 teaspoon salt\t\t\t\t\t",
    "\n\t\t\t\t\t\t1/4 teaspoon black pepper\t\t\t\t\t",
    "\n\t\t\t\t\t\t1 1/2 cups milk\t\t\t\t\t",
    "\n\t\t\t\t\t\t3/4 cup freshly grated Parmesan cheese\t\t\t\t\t",
    "\n\t\t\t\t\t\t1 cup sour cream, light or regular\t\t\t\t\t"
  ],
  "instructions": [
    "To begin, cook the chicken (or use already cooked, shredded chicken). My preferred method is to put the chicken breasts in 2 cups chicken broth seasoned with salt and pepper in the slow cooker and cook on low for 6 hours. When the chicken is cooked and cooled slightly, shred or cut into small pieces. In a medium bowl combine the chicken, cream cheese, garlic powder and salt and mix until well combined. Set aside or refrigerate until ready to use.",
    "Make the buttery crescent rolls according to the recipe but after the first rise, deflate the dough and separate into two pieces. Roll each piece of dough into a 13X20-inch rectangle and cut each rectangle into 12 pieces (cutting lengthwise in half and then each half into six pieces). One by one, flatten each dough piece slightly and spoon about 1/4 cup of the chicken/cream cheese mixture into the center. Fold up all the sides and pinch them together to seal well.",
    "When all the chicken pillows have been formed, combine the panko crumbs and Parmesan cheese in a bowl or flat dish (like a pie plate). One by one, dip each chicken pillow in the melted butter and roll in the panko/Parmesan mixture. Place seam side down about 2 inches apart on baking trays lined with parchment paper, a silpat liner or lightly greased.",
    "Bake in a preheated oven at 375 degrees F for 18-20 minutes, until the chicken pillows are lightly golden brown and the dough is baked through.",
    "While the rolls are baking, prepare the sauce. In a medium saucepan, melt the butter. Whisk in the flour, cooking over medium heat for 1-2 minutes, stirring constantly, until the mixture is golden and bubbly. Slowly whisk in the milk, stirring in the chicken bouillon, salt and pepper once the milk has been completely added. Stir constantly over medium heat until the sauce thickens and bubbles, about 5-10 minutes, taking care to adjust the heat accordingly so the sauce doesn’t burn on the bottom. Stir in the Parmesan cheese and cook, stirring, until the cheese is melted. Remove the sauce from the heat and stir in the sour cream. Thin the sauce with a little milk if needed.",
    "Serve the rolls warm from the oven with Parmesan cream sauce drizzled over the top."
  ],
  "tags": [
    "chicken",
    "dinner",
    "main dish"
  ],
  "time": {
    "prep": "30 minutes",
    "cook": "",
    "active": "",
    "inactive": "",
    "ready": "",
    "total": "1 hour15 minutes"
  },
  "servings": "20-24 chicken pillows",
  "image": "https://www.melskitchencafe.com/wp-content/uploads/2013/04/Pillows2-jpg.jpg",
  "url": "https://www.melskitchencafe.com/chicken-pillows-with-creamy-parmesan-sauce/"
}
