{"name":"Chocolate Lava Cakes","ingredients":["6 ounces (170g) high quality semi-sweet chocolate*","1/2 cup (115g; 1 stick) unsalted butter","1/4 cup (31g) all-purpose flour (spoon & leveled)","1/2 cup (60g) confectioners’ sugar","1/8 teaspoon salt","2 large eggs","2 large egg yolks*","optional for topping: ice cream, raspberries, and/or chocolate syrup"],"instructions":["Spray four 6 ounce ramekin with nonstick cooking spray and dust with cocoa powder. This ensures the cakes will seamlessly come out of the ramekins when inverted onto a plate in step 7. *Or spray half of a 12-count muffin pan and dust with cocoa powder. If baking in a muffin pan, the recipe will yield 6 cakes.","Preheat oven to 425°F (218°C).","Coarsely chop the chocolate. Place butter into a medium heat-proof bowl, then add chopped chocolate on top. Microwave on high in 10 second increments, stirring after each until completely smooth. Set aside.","Whisk the flour, confectioners’ sugar, and salt together in a small bowl. Whisk the eggs and egg yolks together until combined in another small bowl. Pour the flour mixture and eggs into the bowl of chocolate. Slowly stir everything together using a rubber spatula or wooden spoon. If there are any lumps, gently use your whisk to rid them. The batter will be slightly thick.","Spoon chocolate batter evenly into each prepared ramekin or muffin cup.","Place ramekins onto a baking sheet and bake for 12-14 minutes until the sides appear solid and firm– the tops will still look soft. *If baking in a muffin pan, the cakes only take about 8-10 minutes.","Allow to cool for 1 minute, then cover each with an inverted plate and turn over. Use an oven mitt because those ramekins are hot! The cakes should release easily from the ramekin. *If you used a muffin pan, use a spoon to release the cakes from the pan and place each upside down on plates.","Add toppings. Serve immediately."],"tags":[],"time":{"prep":"","cook":"","total":"25 minutes"},"servings":null,"image":"","Image":"data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20265%20265'%3E%3C/svg%3E","url":"https://sallysbakingaddiction.com/chocolate-lava-cakes/"}