{"name":"Dutch Oven Peach Cobbler","ingredients":["6 tablespoons unsalted butter","3 pounds ripe peaches about 5-6 large or 8-9 small/medium peaches","1/3 cup honey","2 tablespoons cornstarch","1 teaspoon vanilla extract","½ teaspoon ground cinnamon","½ teaspoon ground ginger","3/4 cup granulated sugar","1/3 cup white whole wheat flour","1/3 cup all purpose flour","2 teaspoons baking powder","1/2 teaspoon kosher salt","1/2 cup milk","Vanilla ice cream homemade whipped cream, Greek yogurt, or a pour of heavy cream"],"instructions":["If baking in the oven, preheat the oven to 350 degrees F (See recipe notes to if cooking this cobbler over a campfire.) Place the butter in the bottom of a 10-inch dutch oven or a 3-quart baking dish with high sides. Once the butter is melted, remove the dish from the oven.","To quickly and easily peel the peaches: Bring a very large pot with enough water to cover the peaches to a boil. While the water comes to a boil, prepare an ice bath by placing a handful of ice cubes in a large bowl and then filling it with cold water. Once the water is boiling, with a slotted spoon or tongs to protect your fingers, gently lower the peaches into the water. Add the peaches in two batches so that the water temperature does not rapidly drop. Boil for 1 minute. Remove peaches from the pot and plunge into the ice bath to stop the cooking. The skins can now be easily slipped off with your fingers. Cut peaches into 1/3-ish inch wide slices, then place the slices into a large mixing bowl. If you prefer, you can peel the peaches with a vegetable peeler.","To the bowl with the peaches, add the honey, cornstarch, vanilla extract, cinnamon, and ginger. Stir gently to combine. Set aside.","In a separate bowl, prepare the topping. Whisk together the sugar, white whole wheat flour, all purpose flour, baking powder, and salt. Add the milk, and whisk to combine. Gently pour the batter over the melted butter. DO NOT STIR. Now, carefully spoon the fruit and any juices that have collected in the bottom of the bowl on top of the batter. Again, DO NOT STIR.","Bake for 50 to 60 minutes, until the topping is deep golden at the edges and a toothpick inserted in the middle of the topping (not the peach filling) comes out clean. The topping will rise above the peaches, puff up, and turn golden so that you have a cake with fruit beneath. Serve the cobbler warm with whipped cream, a scoop of ice cream, or our family favorite: a pour of heavy cream."],"tags":[],"time":{"prep":"30","cook":"50","total":"20"},"servings":null,"image":"","Image":"data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20250%20250'%3E%3C/svg%3E","url":"https://www.wellplated.com/dutch-oven-peach-cobbler/"}