{"name":"Smothered Baked Chicken Burritos","ingredients":["1 Recipe Slow Cooker Mexican Chicken","6 burrito size tortillas (I prefer raw/undercooked tortillas)*","1 cup shredded sharp cheddar cheese","olive oil or nonstick cooking spray","2 tablespoons olive oil","1 tablespoon butter","3 tablespoons flour","2 cups low sodium chicken broth, warmed","1/2 teaspoon cumin","1/4-1/2 teaspoon salt","1/4 teaspoon pepper","1/2 cup sour cream","1/2 4 oz. can mild chopped green chilies, or more to taste","1/2 cup shredded sharp cheddar cheese","Hot sauce to taste (optional)","Tomatoes","Avocados/guacamole","cilantro","salsa","tortilla strips or chips"],"instructions":["Prepare Mexican Chicken according to recipe directions (click on 1 Recipe Slow Cooker Mexican Chicken for recipe). Drain any excess liquid from chicken.","Preheat oven to 400 degrees F. Line a baking sheet with foil and add a baking rack on top. Prepare burritos by adding a heaping ½ cup filling to each tortilla (uncooked if using raw tortillas), top with desired amount of cheese and roll up burrito style. Place burritos on the baking rack and brush both sides lightly with olive oil or spray with nonstick cooking spray. Cook for 18-20 minutes or until golden. Broil to desired crispiness, flip over and broil the other side until golden.","Meanwhile, prepare Sauce by melting butter in olive oil in a medium saucepan over medium heat. Whisk in flour and cook, stirring constantly for 3 minutes. Reduce heat to low then gradually whisk in chicken broth. Add spices and bring to a simmer while stirring until thickened, about 2-3 minutes. Remove from heat and stir in green chilies, cheese until melted then sour cream. Add hot sauce to taste (optional).","To serve, top burritos Cheesy Green Chili Sour Cream Sauce and desired toppings."],"tags":[],"time":{"prep":"10","cook":"20","total":""},"servings":null,"image":"","Image":"data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20187%20280'%3E%3C/svg%3E","url":"https://carlsbadcravings.com/smothered-baked-chicken-burritos-recipe/"}