{"name":"Sweet Potato Hash with Sausage and Eggs {Paleo & Whole30}","ingredients":[" 3 Tbsp coconut oil divided, for cooking"," 2 small/med sweet potatoes chopped into small pieces about 1/2 inch"," 1 med onion chopped"," 1 small/med bell pepper red, orange, yellow, chopped"," 1/2 lb fresh bulk sausage sugar free for Whole30*- see note"," 1/4-1/2 tsp paprika or smoked paprika"," Sea salt and black pepper"," Pinch red pepper flakes Optional, for the sausage"," 4 eggs"," Thinly sliced scallions for garnish"],"instructions":["**Note - You will cook the sausage in the same pan with the onions and peppers and the potatoes separately, until the end.","Preheat oven to 400 degrees (you will use it to bake the eggs into the skillet at the very end)","Heat a large skillet, preferably cast iron, over medium heat and add 1 Tbsp of the coconut oil to melt. Once sizzling, crumble the sausage into the pan, and stir while cooking to evenly brown. Sprinkle with a pinch of red pepper flakes.","When sausage is about 3/4 of the way done, add the onions and peppers and continue to cook and stir until the sausage is browned and the onions and peppers are soft and fragrant. Remove from heat and set aside until the potatoes are done.","Meanwhile in a separate skillet over medium heat, add the remaining 2 Tbsp of coconut oil to melt. Add the chopped sweet potatoes and stir to coat. Sprinkle with smoked paprika, sea salt and pepper to taste.","Cook and stir, uncovered, until the outside begins to brown, then cover the skillet (any cover that mostly fits will do!) and continue to cook to soften the inside of the potatoes, uncovering to stir once in a while. Adjust the heat if necessary to prevent burning, and add a bit more coconut oil if necessary. This step should take about 7 minutes total, give or take.","Once the potatoes are softened and browned, transfer them to the sausage mixture and stir to combine. Create 4 indents where you will crack each egg - then carefully crack the eggs into the spaces (I like to create a bit of space for the eggs so the yolks don't break and the whites don't run all over!)","Put the entire skillet in the 400 degree oven to bake the eggs to preference, about 10-15 minutes. Alternatively, you can cook the eggs by covering the skillet and cooking over medium-low heat until the eggs are done. I prefer the oven method to avoid burning the bottom of the hash, but either way should work!","Serve hot and enjoy!"],"tags":[],"time":{"prep":"10 minutes","cook":"25 minutes","active":"","inactive":"","ready":"","total":"35 minutes"},"servings":"4","url":"https://www.paleorunningmomma.com/sweet-potato-hash-sausage-paleo-whole30/"}