{"name":"The Hasselback potato – The perfect cross between baked and roasted","ingredients":["Pre heat the oven to 220C (425F)","First prepare the potatoes. If you wish to leave the skins on, then give them a wash, otherwise peel them.\nCut slices into the potato, roughly 3-4mm (1/8 inch) using a wooden spoon as a cutting board (see picture above)","Place the potatoes onto a baking tray. Brush with the butter and sprinkle with salt.","Put the baking tray into the oven for 60 mins, re basting with the butter from the tray after about 30 mins, making sure that it gets into the openings of the potato","Serve","\n\t\t\t\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\n\t\t\t\t\t\n                        \n                \n                Christina Rioux on February 4, 2021 at 9:12 am\n                #\n                Reply\n            \n    \n\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\tI made them for the first time this week using the Hasselback tool.  You still have to be careful about cutting down too far. I melted butter with sea salt, fresh ground pepper and Herbs de Provence then drizzled over the potatoes. They were fabulous and looked gorgeous. Wish I could post the picture.\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\n\t\t\t\n\t\t\t\t\t\t\t\n\t"],"instructions":["","","","","","","","Home","RecipesAppetizerAsianBarbequeBeefBread and BakingCocktails and other drinksDesserts Desserts, Sweets, Puddings, Candy and other sweet thingsItalianLunchOne Pot MealsPorkPoultrySandwichesSauce & GravySeafoodSide DishSnackVegetables and Salads","Appetizer","Asian","Barbeque","Beef","Bread and Baking","Cocktails and other drinks","Desserts Desserts, Sweets, Puddings, Candy and other sweet things","Italian","Lunch","One Pot Meals","Pork","Poultry","Sandwiches","Sauce & Gravy","Seafood","Side Dish","Snack","Vegetables and Salads","ReviewsRestaurant ReviewsFood ReviewsBook ReviewsDrink ReviewsProduct Reviews","Restaurant Reviews","Food Reviews","Book Reviews","Drink Reviews","Product Reviews","The Kitchen SinkEssential Kitchen RequirementsTechniquesNuggetsWeirdFood GardeningThe Kitchen Sink","Essential Kitchen Requirements","Techniques","Nuggets","Weird","Food Gardening","The Kitchen Sink","AboutWhy we are not foodiesGet in touch","Why we are not foodies","Get in touch","By Stuart in Recipe, Side Dish, Techniques, Vegetables and Salads","2 medium sized potatoes per person","4 tbsp of butter, olive oil or duck fat","Coarse Salt","Hasselback Cutting Board","Wooden Spoon","Potatoes","Hasselback Cutting Rack"," baked potato, hasselback potato, hasselback potato recipe, hasselback potatoes, Hasselbacken, Hasselbackspotatis, kitchen secret, roast potato, Sweden","","Christina Rioux on February 4, 2021 at 9:12 am","#","Reply","\nOven Baking Sausage: Quick, Easy and Minimal Mess\n","\nCarving the Turkey Early, Reducing the Stress of the Holiday Meal\n","\nArtichokes, Shallots & Capers a Versatile Warm Salad\n","\nUncle Nicky Stabile’s Italian Cheese and Pork Sausage Recipe\n","\nEasy Fresh Grated Hard Italian Cheese At Home\n","We are not foodies on Twitter","Cooking with Karl","GGlaRua","The Misfit Baker","Smitten Kitchen"],"tags":[],"time":{"prep":"","cook":"","total":""},"servings":null,"image":"","Image":"","url":"https://wearenotfoodies.com/the-hasselback-potato-the-perfect-cross-between-baked-and-roasted/"}