[{"name":"A Very Popular BBQ Sauce","ingredients":["1 ½ cups brown sugar","1 ½ cups ketchup","½ cup red wine vinegar","½ cup water","1 tablespoon Worcestershire sauce","2 ½ tablespoons dry mustard","2 teaspoons paprika","2 teaspoons salt","1 ½ teaspoons black pepper","2 dashes hot pepper sauce"],"instructions":["In a blender, combine brown sugar, ketchup, vinegar, water and Worcestershire sauce. Season with mustard, paprika, salt, pepper, and hot pepper sauce. Blend until smooth."],"tags":[],"time":{"prep":"10 mins ","cook":"","active":"","inactive":"","ready":"","total":"10 mins "},"servings":"32 ","image":"https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1500&h=750&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2021%2F10%2F28%2FA-Very-Popular-BBQ-Sauce-Jeanette-Bedford-2000.jpg","slug":"61-a-very-popular-bbq-sauce.json","url":"https://www.allrecipes.com/recipe/51226/a-very-popular-bbq-sauce/"},{"name":"Apple & Brie Crostini with Hot Honey","ingredients":["For the crostini:","1 french baguette, cut diagonally into 1/2 inch slices","8 ounces brie cheese, sliced (you’ll need as many slices as crostini slices you have)","1 large honeycrisp or granny smith apple, thinly sliced","2 ounces prosciutto, cut into 20 pieces and rolled","1 cup arugula","For the hot honey:","2 tablespoons honey","½ teaspoon hot sauce (or sub a pinch of cayenne pepper)"],"instructions":["Preheat the oven to 375 degrees F. Line a large baking sheet with parchment paper and place baguette slices on top. If you can’t fit them all, you’ll need to use two baking sheets.","Add slices of brie cheese to each crostini and bake for 7-9 minutes or until the cheese is nice and melted. Top with an apple slice, a piece of prosciutto and a few leaves of arugula.","Make the hot honey: add honey and hot sauce to a small bowl, microwave for 10-15 seconds. Drizzle honey over the crostini. Serve immediately. Makes approximately 20-24 crostini."],"tags":[],"time":{"prep":"25 minutes","cook":"7 minutes","active":"","inactive":"","ready":"","total":"32 minutes"},"servings":"20","image":"https://www.ambitiouskitchen.com/wp-content/uploads/2020/11/Apple-Brie-Crostini-with-Hot-Honey-5.jpg","slug":"13-apple--brie-crostini-with-hot-honey.json","url":"https://www.ambitiouskitchen.com/apple-brie-crostini-with-hot-honey/"},{"name":"Bacon, Butter, Cheese & Garlic","ingredients":["cjralsonJuly 26, 2013 at 10:19 AMI bet this would be FABULOUS with Julio's chips!! Gonna have to have mom send me a care package soon...Texan born and raised, temporarily displaced as a PROUD Coastie wife!ReplyDeleteRepliesBacon, Butter, Cheese & GarlicJuly 31, 2013 at 4:33 PMGreat!  Let me know how it turns out for you!DeleteRepliesReplyUnknownSeptember 13, 2013 at 12:14 PMI tried this last night, and it was wonderful.  I had sauce let over and will keep it in the fridge for chip dip.  Thanks for posting!DeleteRepliesReplyBacon, Butter, Cheese & GarlicSeptember 14, 2013 at 4:33 PMThat's great, Shannon!  That sauce is so good.  I never thought about dipping chips in it!DeleteRepliesReplyAnonymousApril 2, 2014 at 10:15 PMChuy's mexican restaurants here in Texas serve that dip (minus the avocados) for chips, which is so very addictive and super popular...  make extra and have more tortilla chips on hand.. I like On The Boarder Cantina Thins, best with it! .. can't WAIT to try it with this chicken!! I know it's good with steak dipped in it, too ;)DeleteRepliesReplyReply","AnonymousJuly 31, 2013 at 7:52 AMThat looks AH-mazing! What do you serve it with? ReplyDeleteRepliesBacon, Butter, Cheese & GarlicJuly 31, 2013 at 4:34 PMThank you so much!  I served it with rice and pinto beans that I cooked in the crockpot with garlic, onions, and serrano peppers.  DeleteRepliesReplyReply","UnknownAugust 4, 2013 at 10:01 AMI made this for dinner last night and it was fabulous! We had my husband's grandma and grandpa over for dinner and they just loved it. I doubled the recipe and there are no leftovers! Even my 8 year old daughter ate it! Thanks for sharing the recipe!ReplyDeleteRepliesBacon, Butter, Cheese & GarlicAugust 4, 2013 at 10:04 AMThat's great, Kimberly!  I'm so glad it turned out well for you.  Thank you for the compliment and for letting me know how it turned out!DeleteRepliesReplyReply","Roxy C.August 9, 2013 at 1:18 AMThis recipe sounds heavenly! I am definitely adding this to the menu. :) I do have a question though.. I know you stated to use jalapeños out of a jar, but have you tried using fresh ones? I just don't find the jar jalapeños very spicy. I would love to hear your input. Thanks!ReplyDeleteRepliesBacon, Butter, Cheese & GarlicAugust 9, 2013 at 9:36 AMThank you!  I haven't tried fresh jalapeños, but I think you certainly could use them especially since the sauce gets blended.  I just didn't have any fresh on hand that day.  Great question!DeleteRepliesReplyRoxy C.August 9, 2013 at 3:54 PMThank you for repsonding! I think I will attempt to make your recipe with fresh jalapeños. Like you said, it should be fine since everything will be blended. Can't wait! I will let yoi know how it turns out. Thank you for sharing your recipe.. It is fabulous! P.S. Love your blog!DeleteRepliesReplyBacon, Butter, Cheese & GarlicAugust 9, 2013 at 5:33 PMThank you so much for the compliments, Roxy!  Please do let me know how it turns out.DeleteRepliesReplyReply","katieAugust 9, 2013 at 2:15 AMwhat if i dont have a food processor? is there any other way to blend the ingredients than with a food processor??ReplyDeleteRepliesBacon, Butter, Cheese & GarlicAugust 9, 2013 at 9:37 AMThat's a good question, Katie.  You could use a blender or even put the chips in a zipper bag and crush them with a pot or a rolling pin.DeleteRepliesReplyReply","AnonymousAugust 9, 2013 at 11:22 AMGoing to give this a try tonight! My daughter has been diagnosed with a Gluten allergy this would be a wonderful for that!!  ReplyDeleteRepliesBacon, Butter, Cheese & GarlicAugust 9, 2013 at 5:34 PMOh, great!  Please let me know how it turns out for you and your daughter!DeleteRepliesReplyAnonymousAugust 9, 2013 at 7:03 PMTurned out AMAZING!! made it with a Black Bean Salad with Corn, Red Peppers, Avocado & Lime-Cilantro Vinaigrette That I also found on pinterest. Will be one of our new go to meals!!  Thanks!! DeleteRepliesReplyBacon, Butter, Cheese & GarlicAugust 10, 2013 at 4:52 PMI'm so glad you liked it!  Thank you for letting me know!DeleteRepliesReplyUnknownAugust 11, 2013 at 11:03 AMNot only does the chicken sound delicious but so does this black bean salad. What's that recipe?DeleteRepliesReplyBacon, Butter, Cheese & GarlicAugust 11, 2013 at 11:27 AMThank you, Brandi.  I'm sorry to say that the black bean salad isn't my recipe.  However, I do have an Avocado, Black Bean & Corn Salsa recipe under my appetizers tab that sounds very similar.  It has corn, tomatoes, black beans, red onion, serrano peppers, avocados, and cilantro and lime.  Maybe you'll enjoy that one!DeleteRepliesReplyReply","AnonymousAugust 10, 2013 at 8:52 AMOn the menu for this week. Excited to see how it turns out. Gosh, I love the blog-o-sphere for such amazing recipes! ReplyDeleteRepliesBacon, Butter, Cheese & GarlicAugust 10, 2013 at 4:53 PMThat's great!  Let me know how it turns out!DeleteRepliesReplyReply","AnonymousAugust 10, 2013 at 1:08 PMJust to let you know, I didn't even have to look at the recipe - I fell in love with the ingredients and shared it on FB.  Only missing a few items and they are going to be on today's shopping list1ReplyDeleteRepliesBacon, Butter, Cheese & GarlicAugust 10, 2013 at 4:55 PMThank you so much for sharing it!  I look forward to hearing how it turns out for you!DeleteRepliesReplyReply","UnknownAugust 15, 2013 at 2:50 PMDo you have any issues with the juice from the chicken making this soggy I haven't made it yet butI have had that issue before with baked recipes that have a breading on them. Any suggestions?  ReplyDeleteRepliesBacon, Butter, Cheese & GarlicAugust 15, 2013 at 3:32 PMGood question, Annie.  I didn't have that problem when I made this.  The only thing I'm thinking is that the mayo acts as a grease and cooks the chips.  I'm not sure really.  Let me know if it does turn out soggy though.DeleteRepliesReplyAnonymousMarch 26, 2014 at 12:18 PMcook it on a broiler pan so that the \"drippings\" fall down and don't soak up in the crumbs. Just be sure to put a tiny bit of water in the bottom of your broiler pan so it doesn't burn.DeleteRepliesReplyBacon, Butter, Cheese & GarlicMarch 26, 2014 at 4:18 PMGreat idea!  Thank you for sharing!DeleteRepliesReplyHomeward Bound Cat Rescue TXJanuary 6, 2017 at 5:22 PMcook on a rack DeleteRepliesReplyBacon, Butter, Cheese & GarlicJanuary 7, 2017 at 4:51 PMAnother great idea!DeleteRepliesReplyReply","AnonymousAugust 27, 2013 at 8:55 AMI want to try this using light/low-fat sour cream, cheese & mayo....hope it turns out just as well! Sounds delicious!ReplyDeleteRepliesBacon, Butter, Cheese & GarlicAugust 27, 2013 at 4:52 PMThank you!  I'm sure the light/low fat ingredients will work great if that's what you are used to using.  Let me know how it works for you!DeleteRepliesReplyReply","AnonymousAugust 28, 2013 at 2:17 PMI can't wait to try this!  it sounds delicious!  Thanks for the recipe!ReplyDeleteRepliesBacon, Butter, Cheese & GarlicAugust 29, 2013 at 3:58 PMYou're welcome!  Let me know how it turns out.DeleteRepliesReplyReply","AnonymousAugust 29, 2013 at 12:24 PMcould i use this on pork chops? my husband is allergic to chickenReplyDeleteRepliesBacon, Butter, Cheese & GarlicAugust 29, 2013 at 3:58 PMThat's a great question and a great idea!  I think pork chops would work great.  I'd love to hear how it turns out!DeleteRepliesReplyReply","AnonymousSeptember 7, 2013 at 12:48 AMCould greek yogurt be substituted for the mayo? Looks delicious, but I'd like to find a way to make it healthier!ReplyDeleteRepliesBacon, Butter, Cheese & GarlicSeptember 8, 2013 at 9:13 AMI haven't cooked with Greek yogurt a lot, but I think it would work fine if the yogurt is thick enough to make the chips stick to it.  Great question!  Let me know if it works out!DeleteRepliesReplyReply","AnonymousSeptember 7, 2013 at 7:09 PMThis looks absolutely delicious! I can't wait to try it, but I'm worried because my husband doesn't really like spicy food. How is this dish on the spicy scale? ReplyDeleteRepliesBacon, Butter, Cheese & GarlicSeptember 8, 2013 at 9:15 AMThank you!  I really like spicy food, but this wasn't spicy to me.  You can swap the Pepper Jack cheese with Monterrey Jack cheese on the chicken.  For the ranch sauce, you can use very little jalapenos or you can even leave it out.  Let me know how it turns out!DeleteRepliesReplyReply","AnonymousSeptember 7, 2013 at 8:47 PMMade this for dinner tonight and it was AMAZING! Thanks so much for sharing! ReplyDeleteRepliesBacon, Butter, Cheese & GarlicSeptember 8, 2013 at 9:16 AMThat's great!  Thank you for letting me know and thank you for the compliment!DeleteRepliesReplyReply","AnonymousSeptember 13, 2013 at 5:40 PMDoes the \"T\" in your recipe stand for tablespoon or teaspoon?  I usually interpret a capital T as tablespoon but want to be sure as I'm not used to seeing 1/2 tablespoon as a measure.  I'm making this tonight.  Thanks for sharing. --VickieReplyDeleteRepliesBacon, Butter, Cheese & GarlicSeptember 14, 2013 at 4:29 PMHi, Vickie. The T does stand for tablespoon.  I usually spell out teaspoon.  Let me know how it turns out!DeleteRepliesReplyReply","UnknownSeptember 16, 2013 at 8:21 PMWow does this sound delicious and simple! Will definitely be giving it a try soon!ReplyDeleteRepliesBacon, Butter, Cheese & GarlicSeptember 18, 2013 at 4:19 PMThank you, Angela!  Let me know how it turns out!DeleteRepliesReplyReply","AnonymousOctober 6, 2013 at 1:48 PMFound this on Pinterest and I have cooked it many times for my husband and I. WE LOVE IT!!! its on our menu often :) Great recipe!!!ReplyDeleteRepliesBacon, Butter, Cheese & GarlicOctober 6, 2013 at 2:35 PMThank you!  I'm so glad you found it and y'all love it!DeleteRepliesReplyReply","AnonymousOctober 11, 2013 at 9:19 PMI made this for my fiance tonight and he loved it! I used plain greek yogurt instead of mayonnaise and low-fat sour cream because those are our preferences :)We would like to try adding cilantro to the green sauce next time-- I didn't add the jalapenos because I am a sissy when it comes to really spicy things!We also would like to make a version of the sauce without the ranch to eat with sushi when we make that! Thank you for sharing!!ReplyDeleteRepliesBacon, Butter, Cheese & GarlicOctober 12, 2013 at 5:18 PMThat's great!  I'm sure some of the other people who want to make this healthier will be glad to know that.  And the sauce without the Ranch for sushi sounds great!  Let me know if you make it and how it turns out!DeleteRepliesReplyReply","AnonymousOctober 26, 2013 at 12:12 PMwhat would you serve with this dish?ReplyDeleteRepliesBacon, Butter, Cheese & GarlicOctober 26, 2013 at 6:08 PMYou could serve refried beans and rice or salad if you want to go lighter.  You could also serve my Avocado, Black Bean & Corn Salsa.  Really, you could pair your favorite vegetable with it too!DeleteRepliesReplyReply","UnknownJanuary 3, 2014 at 7:08 PMThis chicken was AMAZING OMG!!!! I made it with my mom tonight for dinner and it was delicious! The chicken was nice and moist and the sauce, oh the sauce. Lovely is the word I would use. However I do have a few pointers for future cookers of this amazing chicken.1. If you have thick chicken breasts like I did it was necessary to cook them for 55 minutes.2. USE THE WHOLE BAG OF CHEESE in the chip mixture. I only used half the bag and the chips didn't stick as nicely as they would if you used all the cheese.3. The sauce recipe makes A LOT of sauce so you could cut it in half and still have enough sauce to bathe in.4. The recipe makes 7 large chicken breasts comfortably so if you have small chicken breasts maybe cut the recipe down a bit.Other than that it was the best chicken I've had in a while. Even my mom who hates jalepenos and avocado together LOVED the chicken. Thank you so much:)ReplyDeleteRepliesBacon, Butter, Cheese & GarlicJanuary 4, 2014 at 3:48 PMThank you so much, Alycia!  We really loved this one too.  And you're right about the sauce.  It's something I make often and use with a lot of stuff.  It's really good on Tex-Mex or Southwestern type salads.  Glad you all enjoyed it!DeleteRepliesReplyBFebruary 16, 2014 at 6:02 PMAgreed on your pointers-- I had very thick chicken and think I'd halve and maybe pound them and roll them loosely if I had thick ones.  Definitely use more cheese and could certainly cut the sauce recipe in half.  Good stuff!DeleteRepliesReplyReply","AnonymousJanuary 25, 2014 at 5:41 PMthis is such an amazing recipe. I found it on Pintrest and we made it just to fill one of our weekly dinners. we were pleasantly surprised! we have made it often and tonight is my mom's birthday and since she loves it so much we are making it again!ReplyDeleteRepliesBacon, Butter, Cheese & GarlicFebruary 7, 2014 at 4:41 PMThank you so much!  So glad you liked it!DeleteRepliesReplyReply","AnonymousFebruary 6, 2014 at 6:29 PMMade it tonight for our wedding anniversary.  We both loved it so much that I am making it again soon.  I used multi grain Tostitos n it gave it a nice flavor. Also, I used the thin cut chicken breast because I feel it bskes best.  Thanks for sharing recipe,  its amazingReplyDeleteRepliesBacon, Butter, Cheese & GarlicFebruary 7, 2014 at 4:42 PMThank you so much for the compliment!  I'm so happy you liked it!DeleteRepliesReplyReply","AnonymousFebruary 23, 2014 at 6:01 PMMade this tonight, big hit with the family! Will definitely make again!ReplyDeleteRepliesBacon, Butter, Cheese & GarlicFebruary 25, 2014 at 6:07 PMThat's great!  Thank you for letting me know!DeleteRepliesReplyReply","AnonymousMarch 31, 2014 at 5:40 PMI just made this for dinner. It was amazing!!!!  Will definitely make it again!!!!!ReplyDeleteRepliesBacon, Butter, Cheese & GarlicMarch 31, 2014 at 6:23 PMThat's great!  Thank you for letting me know!DeleteRepliesReplyReply","AnonymousApril 8, 2014 at 3:09 PMSo what pan would be best to cook the chicken in? Do you think a glass one would work, or a cookie sheet?ReplyDeleteRepliesBacon, Butter, Cheese & GarlicApril 8, 2014 at 3:44 PMFor me, I think a cookie sheet works better, but I think a glass pan would work too.DeleteRepliesReplyReply","Carrie SernaApril 11, 2014 at 6:19 PMThis is baking right now...will review tonight! My house smells so good!ReplyDeleteRepliesReply","AnonymousJuly 5, 2014 at 2:44 PMCan't wait to try this! Do you recommend a plain chip or a spicy, flavored chip? ReplyDeleteRepliesBacon, Butter, Cheese & GarlicJuly 5, 2014 at 5:05 PMI used plain tortilla chips, but I think any flavor, spicy or something else, would work great here.  I'd love to know what you try and how it turns out!DeleteRepliesReplyReply","AsmitaJuly 8, 2014 at 12:58 PMThis recipe was amazing! It turned out great and tasted absolutely amazing. The dip lasted a really long time in the fridge, also. Thanks for posting this!ReplyDeleteRepliesReply","ElaineJuly 15, 2014 at 12:13 PMI was a little hesitant to make this since my boyfriend doesn't like dairy products and meat together. However, since I do most of our cooking, I tend to get a little selfish and make what I feel like making. >:DI don't have a food processor so I crushed the chips up between two sheets of parchment paper using a meat tenderizer. Also, I only thawed two chicken breasts, but they were HUGE. I had trouble cooking others from the same package, so this time I cut them into strips and really went all out coating them. Kept 'em in for 25 minutes and I could hardly wait for them to cool. The edges of each strip got so brown (which I love) and they were super crunchy. When I presented them to my boyfriend, he said, \"Ooh cool, schnitzel!\" Sure, bud. If thinking it's schnitzel will get you to eat it, it's schnitzel. He liked it very much, even after I told him about all the dairy inside. As for the sauce, I have a ton left over, which is fine by me. Mine came out a little too ranchy because one of my avocados went bad and I couldn't use it, but I'm still gonna chow down.This is definitely a dish I plan to make regularly! Thanks so much for your brilliance! ReplyDeleteRepliesBacon, Butter, Cheese & GarlicJuly 15, 2014 at 3:34 PMYou're so welcome, Elaine!  I'm so glad the two of you liked it, and I really appreciate the compliments!DeleteRepliesReplyReply","AnonymousJuly 23, 2014 at 3:59 PMI made this for my freezer meal group.  Prepped the raw chicken and froze it (chip-coated) in a disposible tin dish.  I also froze the sauce and it all turned out great!  Thawed it out in the fridge and baked for 35-40 mins.  Perfect!   ReplyDeleteRepliesReply","AnonymousOctober 7, 2014 at 2:42 AMSeriously this was incredible. I'm going to have to go through all your recipes now - I hope they're all equally amazing!!ReplyDeleteRepliesBacon, Butter, Cheese & GarlicOctober 7, 2014 at 3:34 PMThank you so much!  I'm so glad you enjoyed it!DeleteRepliesReplyReply","AnonymousJanuary 6, 2015 at 2:21 PMDo you think this would freeze alright? I freeze a lot of leftovers for my husband to take to work. ReplyDeleteRepliesBacon, Butter, Cheese & GarlicJanuary 6, 2015 at 4:36 PMI'm not sure how the chips would do after being thawed out.  I'm afraid they might get soggy.  If you do try it, please let us know!DeleteRepliesReplyReply","AnonymousApril 25, 2015 at 2:43 AMMade this tonight and it was a big hit even with the fussy kids. I don't use the processed ranch packets so made my own with the recipe from heavenly homemakers blog. I would likely only make a quarter of the sauce next time, there was a lot. I couldn't stop eating the leftover crispy bits from the pan when I was cleaning up. Definitely a keeper thanks!ReplyDeleteRepliesBacon, Butter, Cheese & GarlicApril 25, 2015 at 4:07 PMYou're so welcome!  So glad you liked it!DeleteRepliesReplyReply","AnonymousDecember 11, 2015 at 7:30 PMI read the recipe wrong and thought it said milk so i do not have buttermilk on hand.. what can i used instead ? ReplyDeleteRepliesBacon, Butter, Cheese & GarlicDecember 12, 2015 at 5:16 PMYou could probably use regular milk, but you may need to add a little more mayo to thicken it up.  Enjoy!DeleteRepliesReplyReply","AnonymousAugust 16, 2016 at 7:43 PMI used the lime tortilla chips and it was great. ReplyDeleteRepliesBacon, Butter, Cheese & GarlicAugust 17, 2016 at 4:50 PMSounds fantastic! So glad you enjoyed it!DeleteRepliesReplyReply","Harmony INovember 7, 2016 at 7:26 PMI've made this a few times after seeing this recipe. ALWAYS a hit. Not soggy at all. I bring the chicken to room temperature before dredging them. Incredible taste, delicious sauce. Best chicken I have EVER made and best I have ever HAD.ReplyDeleteRepliesBacon, Butter, Cheese & GarlicNovember 8, 2016 at 4:49 PMThank you so much for the kind words, Harmony!  I'm so happy that you enjoy it!DeleteRepliesReplyReply","AnonymousFebruary 14, 2017 at 3:32 PMAfter I prepared the chicken, I put them on a brioche bun and made into a sandwich. Tasted greatReplyDeleteRepliesBacon, Butter, Cheese & GarlicFebruary 14, 2017 at 4:38 PMSounds great!  So glad you enjoyed it!DeleteRepliesReplyReply"],"instructions":["\nHome\n","\nContact Me\n","\nBloggers\n","Crockpot meals","Football food","Gnocchi from scratch","Homemade Buffalo wing sauce","A Special Meal for my ValentineUPDATE:If you leave a comment on this post, it will get published.However since there are so many comments, for some strange reason,...","Time to ImpressSo I made this baked chicken last night.And I was impressed.It was one of those wow moments you get when something turns out really...","Going CrazyIf you're on Pinterest, I'm sure you've seen a version of Crazy Bread out there.We've tried a few, and this stuff is aw...","The Wow FactorI was looking for a quick and tasty chicken dinner last week, and one thing I saw over and over was a recipe called Chicken Lazone.It...","Happy DanceDo you ever get in the kitchen and create something that makes you do a little happy dance?Even better, has your family ever done a hap...","Restaurant RedoOne of my readers, Debbie, recently emailed me and asked me if I had a recipe for Eat'N Park's Seafood Pasta Bake.I told her I ...","Volcano PotatoesHere is an interesting new way to cook potatoes.These are Volcano Potatoes.I parbaked potatoes, hollowed them out, stuffed them, wrap...","I Love ChipsDrop everything you're doing right now.Seriously.What I'm about to share with you is mind blowing.I made a touchdown in the...","Fire CrackersI'm really really sorry to do this to you.It's really not fair of me to post something so ridiculously addicting.These Fire ...","Corn CasseroleCORN CASSEROLE1/4 stick butter1/4 C flour1 C chicken stock1/2 C milk1/2 C sour cream1 box Jiffy cornbread mix2 eggs1 1/...","There are an average of 8 peas in pea pods.","Facebook videos about animals","Foosball","\"Lost\" the TV show (I know, I'm behind)","Smoked gouda","►2016(71)December(2)November(3)October(7)September(3)August(7)July(6)June(3)May(8)April(6)March(8)February(9)January(9)","December(2)\n","November(3)\n","October(7)\n","September(3)\n","August(7)\n","July(6)\n","June(3)\n","May(8)\n","April(6)\n","March(8)\n","February(9)\n","January(9)\n","►2015(161)December(7)November(5)October(12)September(15)August(11)July(13)June(17)May(11)April(17)March(17)February(18)January(18)","December(7)\n","November(5)\n","October(12)\n","September(15)\n","August(11)\n","July(13)\n","June(17)\n","May(11)\n","April(17)\n","March(17)\n","February(18)\n","January(18)\n","►2014(227)December(22)November(14)October(12)September(13)August(15)July(17)June(21)May(19)April(22)March(27)February(25)January(20)","December(22)\n","November(14)\n","October(12)\n","September(13)\n","August(15)\n","July(17)\n","June(21)\n","May(19)\n","April(22)\n","March(27)\n","February(25)\n","January(20)\n","▼2013(302)December(15)November(17)October(16)September(19)August(19)July(29)June(27)May(25)April(29)March(41)February(33)January(32)","December(15)\n","November(17)\n","October(16)\n","September(19)\n","August(19)\n","July(29)\n","June(27)\n","May(25)\n","April(29)\n","March(41)\n","February(33)\n","January(32)\n","►2012(3)December(3)","December(3)\n","►2011(3)October(1)September(2)","October(1)\n","September(2)\n","►2010(1)July(1)","July(1)\n"],"tags":[],"time":{"prep":"","cook":"","total":""},"servings":null,"image":"","slug":"28-bacon-butter-cheese--garlic.json","url":"https://baconbuttercheesegarlic.blogspot.com/2013/07/i-love-chips.html"},{"name":"Baked Cheesy Zucchini Bites","ingredients":["1 ½ cups  (212 g) packed shredded zucchini (no need to peel zucchini)","1   large egg, lightly beaten","¼ to ½ cup  (28-56 g) shredded sharp cheddar cheese or a blend of cheddar and Monterey jack","¼ cup  (21 g) panko or regular bread crumbs","¼ teaspoon   dried basil, or 1-2 teaspoons fresh","¼ teaspoon   garlic powder","¼ teaspoon   salt","⅛ teaspoon   pepper"],"instructions":["Preheat the oven to 425 degrees F. Line a rimmed baking sheet with parchment paper and lightly coat with cooking spray or lightly grease an unlined baking sheet.","Place the shredded zucchini in a clean kitchen towel and wring out all the excess water over the sink until the zucchini is really dry. You should have a little over 1 cup after squeezing out the water (if you have a scale, you’ll want about 6 ounces of zucchini that’s been squeezed dry).","Place the zucchini and remaining ingredients in a medium bowl and mix until combined.","Drop the mixture by tablespoonfuls on the prepared baking sheet and lightly press the mounds with your hands to flatten slightly.","Bake for 16-20 minutes until the edges are golden."],"tags":[],"time":{"prep":"20","cook":"20","total":"30"},"servings":null,"image":"data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20200%20200'%3E%3C/svg%3E","slug":"40-baked-cheesy-zucchini-bites.json","url":"https://www.melskitchencafe.com/baked-cheesy-zucchini-bites/"},{"name":"Baked Croissant French Toast with Lemon Cream Cheese","ingredients":["\n\t\t\t\t\t\t\t\t\t\t4\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tlarge croissants\n\t\t\t\t\t\t\t\t\t\tif they are a little stale, all the better\n\t\t\t\t\t\t\t\t\t","\n\t\t\t\t\t\t\t\t\t\t4\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\toz\n\t\t\t\t\t\t\t\t\t\tcream cheese\n\t\t\t\t\t\t\t\t\t\tsoftened\n\t\t\t\t\t\t\t\t\t","\n\t\t\t\t\t\t\t\t\t\t1\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tcup\n\t\t\t\t\t\t\t\t\t\tpowdered sugar\n\t\t\t\t\t\t\t\t\t\tdivided\n\t\t\t\t\t\t\t\t\t","\n\t\t\t\t\t\t\t\t\t\t2\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tlemons\n\t\t\t\t\t\t\t\t\t","\n\t\t\t\t\t\t\t\t\t\t2\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\teggs\n\t\t\t\t\t\t\t\t\t","\n\t\t\t\t\t\t\t\t\t\t1\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tcup\n\t\t\t\t\t\t\t\t\t\tmilk\n\t\t\t\t\t\t\t\t\t","\n\t\t\t\t\t\t\t\t\t\t1 1/2\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tcup\n\t\t\t\t\t\t\t\t\t\tstrawberries\n\t\t\t\t\t\t\t\t\t\troughly chopped\n\t\t\t\t\t\t\t\t\t","\n\t\t\t\t\t\t\t\t\t\t1 1/2\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tcup\n\t\t\t\t\t\t\t\t\t\twater\n\t\t\t\t\t\t\t\t\t","\n\t\t\t\t\t\t\t\t\t\t1/4\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tcup\n\t\t\t\t\t\t\t\t\t\tsugar\n\t\t\t\t\t\t\t\t\t\tor more to taste\n\t\t\t\t\t\t\t\t\t"],"instructions":["Cut the croissants in half and then split open (like you're making a sandwich). Set aside.","In the bowl of stand mixer, beat together the cream cheese, zest of one lemon, strained juice of one lemon, and 1/2 cup powdered sugar.","Spread the cream cheese mixture over each half of the croissants and then put the tops and bottoms back together. Arrange the pieces evenly in a baking dish (mine is about a 5x9).","In the same bowl that had the cream cheese mixture (no need to wash it out first), whisk together the eggs, milk, juice and zest from the second lemon, and remaining 1/2 cup of powdered sugar. Pour over the croissants and cover with foil.","Refrigerate overnight. In the morning, preheat the oven to 350. Bake covered for 30 minutes, then remove the foil and bake for another 20 minutes or until the croissants are golden brown.","Let stand for 5-10 minutes before serving, and top with strawberry sauce.","To make strawberry sauce, combine the strawberries, water, and sugar in saucepan and bring to a boil. Reduce the heat to medium low and let cook 10-15 minutes until the strawberries are falling apart and the liquid is thickening. Add more sugar to taste if desired."],"tags":[],"time":{"prep":"20","cook":"50","total":"10"},"servings":null,"image":"data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20150%20150'%3E%3C/svg%3E","slug":"46-baked-croissant-french-toast-with-lemon-cream-cheese.json","url":"https://everyday-reading.com/croissant-french-toast/"},{"name":"Baked Potato Soup I","ingredients":["12 slices bacon","⅔ cup margarine","⅔ cup all-purpose flour","7 cups milk","4 large baked potatoes, peeled and cubed","4 green onions, chopped","1 ¼ cups shredded Cheddar cheese","1 cup sour cream","1 teaspoon salt","1 teaspoon ground black pepper"],"instructions":["Place bacon in a large, deep skillet. Cook over medium heat until browned. Drain, crumble, and set aside.","In a stock pot or Dutch oven, melt the margarine over medium heat. Whisk in flour until smooth. Gradually stir in milk, whisking constantly until thickened. Stir in potatoes and onions. Bring to a boil, stirring frequently.","Reduce heat, and simmer 10 minutes. Mix in bacon, cheese, sour cream, salt, and pepper. Continue cooking, stirring frequently, until cheese is melted."],"tags":[],"time":{"prep":"15 mins ","cook":"25 mins ","active":"","inactive":"","ready":"","total":"40 mins "},"servings":"6 ","image":"https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1833&h=917&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2020%2F02%2F5867379.jpg","slug":"54-baked-potato-soup-i.json","url":"https://www.allrecipes.com/recipe/12997/baked-potato-soup-i/"},{"name":"Baked Pumpkin Oatmeal","ingredients":["1 can (15 Oz. Size) Pumpkin Puree","3 c. Old Fashioned Oats","3/4 c. Packed Light Brown Sugar","1 tsp. Baking Powder","3/4 tsp. Fine Sea Salt","1 1/2 tsp. Cinnamon","3/4 tsp. Ginger","1/4 tsp. Cloves","1/4 tsp. Allspice","1 1/4 c. Milk","2 Eggs","4 tbsp. Unsalted Butter, Melted And Cooled","1 tsp. Vanilla","Greek Yogurt And Cinnamon Sugar, To Serve"],"instructions":["At least 30 minutes before making the oatmeal (and up to the day before), line a mesh sieve with cheesecloth. Place pumpkin puree inside and let drain. Press the pumpkin occasionally with a spoon as it drains.","Grease an 11x7-inch pan. Preheat oven to 350ºF.","Stir oats, sugar, baking powder, salt, and spices. Squeeze cheesecloth to remove excess pumpkin water and place 3/4 cup strained pumpkin in another bowl. Add milk, eggs, butter, and vanilla to the pumpkin and whisk until smooth.","Stir both mixtures together until combined. Pour into prepared pan. Bake for 35 minutes or until oatmeal is firm and resembles a snack cake.","Cut into pieces and serve warm with a dollop of Greek yogurt and sprinkle of cinnamon-sugar.","Leftovers may be covered and rewarmed in the microwave. For one piece, 40 seconds at 80% power is sufficient. Try it cold or room temperature on day two as well!"],"tags":[],"time":{"prep":"0 hours 15 mins","cook":"0 hours 35 mins","active":"","inactive":"","ready":"","total":"0 hours 50 mins"},"servings":"8 servings","image":"https://hips.hearstapps.com/amv-prod-tpw.s3.amazonaws.com/wp-content/uploads/2018/10/baked-pumpkin-oatmeal-horz-close.jpg?crop=1xw:0.7507507507507507xh;center,top&resize=1200:*","slug":"43-baked-pumpkin-oatmeal.json","url":"https://www.thepioneerwoman.com/food-cooking/recipes/a99403/baked-pumpkin-oatmeal/"},{"name":"Banana Bread (From Kristi)","ingredients":["1/2 cup shortening","1 cup sugar","3 eggs","1 1/2 cup mashed ripe banana","1 1/4 cup flour","3/4 tsp soda","1/2 tsp salt"],"instructions":["Preheat oven to 350","Cream shortening and sugar until light. ","Add eggs and mix well.","Stir in bananas and sift in dry ingredients","Mix well","If making in a pan, pour into greased 9x13 glass pan and bake for 30 minutes","Alternatively, pour into muffin tins and bake for about 18 minutes or until golden brown"],"tags":["muffins","dessert"],"servings":"9x13 pan","image":"","time":{"prep":"10 min","cook":"30 min","active":"","inactive":"","ready":"","total":"45 min"},"url":""},{"name":"Best Ever Homemade Flour Tortillas","ingredients":["\n3\ncups\nall-purpose flour\n","\n1\nteaspoon\nsalt\n","\n1\nteaspoon\nbaking powder\n","\n⅓\ncup\nextra virgin olive oil, vegetable oil or other fairly neutral flavored oil\n","\n1\ncup\nwarm water\n"],"instructions":["Combine flour, salt and baking powder in a medium-size bowl. Using a sturdy silicone spatuala or a sturdy wooden spoon, mix dry ingredients until well combined.","Make a well in the center of the dry ingredients and add the oil and water. Stir well from the bottom up, until all dry ingredients are incorporated and the dough begins to come together and form a shaggy ball.","Turn dough out onto a lightly floured work surface and knead for 1-2 minutes until the dough is nice and smooth. Proceed with step number 3 below for the remainder of the recipe.","Combine flour, salt and baking powder in the bowl of a stand mixer. Using the dough hook, mix dry ingredients until well combined.","Add oil and water with mixer running at a medium speed. After about 1 minute, or when mixture comes together and begins to form a ball, decrease mixing speed to low. Continue to mix for 1 minute or until dough is smooth.","Transfer dough to a lightly floured work surface. Divide into 16 equal portions. Turn each piece to coat with flour. Form each piece into a ball and flatten with the palm of your hand. Cover flattened balls of dough with a clean kitchen towel and allow to rest for at least 15 minutes (or as much as 2 hours) before proceeding.","After the rest period, heat a large pan over medium heat. Roll each dough piece into a rough circle, about 6-7 inches in diameter, keep work surface and rolling pin lightly floured. Don’t stack uncooked tortillas on top of each other or they will stick together. (I like to separate my tortillas with parchement paper.)","When the pan is hot, place one dough circle into the pan and allow to cook 45 seconds to 1 minute or until the bottom surface has a few pale brown spots and the uncooked surface is bubbly. If browning too fast, reduce the heat a bit. If it’s taking longer than a minute to see a few pale golden brown spots on the underside of tortillas, increase the heat a bit. Flip to other side and cook for 15-20 seconds. The tortillas should be nice and soft but have a few small brown spots on the surface. ","Remove from pan with tongs and stack in a covered container or zippered bag to keep the tortillas soft. ","Serve warm or allow to cool for later use. When ready to use, place a slightly damp paper towel in the bottom of a microwave-safe container (with a cover) that will hold the stacked tortillas. Microwave uncovered for 15-30 seconds (start with 15) or until warm, then keep covered to hold heat while serving.","Store in an airtight container or zippered bag at room temperature for 24 hours or refrigerate for up to 1 week. To freeze, separate tortillas with parchment paper or waxed paper and place in a zippered bag before placing in the freezer."],"tags":[],"time":{"prep":"20","cook":"40","total":""},"servings":null,"image":"data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20150%20150'%3E%3C/svg%3E","slug":"14-best-ever-homemade-flour-tortillas.json","url":"https://thecafesucrefarine.com/best-ever-homemade-flour-tortillas/?epik=dj0yJnU9RGVnaW9kYkdoSVpPTUxBOHdsYUpZazlSQ09SeFV3a3ImcD0wJm49YlVucVV4TkVTcE11ZjFzTGtUMDJNZyZ0PUFBQUFBR0FYVVJj"},{"name":"Black Bean and Sweet Potato Burritos","ingredients":["\n\t\t\t\t\t\t2 sweet potatoes, peeled and cubed small (about 3-4 cups)\t\t\t\t\t","\n\t\t\t\t\t\t1 jalapeno, seeded and finely diced\t\t\t\t\t","\n\t\t\t\t\t\t1 red pepper, diced small\t\t\t\t\t","\n\t\t\t\t\t\t1 small red onion, diced small (about 1/2 cup)\t\t\t\t\t","\n\t\t\t\t\t\t2 teaspoons olive oil\t\t\t\t\t","\n\t\t\t\t\t\t1 teaspoon cumin\t\t\t\t\t","\n\t\t\t\t\t\t1 teaspoon chili powder\t\t\t\t\t","\n\t\t\t\t\t\t1/2 teaspoon salt\t\t\t\t\t","\n\t\t\t\t\t\t1/4 teaspoon black pepper\t\t\t\t\t","\n\t\t\t\t\t\t1 (15 ounce) can black beans, rinsed and drain\t\t\t\t\t","\n\t\t\t\t\t\t1/4 - 1/2 cup chopped cilantro (depending on your taste)\t\t\t\t\t","\n\t\t\t\t\t\t2 teaspoons fresh lime juice (from about 1 lime)\t\t\t\t\t","\n\t\t\t\t\t\t1 cup shredded cheddar cheese\t\t\t\t\t","\n\t\t\t\t\t\t1 cup shredded Monterey Jack cheese\t\t\t\t\t","\n\t\t\t\t\t\t6-8 burrito-size tortillas (whole wheat, white or other favorite variety)\t\t\t\t\t"],"instructions":["AboutAboutContactFAQFavorite ThingsFriday ThoughtsGift Guides","About","Contact","FAQ","Favorite Things","Friday Thoughts","Gift Guides","RecipesRecipe IndexMain DishesDessertsHealthy Recipes30-Minute MealsBreakfastMake-Ahead Meals","Recipe Index","Main Dishes","Desserts","Healthy Recipes","30-Minute Meals","Breakfast","Make-Ahead Meals","The Best Recipes","Menu Plans","AboutAboutContactFAQFavorite ThingsFriday ThoughtsGift Guides","About","Contact","FAQ","Favorite Things","Friday Thoughts","Gift Guides","RecipesRecipe IndexMain DishesDessertsHealthy Recipes30-Minute MealsBreakfastMake-Ahead Meals","Recipe Index","Main Dishes","Desserts","Healthy Recipes","30-Minute Meals","Breakfast","Make-Ahead Meals","The Best Recipes","Menu Plans","2 sweet potatoes, peeled and cubed small (about 3-4 cups)","1 jalapeno, seeded and finely diced","1 red pepper, diced small","1 small red onion, diced small (about 1/2 cup)","2 teaspoons olive oil","1 teaspoon cumin","1 teaspoon chili powder","1/2 teaspoon salt","1/4 teaspoon black pepper","1 (15 ounce) can black beans, rinsed and drain","1/4 - 1/2 cup chopped cilantro (depending on your taste)","2 teaspoons fresh lime juice (from about 1 lime)","1 cup shredded cheddar cheese","1 cup shredded Monterey Jack cheese","6-8 burrito-size tortillas (whole wheat, white or other favorite variety)","<img width=\"200\" height=\"200\" class=\"mv-create-products-img obj-fit no_pin ggnoads\" src=\"https://www.melskitchencafe.com/wp-content/uploads/31kidAIwD5L._SX355_-200x200.jpg\" alt=\"Mixing Bowl\" nopin=\"nopin\" />Mixing Bowl","<img width=\"200\" height=\"200\" class=\"mv-create-products-img obj-fit no_pin ggnoads\" src=\"https://www.melskitchencafe.com/wp-content/uploads/71QAq1IO0IL._SX466_-200x200.jpg\" alt=\"Cookie Sheet {Half Sheet Pans}\" nopin=\"nopin\" />Cookie Sheet {Half Sheet Pans}","<img width=\"200\" height=\"200\" class=\"mv-create-products-img obj-fit no_pin ggnoads\" src=\"https://www.melskitchencafe.com/wp-content/uploads/71fxhkKqp-L._SY450_-200x200.jpg\" alt=\"Wooden Spoon\" nopin=\"nopin\" />Wooden Spoon","Mel—September 15, 2021 @ 10:49 pmReplyHey Ellie! So fun seeing your comment pop up. And WAY TO GO making such an amazing, healthy meal at college!","Mel—October 27, 2018 @ 9:24 pmReply“chorus of angels in my mouth” hahahahaha. Funny girl. Glad you love these!","Mel—May 23, 2018 @ 9:50 pmReplyI think it should be fine to use the same amount.","Mel—April 25, 2018 @ 10:44 amReplyThanks, Charlee! I hope your husband surprises you by loving these. 🙂 They are seriously a favorite of ours even after all these years.","Mel—June 9, 2017 @ 8:11 pmReplyThank you!","Mel—April 5, 2017 @ 10:12 pmReplyHi Pat, I think adding a red or green salsa would work pretty well!","Mel—January 7, 2017 @ 10:46 pmReplyMade my day. Thank you, Karen!","Mel—February 4, 2014 @ 9:44 pmReplyLinda – I don’t provide nutritional info for my recipes, but there are a number of websites that breakdown all of the nutritional information for recipes.Good luck!","Mel—November 4, 2013 @ 1:25 pmReplyKaren – yes, these freeze really well.","Rebecca—July 13, 2015 @ 3:23 pmReplyJust wanted to suggest possibly using Amchoor Powder instead of Lime?I make Channa Masala all the time, and the recipe lists Amchoor powder OR lime juice.You’d have to figure out where to get it in your area… probably an indian foods store!","^ Back to Top","Home","Recipes","About","Contact","FAQ","Privacy Policy"],"tags":[],"time":{"prep":"20 minutes","cook":"35 minutes","total":"55 minutes"},"servings":null,"image":"","slug":"31-black-bean-and-sweet-potato-burritos.json","url":"https://www.melskitchencafe.com/black-bean-and-sweet-potato-burritos/"},{"name":"Brown Gravy Recipe","ingredients":[" 1 cup chicken broth"," 1 cup beef broth"," 1 cube beef bouillon, or 1 tsp better than bouillon"," 1 teaspoon onion powder"," ½ teaspoon garlic powder"," 1 ½ teaspoons Worcestershire sauce"," 2-3 drops Kitchen Bouquet browning and seasoning sauce, optional"," 1/4 cup cold water + 3 tablespoons corn starch"," 1 Tablespoon cold unsalted butter"],"instructions":["Add the chicken broth, beef broth, beef bouillon, onion and garlic powder, and Worcestershire sauce to a medium saucepan. Stir to combine.","If a darker color is desired, add 2-3 drops of Kitchen Bouquet browning and seasoning sauce.","Combine the cold water and corn starch in a small Tupperware with a lid. Shake to combine.","Bring gravy to a boil. Whisk in cornstarch mixture. Decrease to medium low. Continue to whisk to ensure that it blends in smoothly.","Let it gently simmer until its of desired thickness. The longer it simmers, the more concentrated the flavor will become.","Remove from heat. Swirl in one tablespoon COLD butter just before serving. This adds a silky, velvety finish."],"tags":[],"time":{"prep":"5","cook":"10","total":"15"},"servings":null,"image":"data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20200%20200'%3E%3C/svg%3E","slug":"60-brown-gravy-recipe.json","url":"https://thecozycook.com/brown-gravy-recipe/"},{"name":"Brownie Pudding","ingredients":["2 C flour","1 tsp salt","2 tbps cocao","2 tsp vanilla","2 tsp baking powder","1 1⁄2 c sugar","1 c milk","4 tbps oil (1/4 cup)","1⁄2 cup of nuts (optional)","2 C brown sugar","1/2 C cocoa","3 1/2 C hot water"],"instructions":["Mix the flour, salt, cocoa, vanilla, baking powder, sugar, milk, oil, and nuts in a large mixing bowl. ","Pour into either two bread pans or a 13x9 pan.","For the sauce, mix the brown sugar, cocoa, and hot water.","Pour on top of the existing batter in the pan. DO NOT MIX.","Bake for 45 minutes at 350 deg. It may need to go longer. It should bubble around the edge of the brownie once it's done. "],"tags":["dessert","brownie"],"servings":"8","image":"","time":{"prep":"10 min","cook":"45 min","active":"10 min","inactive":"45 min","ready":"","total":"55 min"},"url":""},{"name":"Candied Carrots Recipe - brown sugar and honey glaze","ingredients":["3 cups baby carrots","1/4 cup butter","1/4 cup honey","1/4 cup brown sugar","1 tsp cinnamon","1 tsp salt","1/4 tsp cayenne powder"],"instructions":["Boil the baby carrots until tender. Drain.","In a skillet, melt butter on medium heat. Stir in the honey, brown sugar, cinnamon, salt and cayenne pepper.","Bring the glaze to a boil and continue to cook, stirring constantly for a few minutes. The glaze should reduce and thicken a little bit.","Dump in the cooked carrots and stir so they are all well coated in the glaze. ","Reduce heat to a simmer and continue to cook for another 5 minutes, stirring often. ","Serve."],"tags":[],"time":{"prep":"5 minutes","cook":"30 minutes","active":"","inactive":"","ready":"","total":"35 minutes"},"servings":"4","slug":"52-candied-carrots-recipe---brown-sugar-and-honey-glaze.json","url":"https://www.theblackpeppercorn.com/candied-carrots/"},{"name":"Chicken Bacon Garlic Alfredo Roll Ups","ingredients":["▢ 8 Lasagne noodles","▢ 2 cups chicken cooked and shredded, I used rotisserie","▢ 1 pound bacon cooked and crumbled","▢ 2 cups mozzarella cheese shredded","▢ 1/2 cup butter","▢ 1 pint heavy whipping cream 2 cups","▢ 4 ounces cream cheese","▢ 1/2 teaspoon garlic minced","▢ 1 teaspoon garlic powder","▢ 1 teaspoon italian seasoning","▢ 1/4 teaspoon salt","▢ 1/4 teaspoon pepper","▢ 1 cup parmesan cheese grated"],"instructions":["Preheat oven to 350 degrees. Spray an 9x13 inch pan with cooking spray and set aside.","Cook the lasagna noodles according to package directions until al dente. Drain and rinse the noodles with cold water and lay them on a paper towel to remove excess water.","In a medium saucepan add butter, heavy whipping cream, and cream cheese. Cook over medium heat and whisk until melted. Add the minced garlic, garlic powder, italian seasoning, salt and pepper. Continue to whisk until smooth. Add the grated parmesan cheese. Bring to a simmer and continue to cook for about 3-5 minutes or until it starts to thicken. ","Line the bottom of the 9x13 inch pan with 1 cup of the alfredo sauce.","Spread 2 Tbs of the alfredo sauce over each noodle. Take 1/8th of the shredded chicken and bacon and spread evenly over each noodle and top with about 3 Tbs shredded cheese. ","Carefully roll up each lasagna noodle and place seam side down in your 9×13 prepared pan. Repeat.","Once they are all in the pan, pour the remaining alfredo sauce over the top and top with remaining cheese. Bake at 350 for about 30 minutes until heated through and cheese is bubbly."],"tags":[],"time":{"prep":"20 minutes","cook":"","active":"","inactive":"","ready":"","total":"50 minutes"},"servings":"88","image":"data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20300%20300'%3E%3C/svg%3E","slug":"34-chicken-bacon-garlic-alfredo-roll-ups.json","url":"https://therecipecritic.com/chicken-bacon-garlic-alfredo-roll-ups/"},{"name":"Chicken Bacon Ranch Casserole","ingredients":["4 slices bacon, diced","2 boneless, skinless chicken thighs*, cut into 1-inch chunks","1 tablespoon olive oil","1 tablespoon Ranch Seasoning and Salad Dressing Mix, or more, to taste","8 ounces rotini","1 cup shredded mozzarella cheese","1/2 cup shredded cheddar cheese","2 tablespoons chopped fresh parsley leaves","2 tablespoons unsalted butter","3 cloves garlic, minced","1 cup heavy cream, or more, to taste","1/4 cup freshly grated Parmesan","Kosher salt and freshly ground black pepper, to taste"],"instructions":["Preheat oven to 375 degrees F. Lightly oil a 9×9 baking dish or coat with nonstick spray.","To make the alfredo sauce, melt butter in a saucepan over medium heat. Add garlic, and cook, stirring frequently, until fragrant, about 1-2 minutes. Gradually whisk in heavy cream. Cook, whisking constantly, until incorporated, about 1-2 minutes. Stir in Parmesan until slightly thickened, about 1-2 minutes. If the mixture is too thick, add more heavy cream as needed; season with salt and pepper, to taste. Set aside.","Heat a large skillet over medium high heat. Add bacon and cook until brown and crispy, about 6-8 minutes. Drain excess fat; reserving 1 tablespoon in the skillet. Transfer bacon to a paper towel-lined plate.","In a gallon size Ziploc bag, add chicken, 1 tablespoon olive oil and Ranch Seasoning, shaking to coat thoroughly. Add chicken to the skillet and cook, flipping once, until cooked through, about 2-3 minutes on each side; set aside.","In a large pot of boiling salted water, cook pasta according to package instructions; drain well.","Add pasta to the prepared baking dish and layer with chicken and alfredo sauce; sprinkle with cheeses and bacon. Place into oven and bake until bubbly and heated through, about 15-20 minutes.","Serve immediately, garnished with parsley, if desired."],"tags":[],"time":{"prep":"15 minutes","cook":"30 minutes","active":"","inactive":"","ready":"","total":"45 minutes"},"servings":"4 servings","image":"https://s23209.pcdn.co/wp-content/uploads/2016/01/IMG_0791edit.jpg","slug":"33-chicken-bacon-ranch-casserole.json","url":"https://damndelicious.net/2016/01/03/chicken-bacon-ranch-casserole/"},{"name":"Chicken Divan","ingredients":["2 (10 oz) packages chopped frozen broccoli ","6 cups cooked and shredded chicken ","2 (10 3/4 oz) cans condensed cream of mushroom soup ","1 cup mayonnaise ","1 cup sour cream ","1 cup grated sharp cheddar cheese ","1 tablespoon fresh lemon juice ","1 teaspoon curry powder ","1/2 cup dry white wine ","1/2 cup freshly grated Parmesan cheese ","1/2 cup soft breadcrumbs ","2 tablespoons melted butter ","to taste salt and freshly ground black pepper "],"instructions":["Preheat oven to 350 °F.","Remove the outer wrappers from the boxes of broccoli. Open one end of each box. Microwave on full power for 2 minutes, until thawed. Drain the broccoli and put into a 11X7 casserole dish that has been prepared with a non stick cooking spray. Top with shredded chicken.","In a medium bowl, combine the soup, mayonnaise, sour cream, cheddar cheese, lemon juice, curry powder, salt and pepper to taste, and wine. Whisk together to make a sauce. Pour the sauce over the broccoli and chicken. Mix well with a spatula.","Pat down evenly and smooth with a spatula. In a small mixing bowl, stir together the Parmesan cheese, bread crumbs and butter and sprinkle over the top.","Bake for about 30-45 minutes.","Cook’s Note: Try topping with cheddar or gruyere cheese.",""],"tags":[],"time":{"prep":"","cook":"","total":""},"servings":null,"image":"","slug":"26-chicken-divan.json","url":"https://www.pauladeen.com/recipe/chicken-divan/"},{"name":"Chicken Pillows with Creamy Parmesan Sauce","ingredients":["\n\t\t\t\t\t\t4 large boneless, skinless chicken breasts (about 2 1/2 – 3 pounds)\t\t\t\t\t","\n\t\t\t\t\t\t2 packages (8 ounces each) cream cheese, light or regular, softened to room temperature\t\t\t\t\t","\n\t\t\t\t\t\t1 teaspoon garlic powder\t\t\t\t\t","\n\t\t\t\t\t\t1 teaspoon salt\t\t\t\t\t","\n\t\t\t\t\t\t1 batch buttery crescent rolls\t\t\t\t\t","\n\t\t\t\t\t\t1/2 cup (1 stick) butter, melted\t\t\t\t\t","\n\t\t\t\t\t\t2 cups panko bread crumbs\t\t\t\t\t","\n\t\t\t\t\t\t1/2 cup freshly grated Parmesan cheese\t\t\t\t\t","\n\t\t\t\t\t\t3 tablespoons butter\t\t\t\t\t","\n\t\t\t\t\t\t3 tablespoons flour\t\t\t\t\t","\n\t\t\t\t\t\t1 chicken bouillon cube or 1 teaspoon chicken bouillon granules\t\t\t\t\t","\n\t\t\t\t\t\t1/2 teaspoon salt\t\t\t\t\t","\n\t\t\t\t\t\t1/4 teaspoon black pepper\t\t\t\t\t","\n\t\t\t\t\t\t1 1/2 cups milk\t\t\t\t\t","\n\t\t\t\t\t\t3/4 cup freshly grated Parmesan cheese\t\t\t\t\t","\n\t\t\t\t\t\t1 cup sour cream, light or regular\t\t\t\t\t"],"instructions":["AboutAboutContactFAQFavorite ThingsFriday ThoughtsGift Guides","About","Contact","FAQ","Favorite Things","Friday Thoughts","Gift Guides","RecipesRecipe IndexMain DishesDessertsHealthy Recipes30-Minute MealsBreakfastMake-Ahead Meals","Recipe Index","Main Dishes","Desserts","Healthy Recipes","30-Minute Meals","Breakfast","Make-Ahead Meals","The Best Recipes","Menu Plans","AboutAboutContactFAQFavorite ThingsFriday ThoughtsGift Guides","About","Contact","FAQ","Favorite Things","Friday Thoughts","Gift Guides","RecipesRecipe IndexMain DishesDessertsHealthy Recipes30-Minute MealsBreakfastMake-Ahead Meals","Recipe Index","Main Dishes","Desserts","Healthy Recipes","30-Minute Meals","Breakfast","Make-Ahead Meals","The Best Recipes","Menu Plans","4 large boneless, skinless chicken breasts (about 2 1/2 – 3 pounds)","2 packages (8 ounces each) cream cheese, light or regular, softened to room temperature","1 teaspoon garlic powder","1 teaspoon salt","1 batch buttery crescent rolls","1/2 cup (1 stick) butter, melted","2 cups panko bread crumbs","1/2 cup freshly grated Parmesan cheese","3 tablespoons butter","3 tablespoons flour","1 chicken bouillon cube or 1 teaspoon chicken bouillon granules","1/2 teaspoon salt","1/4 teaspoon black pepper","1 1/2 cups milk","3/4 cup freshly grated Parmesan cheese","1 cup sour cream, light or regular","<img width=\"200\" height=\"200\" class=\"mv-create-products-img obj-fit no_pin ggnoads\" src=\"https://www.melskitchencafe.com/wp-content/uploads/31kidAIwD5L._SX355_-200x200.jpg\" alt=\"Mixing Bowl\" nopin=\"nopin\" />Mixing Bowl","<img width=\"200\" height=\"200\" class=\"mv-create-products-img obj-fit no_pin ggnoads\" src=\"https://www.melskitchencafe.com/wp-content/uploads/71UnyJTIP1L._SX569_-200x200.jpg\" alt=\"Pizza Cutter\" nopin=\"nopin\" />Pizza Cutter","<img width=\"600\" height=\"600\" class=\"mv-create-products-img obj-fit no_pin ggnoads\" src=\"https://www.melskitchencafe.com/wp-content/uploads/sheet-pan-1.jpg\" alt=\"Cookie Sheet {Half Sheet Pan}\" nopin=\"nopin\" />Cookie Sheet {Half Sheet Pan}","Mel—June 22, 2020 @ 11:38 pmReplyTry baking them with one rack in the top third of the oven and the other rack in the bottom third and rotate halfway through. If they are unbaked, you can bake from frozen (reduce the oven temp by 25 degrees and add time as needed until they are cooked through OR thaw in the fridge overnight and bake as directed in the recipe).","Mel—January 14, 2019 @ 7:26 amReplyYes, I bake them once the filling is wrapped inside the dough. You can let them rest for 15-20 minutes before baking if you want a puffier outside crust, but I usually don’t.","Mel—October 30, 2018 @ 8:34 pmReplyDid you freeze them unbaked or already baked?","Mel—February 20, 2018 @ 9:31 pmReplyProbably a month or two.","Mel—September 7, 2017 @ 3:42 pmReplyIt’s such a thin layer of dough around the filling that it doesn’t need to rise like if you were making rolls. As they rest (while the oven preheats), they’ll puff a little and that’s perfect.","Mel—April 18, 2017 @ 11:05 pmReplyI usually pop them in the oven and reheat that way (from frozen, I cover with foil so they don’t get too browned and then uncover for the last few minutes of baking).Chantelle Ivie—April 5, 2018 @ 6:18 pmReplyHow long do you reheat them in the oven?Mel—April 9, 2018 @ 10:34 amReply15 minutes or so on 250 degrees.","Chantelle Ivie—April 5, 2018 @ 6:18 pmReplyHow long do you reheat them in the oven?Mel—April 9, 2018 @ 10:34 amReply15 minutes or so on 250 degrees.","Mel—April 9, 2018 @ 10:34 amReply15 minutes or so on 250 degrees.","Mel—April 11, 2016 @ 2:25 pmReplyI’ve done both, Shelby. It’s a little faster (when you want to eat them) to bake them and then freeze because then you only have to thaw and reheat instead of thawing, letting them rest and rise a bit and then bake.","Mel—March 9, 2016 @ 1:42 pmReplyHi Andrea – basically, you just want rectangles or squares of dough probably 1/4-inch thick and about 2X3-inches or 3X3-inches or thereabouts. It’s not an exact science, I just try not to get the dough too thick. I’ll try to remember to take pictures next time I make them (sometimes it’s a little crazy around here during dinner time!)","Mel—January 23, 2015 @ 8:41 pmReplyThese freeze great, Kelly! After I’ve dipped them in the butter/crumbs, I freeze them on a baking tray and after frozen, I pop them into a freezer ziploc bag. I’ve frozen the sauce a time or two – it works pretty well but it is slightly grainy after thawing and heating so usually I just make the sauce the day of. Hope that helps!","Mel—August 4, 2014 @ 9:03 pmReplyJen – Each piece of dough should be about 6 1/2-inches long and 1 1/2 or slightly more inches wide…then press them flat a little to make them even a bit wider. If you find another way works to cut the dough, that’s great, too, since it doesn’t have to be exact. I press the dough into a rectangle with the long sides parallel to the counter and cut it in half like a hot dog bun and then cut the strips from there.","Mel—April 14, 2014 @ 2:51 pmReplyLeslie – Yes, it can be frozen.","Mel—January 24, 2014 @ 1:44 pmReplyMarci – I always put the panko crust on them while I’m making them. It makes them maybe slightly less crunchy but I like to get all the mess of preparation out of the way at once. You certainly could wait, though, and bread them before baking. If you refrigerate them for the day, I’d let them sit out of the refrigerator for a half hour or so before baking. And yes, you could make the dough the night before and refrigerate it. Make sure you take it out of the refrigerator an hour or so before using in the recipe – cold dough is a beast to work with!","Mel—May 14, 2013 @ 1:53 pmReplySusie – you could definitely try it although my experience has been that creamy sauces like this turn a little grainy and sometimes separate after being frozen and reheated.","Mel—April 12, 2013 @ 3:02 pmReplyHi Trish – I haven’t tried that. I think it would make the consistency of the filling a bit too runny. The thick cream cheese helps give it some stability.","Mel—November 18, 2011 @ 10:25 pmReplyHi Kris – I’ve frozen these a time or two and I bake them from frozen (because usually I’m not on top of things to remember to thaw them first). I bake them at the same temperature but add on an additional 15-20 minutes for baking. You’ll want to check them often and potentially decrease or increase that time based on your oven since all ovens vary a bit. Good luck!","Mel—July 7, 2011 @ 1:25 pmReplyAmy – I like Melissa’s idea, too. I think the filling would work great in a braid because it is very hearty and probably wouldn’t melt out of the braid. The only disadvantage to a braid, in my opinion, is less buttery bread around the filling, but overall, I think the idea is great.","Mel—July 7, 2011 @ 1:26 pmReplyAmy – good question, for this full batch, I would say I probably used maybe 3-4 cups.","Mel—July 7, 2011 @ 1:26 pmReplyClaire – I throw it in frozen since that’s usually what I have on hand (and haven’t taken the time to thaw it).","Mel—July 7, 2011 @ 1:29 pmReplyJody – I agree with Kim who chimed in on this issue…yes, I definitely think you can freeze these, but if it were me, I’d fill the rolls, coat them in crumbs and freeze them. You could probably even pop them right out of the freezer and into the oven and add maybe 5-7 minutes (just a guess) onto the baking time.","^ Back to Top","Home","Recipes","About","Contact","FAQ","Privacy Policy"],"tags":[],"time":{"prep":"30 minutes","cook":"45 minutes","total":"15 minutes"},"servings":null,"image":"","slug":"30-chicken-pillows-with-creamy-parmesan-sauce.json","url":"https://www.melskitchencafe.com/chicken-pillows-with-creamy-parmesan-sauce/"},{"name":"Chocolate Fudge Cake","ingredients":[" ½ cup vegetable oil"," 1 cup granulated sugar"," 1 cup brown sugar (packed)"," 3 large eggs"," ½ cup sour cream"," 2 teaspoons pure vanilla extract"," 2 cup all-purpose flour"," ¾ cup unsweetened cocoa powder"," 1 ½ teaspoons baking soda"," 1 teaspoon baking powder"," 1 teaspoon kosher salt*"," 1 cup warm water"],"instructions":["Preheat oven to 350 F. Grease and flour 2 9-inch round cake pans.** Set aside.","In a large bowl, whisk the oil and sugars together until combined. It will look like wet sand. ","Whisk in the eggs one at a time.","Add the sour cream and vanilla, and whisk until combined.","Add flour, cocoa powder, baking soda, baking powder and salt, and stir until just combined. Batter will be thick.","Stir in the warm water just until combined.","Divide the batter evenly between the prepared pans.","Bake for 25-35 minutes, or until a toothpick inserted into the center of the cakes comes out with a few fudgy crumbs attached.","Place the pans on a wire cooling rack and let cool for 20 minutes.","Run a thin knife around the edge of each cake to loosen it from the pan, and then invert the cakes onto the rack. I like to lightlyspray the cooling rack with nonstick spray to keep the cake from sticking.","Let cool completely before frosting."],"tags":[],"time":{"prep":"15","cook":"25","total":"40"},"servings":null,"image":"data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20215%20215'%3E%3C/svg%3E","slug":"49-chocolate-fudge-cake.json","url":"https://www.ihearteating.com/chocolate-fudge-cake/"},{"name":"Chocolate Lava Cakes","ingredients":["6 ounces (170g) high quality semi-sweet chocolate*","1/2 cup (115g; 1 stick) unsalted butter","1/4 cup (31g) all-purpose flour (spoon & leveled)","1/2 cup (60g) confectioners’ sugar","1/8 teaspoon salt","2 large eggs","2 large egg yolks*","optional for topping: ice cream, raspberries, and/or chocolate syrup"],"instructions":["Spray four 6 ounce ramekin with nonstick cooking spray and dust with cocoa powder. This ensures the cakes will seamlessly come out of the ramekins when inverted onto a plate in step 7. *Or spray half of a 12-count muffin pan and dust with cocoa powder. If baking in a muffin pan, the recipe will yield 6 cakes.","Preheat oven to 425°F (218°C).","Coarsely chop the chocolate. Place butter into a medium heat-proof bowl, then add chopped chocolate on top. Microwave on high in 10 second increments, stirring after each until completely smooth. Set aside.","Whisk the flour, confectioners’ sugar, and salt together in a small bowl. Whisk the eggs and egg yolks together until combined in another small bowl. Pour the flour mixture and eggs into the bowl of chocolate. Slowly stir everything together using a rubber spatula or wooden spoon. If there are any lumps, gently use your whisk to rid them. The batter will be slightly thick.","Spoon chocolate batter evenly into each prepared ramekin or muffin cup.","Place ramekins onto a baking sheet and bake for 12-14 minutes until the sides appear solid and firm– the tops will still look soft. *If baking in a muffin pan, the cakes only take about 8-10 minutes.","Allow to cool for 1 minute, then cover each with an inverted plate and turn over. Use an oven mitt because those ramekins are hot! The cakes should release easily from the ramekin. *If you used a muffin pan, use a spoon to release the cakes from the pan and place each upside down on plates.","Add toppings. Serve immediately."],"tags":[],"time":{"prep":"","cook":"","total":"25 minutes"},"servings":null,"image":"data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20265%20265'%3E%3C/svg%3E","slug":"10-chocolate-lava-cakes.json","url":"https://sallysbakingaddiction.com/chocolate-lava-cakes/"},{"name":"Chunky Maple Blueberry Sauce","ingredients":["2 cups fresh or frozen (unthawed) blueberries","¼ cup maple syrup or liquid sweetener of choice","Pinch salt","2 teaspoons water","1 teaspoon non-GMO cornstarch","1 teaspoon lemon juice","½ teaspoon vanilla extract"],"instructions":["Place the blueberries, sweetener, and salt in a small saucepan and stir to combine. Bring the mixture to a boil, while whisking. The blueberries will begin to release their juices. Reduce the heat to a simmer, and allow the mixture to cook for 5 minutes, checking in to give it a stir every minute. Some of the blueberries will pop as they cook, releasing more juices.","In a small dish, whisk the water and cornstarch until dissolved. Whisk the mixture into the blueberry sauce. Bring the sauce back to a low boil, and allow it to boil for 2 minutes, while whisking. It should thicken up nicely.","Remove from the heat and whisk in the lemon juice and vanilla extract. Let the sauce cool for a few minutes before serving."],"tags":[],"time":{"prep":"","cook":"","total":""},"servings":null,"image":"","slug":"3-chunky-maple-blueberry-sauce.json","url":"https://www.godairyfree.org/recipes/chunky-maple-blueberry-sauce"},{"name":"Cinnabons Cinnamon Rolls","ingredients":[" 2 ¼ teaspoon active dry yeast or instant yeast"," 1 cup milk lukewarm"," ½ cup granulated sugar"," ⅓ cup butter unsalted, softened, or margarine"," 1 teaspoon salt"," 2 eggs"," 4 cups all-purpose flour"," 1 cup brown sugar packed"," 3 tablespoon cinnamon"," ⅓ cup butter unsalted, softened, or margarine"," 6 tablespoon butter unsalted, softened, or margarine"," 1 ½ cups powdered sugar also known as icing sugar, or confectioner’s sugar"," ¼ cup cream cheese at room temperature"," ½ teaspoon vanilla extract"," ⅛ teaspoon salt"],"instructions":["For the rolls, dissolve the yeast in the warm milk with a tsp of sugar (you can take a tsp out of the 1/2 cup of sugar) in a large bowl. Let it sit for about 5 minutes. If the yeast is good, it will start to froth up.","To the bowl of your mixer add the sugar, butter or margarine, salt, eggs, and flour and mix until well incorporated.","Pour the milk/yeast mixture over the flour mixture and using the dough hook, mix well until well incorporated and the dough comes clean from the side of the bowl.","Place the dough into an oiled bowl, cover and let rise in a warm place about 1 hour or until the dough has doubled in size.","Combine the brown sugar and cinnamon in a bowl.","Grease a 9×13 inch baking dish with cooking spray or butter.","Roll the dough out on a lightly floured surface, until it is approximately 16 inches long by 12 inches wide. It should be approximately 1/4 inch in thickness.","Spread the 1/3 cup of butter evenly over the dough, then sprinkle with the sugar evenly over the surface of the dough.","Working carefully, from the long edge, roll the dough down to the bottom edge.","Cut the dough into 1 1/2 inch slices, and place in a lightly greased baking pan. You can also use floss to cut into slices, as seen in the video. Place the cut rolls in the prepared pan. Cover with a clean kitchen towel or plastic wrap and let them rise for another 30 minutes, or until doubled in size.","Preheat oven to 350°F. ","Place the baking pan in the oven and bake for 20 minutes or until golden brown. Cooking time can vary greatly!","While the rolls are baking make the icing by mixing all the icing ingredients and beat well with an electric mixer until fluffy and smooth.","When the rolls are done, spread generously with icing."],"tags":[],"time":{"prep":"20","cook":"20","total":"10"},"servings":null,"image":"data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20200%20200'%3E%3C/svg%3E","slug":"36-cinnabons-cinnamon-rolls.json","url":"https://www.jocooks.com/recipes/cinnabons-cinnamon-rolls/"},{"name":"Cinnamon Baked French Toast","ingredients":["\n              For the French toast: Grease the baking pan with butter. Tear the bread into chunks, or cut into cubes, and evenly distribute in the pan. Crack the eggs in a big bowl. Whisk together the eggs, milk, cream, granulated sugar, brown sugar and vanilla. Pour evenly over the bread. Cover the pan tightly and store in the fridge until needed (overnight preferably). \n            ","\n              For the topping: Mix the flour, brown sugar, cinnamon, salt and some nutmeg in a separate bowl. Stir together using a fork. Add the butter and with a pastry cutter, and mix it all together until the mixture resembles fine pebbles. Store in a re-sealable plastic bag in the fridge. \n            ","\n              When you're ready to bake the casserole, preheat the oven to 350 degrees F. Remove the casserole from the fridge and sprinkle the topping over the top. Bake for 45 minutes for a softer, more bread pudding texture or for 1 hour or more for a firmer, crisper texture. \n            ","\n              Scoop out individual portions. Top with butter and drizzle with warm pancake syrup and sprinkle with blueberries.\n            "],"instructions":["Watch Full Seasons","TV Schedule","Newsletters","Videos","Sweepstakes","Magazine","Blog","Shows A-Z","Chefs A-Z","Restaurants","","","","","","","Thanksgiving","Family-Friendly Dinners","Holiday Central","Tailgating Ideas","Healthy","Girl Meets Farm8am | 7c","Girl Meets Farm8:30am | 7:30c","Girl Meets Farm9am | 8c","Girl Meets Farm9:30am | 8:30c","The Pioneer Woman10am | 9c","The Pioneer Woman10:30am | 9:30c","The Pioneer Woman11am | 10c","The Pioneer Woman11:30am | 10:30c","The Pioneer Woman12pm | 11c","The Pioneer Woman12:30pm | 11:30c","Guy's Grocery Games1pm | 12c","Guy's Grocery Games2pm | 1c","Guy's Grocery Games3pm | 2c","Guy's Grocery Games4pm | 3c","Guy's Grocery Games5pm | 4c","Guy's Grocery Games6pm | 5c","Guy's Grocery Games7pm | 6c","Guy's Grocery Games8pm | 7c","Guy's Grocery Games9pm | 8c","On TonightGuy's Grocery Games10pm | 9c","Guy's Grocery Games11pm | 10c","Guy's Grocery Games12am | 11c","Guy's Grocery Games1am | 12c","Guy's Grocery Games2am | 1c","Guy's Grocery Games3am | 2c","Winner Cake All4am | 3c","Product Reviews","Holiday Gift Guides","Shop Everything","My Meal Plan","Browse Meal Plans","Classes","Weeknight Dinners","Home","Recipes","Ree Drummond","Level:Easy","Total:13 hr","Prep:15 min","Inactive:12 hr","Cook:45 min","Yield:12 servings","Pinterest","Facebook","Twitter","Email","","Level:Easy","Total:13 hr","Prep:15 min","Inactive:12 hr","Cook:45 min","Yield:12 servings","Creme Brulee French Toast Recipe","Healthy Overnight French Toast Bake Recipe","French Toast Bread Pudding Recipe","Raspberry Baked French Toast Recipe","Baked Challah French Toast Recipe","Totally Tasty Overnight French Toast Recipe","Site Map","Visitor Agreement","AdChoices","Privacy Notice","About","Newsroom","Advertise","Help","TV Ratings","Online Closed Captioning","California Privacy Notice","CA Do Not Sell My Info","Accessibility","Newsletters","Discovery, Inc.","International EditionsUnited StatesAsiaBrazilCanadaEurope, Middle East & AfricaUnited KingdomLatin America","United States","Asia","Brazil","Canada","Europe, Middle East & Africa","United Kingdom","Latin America","The Discovery Family of NetworksHGTVFood.comTravel ChannelTLCme.comDiscovery.comCooking Channel","HGTV","Food.com","Travel Channel","TLCme.com","Discovery.com","Cooking Channel","© 2021Discovery or its subsidiaries and affiliates. All rights reserved.","Pinterest","Facebook","Twitter","Email",""],"tags":[],"time":{"prep":"","cook":"","total":""},"servings":null,"image":"","slug":"51-cinnamon-baked-french-toast.json","url":"https://www.foodnetwork.com/recipes/ree-drummond/cinnamon-baked-french-toast-recipe-2120484"},{"name":"Cinnamon Roll Layer Cake","ingredients":["3/4 cup unsalted butter, room temperature","1 1/2 cups granulated sugar","3/4 cup sour cream, room temperature","2 teaspoons vanilla","6 large egg whites, divided","2 1/2 cups all purpose flour","4 teaspoon baking powder","1 teaspoon ground cinnamon (see note)","1/2 teaspoon kosher salt","3/4 cup milk, room temperature","1/4 cup water, room temperature","1 1/2 cups salted butter, room temperature","1 1/2 cups vegetable shortening","12 cups powdered sugar, divided","1 teaspoon vanilla","1 teaspoon ground cinnamon (see note)","1/4 cup water or milk","5 tablespoons powdered sugar","2 tablespoons light brown sugar, packed","1 tablespoon ground cinnamon","2 tablespoons water","Cake","3/4 cup unsalted butter, room temperature","1 1/2 cups granulated sugar","3/4 cup sour cream, room temperature","2 teaspoons vanilla","6 large egg whites, divided","2 1/2 cups all purpose flour","4 teaspoon baking powder","1 teaspoon ground cinnamon (see note)","1/2 teaspoon kosher salt","3/4 cup milk, room temperature","1/4 cup water, room temperature","Cinnamon Frosting","1 1/2 cups salted butter, room temperature","1 1/2 cups vegetable shortening","12 cups powdered sugar, divided","1 teaspoon vanilla","1 teaspoon ground cinnamon (see note)","1/4 cup water or milk","Cinnamon Sugar Glaze","5 tablespoons powdered sugar","2 tablespoons light brown sugar, packed","1 tablespoon ground cinnamon","2 tablespoons water"],"instructions":["Preheat the oven to 350°F. Line the bottom of 3 (8- inch) cake pans with parchment paper and grease the sides. (I used nonstick spray).","In the bowl of your stand mixer fitted with the paddle attachment cream the butter and sugar together on medium speed until light and fluffy, 3-4 minutes. Add the sour cream and vanilla and mix until combined. Add 3 of the egg whites and mix until well combined. Add the remaining 3 egg whites and mix until well combined. Scrape down the sides of the bowl as needed to make sure everything is combined.","Whisk together the flour, baking powder, cinnamon, and salt in a medium bowl. In a small bowl combine the milk and water. With the mixer on low speed add half of the flour mixture to the batter and mix until combined. Add the milk mixture to the batter and mix until combined. Add the remaining flour and mix until smooth, scraping the sides of the bowl as necessary.","Divide the batter evenly among the 3 cake pans. Bake for 23-25 minutes or until a toothpick inserted in the center of the cakes comes out clean.","Allow the cakes to cool 2-3 minutes in the pan and then remove them from the pans onto a wire rack to cool completely.","In the bowl of your stand mixer fitted with the paddle attachment beat the butter and shortening together on medium speed until smooth. Slowly add in 6 cups of the powdered sugar and mix until smooth. Add in the vanilla, cinnamon and water or milk and mix until smooth. Slowly add the remaining 6 cups of powdered sugar and mix until smooth, scraping the sides of the bowl as necessary.","In a small bowl whisk together powdered sugar, brown sugar, cinnamon, and water until smooth. Set aside.","Use a large serrated knife to carefully remove any domes the cake formed when baking, so they’re flat. Place the first cake on a serving plate. Spread 2 1/2 tablespoons of the glaze over the cake layer. All it to soak into the cake. Spread 1 cup of frosting onto the top of the cake. Repeat the process with the second layer of the cake, and then add the final layer of cake and frost as desired.","Cake","Preheat the oven to 350°F. Line the bottom of 3 (8- inch) cake pans with parchment paper and grease the sides. (I used nonstick spray).","In the bowl of your stand mixer fitted with the paddle attachment cream the butter and sugar together on medium speed until light and fluffy, 3-4 minutes. Add the sour cream and vanilla and mix until combined. Add 3 of the egg whites and mix until well combined. Add the remaining 3 egg whites and mix until well combined. Scrape down the sides of the bowl as needed to make sure everything is combined.","Whisk together the flour, baking powder, cinnamon, and salt in a medium bowl. In a small bowl combine the milk and water. With the mixer on low speed add half of the flour mixture to the batter and mix until combined. Add the milk mixture to the batter and mix until combined. Add the remaining flour and mix until smooth, scraping the sides of the bowl as necessary.","Divide the batter evenly among the 3 cake pans. Bake for 23-25 minutes or until a toothpick inserted in the center of the cakes comes out clean.","Allow the cakes to cool 2-3 minutes in the pan and then remove them from the pans onto a wire rack to cool completely.","Frosting","In the bowl of your stand mixer fitted with the paddle attachment beat the butter and shortening together on medium speed until smooth. Slowly add in 6 cups of the powdered sugar and mix until smooth. Add in the vanilla, cinnamon and water or milk and mix until smooth. Slowly add the remaining 6 cups of powdered sugar and mix until smooth, scraping the sides of the bowl as necessary.","Cinnamon Sugar Glaze","In a small bowl whisk together powdered sugar, brown sugar, cinnamon, and water until smooth. Set aside.","Assembly","Use a large serrated knife to carefully remove any domes the cake formed when baking, so they’re flat. Place the first cake on a serving plate. Spread 2 1/2 tablespoons of the glaze over the cake layer. All it to soak into the cake. Spread 1 cup of frosting onto the top of the cake. Repeat the process with the second layer of the cake, and then add the final layer of cake and frost as desired."],"tags":[],"time":{"prep":"","cook":"","total":""},"servings":null,"image":"data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20150%20150'%3E%3C/svg%3E","slug":"15-cinnamon-roll-layer-cake.json","url":"https://cookiesandcups.com/cinnamon-roll-layer-cake/"},{"name":"Creamy Chicken Pasta with Cajun Sauce","ingredients":[" olive oil"," cajun seasoning"," 1 chicken breast or chicken tenders"," 1 pound pasta"," 1 tablespoon garlic minced "," ⅓ cup green onion diced"," 1  tablespoon cajun seasoning"," 4 cups heavy whipping cream"," 1 cup parmesan fresh grated"," 1 red bell pepper sliced (optional)"," 1 green bell pepper sliced (optional)"],"instructions":["Add olive oil to a plate or shallow bowl and cajun seasoning to a plate or solid bowl. Dip chicken breast into oil followed by cajun seasoning and transfer to a cast iron skillet over medium heat.","Blacken chicken 3 minutes and flip. Cook chicken 3 minutes or until done. Set aside.","Meanwhile, bring a large pot of water to a boil.","Cook your pasta according to package directions (I like to save a little of the pasta water just in case the sauce needs thinned).","Sauté your peppers and mushrooms over medium heat with a little olive oil (you can also just cook them with the sauce, they just don't get quite as soft)","Once they are tender, add garlic, green onions, cajun seasoning and heavy cream. ","Bring sauce to a boil until bubbles form in the center.","Toss the fresh cooked pasta into the cajun sauce with the chicken. ","Remove from heat and immediately add parmesan cheese. Toss until coated. "],"tags":[],"time":{"prep":"20 mins","cook":"10 mins","active":"","inactive":"","ready":"","total":"3030 minutesmins"},"servings":"8","image":"https://julieblanner.com/wp-content/uploads/2019/04/Creamy-Chicken-Pasta.jpg","slug":"20-creamy-chicken-pasta-with-cajun-sauce.json","url":"https://julieblanner.com/creamy-cajun-chicken-pasta/"},{"name":"Creamy Parmesan One Pot Chicken and Rice","ingredients":[" 1.5 Pounds Chicken Breasts, Cut into 1 inch pieces"," 4 Tablespoons Butter"," 1 Large onion, Diced"," 3 Cloves Garlic, Minced (3 Teaspoons)"," 2 Teaspoons Italian Seasoning"," ½ Teaspoon Pepper"," 1 Teaspoon Salt"," 2 ½ Cups Chicken Broth"," 1 Cup long grain white rice"," ½ Cup Heavy Cream"," ½ Cup Freshly Grated Parmesan Cheese"," Parsley for serving, Optional"],"instructions":["Heat the butter in a large skillet over medium high heat. Add the onion and cook for 2-3 minutes, until beginning to soften.","Add the diced chicken to the pan along with the Italian seasoning, pepper, and salt.","Cook and stir for 5 minutes until chicken is golden on all sides.","Add the garlic and cook for one more minute, stirring constantly.","Add the chicken broth and rice to the pan and stir.","Bring to a boil, then reduce the heat to medium low.","Cover with a lid and simmer for 17-20 minutes, until rice is completely tender.","Stir in the heavy cream and parmesan.Serve immediately topped with parsley if desired."],"tags":[],"time":{"prep":"5","cook":"25","total":"30"},"servings":null,"image":"data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20200%20200'%3E%3C/svg%3E","slug":"25-creamy-parmesan-one-pot-chicken-and-rice.json","url":"https://thesaltymarshmallow.com/creamy-parmesan-one-pot-chicken-rice/"},{"name":"Crispy Hashbrowns","ingredients":["\n              Heat the oil and butter on a griddle over medium-high heat until the butter is melted. Add the shredded potatoes and pack them down tightly into a patty. Cover and cook just until the perimeters start to get golden, about 5 minutes. Use a spatula to press the top down. Season with salt and pepper and flip. Cook, uncovered, until the bottom is golden and crispy, another 3 to 5 minutes.\n            "],"instructions":["Watch Full Seasons","TV Schedule","Newsletters","Videos","Sweepstakes","Magazine","Blog","Shows A-Z","Chefs A-Z","Restaurants","","","","","","","Thanksgiving","Family-Friendly Dinners","Holiday Central","Tailgating Ideas","Healthy","Girl Meets Farm8am | 7c","Girl Meets Farm8:30am | 7:30c","Girl Meets Farm9am | 8c","Girl Meets Farm9:30am | 8:30c","The Pioneer Woman10am | 9c","The Pioneer Woman10:30am | 9:30c","The Pioneer Woman11am | 10c","The Pioneer Woman11:30am | 10:30c","The Pioneer Woman12pm | 11c","The Pioneer Woman12:30pm | 11:30c","Guy's Grocery Games1pm | 12c","Guy's Grocery Games2pm | 1c","Guy's Grocery Games3pm | 2c","Guy's Grocery Games4pm | 3c","Guy's Grocery Games5pm | 4c","Guy's Grocery Games6pm | 5c","Guy's Grocery Games7pm | 6c","Guy's Grocery Games8pm | 7c","Guy's Grocery Games9pm | 8c","On TonightGuy's Grocery Games10pm | 9c","Guy's Grocery Games11pm | 10c","Guy's Grocery Games12am | 11c","Guy's Grocery Games1am | 12c","Guy's Grocery Games2am | 1c","Guy's Grocery Games3am | 2c","Winner Cake All4am | 3c","Product Reviews","Holiday Gift Guides","Shop Everything","My Meal Plan","Browse Meal Plans","Classes","Weeknight Dinners","Home","Recipes","Level:Easy","Total:15 min","Active:15 min","Yield:1 serving","Pinterest","Facebook","Twitter","Email","","Level:Easy","Total:15 min","Active:15 min","Yield:1 serving","Butter Beans Recipe","Wafflemaker Hash Browns Recipe","Air Fryer Frozen Chicken Breast Recipe","Crispy Hash Browns with Smoky Sauce Recipe","How to Cook Frozen Lobster Tails","How to Cook Salmon from Frozen","Site Map","Visitor Agreement","AdChoices","Privacy Notice","About","Newsroom","Advertise","Help","TV Ratings","Online Closed Captioning","California Privacy Notice","CA Do Not Sell My Info","Accessibility","Newsletters","Discovery, Inc.","International EditionsUnited StatesAsiaBrazilCanadaEurope, Middle East & AfricaUnited KingdomLatin America","United States","Asia","Brazil","Canada","Europe, Middle East & Africa","United Kingdom","Latin America","The Discovery Family of NetworksHGTVFood.comTravel ChannelTLCme.comDiscovery.comCooking Channel","HGTV","Food.com","Travel Channel","TLCme.com","Discovery.com","Cooking Channel","© 2021Discovery or its subsidiaries and affiliates. All rights reserved.","Pinterest","Facebook","Twitter","Email",""],"tags":[],"time":{"prep":"","cook":"","total":""},"servings":null,"image":"","slug":"62-crispy-hashbrowns.json","url":"https://www.foodnetwork.com/recipes/crispy-hashbrowns-4649085"},{"name":"Dairy-Free Gluten-Free Dutch Baby with Maple Blueberry Sauce","ingredients":["1 cup rolled oats (certified gluten-free, if needed; can sub 1 cup of your flour of choice)","⅛ teaspoon salt","1 cup regular or unsweetened dairy-free milk beverage","1 tablespoon maple syrup, honey, or agave nectar","½ teaspoon vanilla extract","4 medium eggs, brought to room temperature if you have time","½ tablespoon coconut oil or dairy-free buttery spread","Chunky Maple Blueberry Sauce"],"instructions":["Preheat your oven to 425ºF","Grind the oats in a spice grinder or food processor into a flour.","Sift the oat flour and salt into a medium-sized mixing bowl. Whisk in the milk beverage, sweetener, and vanilla until everything is well combined.","Whisk in the eggs one at a time until incorporated.","Put the coconut oil or buttery spread in a 9-inch pie plate, cast iron pan, or similarly sized baking dish, and place it in the oven for 3 minutes, or until the oil / buttery spread is melted and the pan is heated.","Removed the dish (with a pot holder!) and swirl the oil around to coat. Pour in the egg batter and bake for 25 minutes. The batter will climb up, swelling a bit like a souffle (it is really fun to watch). But when you take it out of the oven, it will deflate.","Top with the maple blueberry sauce."],"tags":[],"time":{"prep":"","cook":"","total":""},"servings":null,"image":"","slug":"2-dairy-free-gluten-free-dutch-baby-with-maple-blueberry-sauce.json","url":"https://www.godairyfree.org/news/nutrition-headlines/dutch-baby-love-dairy-free-gluten-free-german-pancakes-revisited"},{"name":"Dairy-Free Ice Cream (Rich ‘n Creamy)","ingredients":["1 can (13.5 oz) whole coconut milk (usually in ethnic aisles of grocery stores)","1 cup original or vanilla almond milk*","1/2 cup agave nectar","1/2 tsp xanthan gum (gluten-free thickener)","1/4 tsp table salt","Optional Add-Ins: 1/2 cup diced strawberries or other fruit, chocolate chips, sprinkles, etc."],"instructions":["In a blender, add all ingredients and blend on high until thick and creamy, 1-2 min. Transfer mixture to an airtight container and chill 2-4 hours.","Place chilled mixture into an ice-cream maker and churn according to manufacturer’s instructions (might only need half the amount of suggested churn time, as it thickens pretty quickly.) If using add-ins, gently add them during last 5 minutes of churning.","May serve immediately for a frozen custard-like texture that’s ultra creamy, smooth, and soft. Otherwise, transfer ice cream to an airtight container and freeze 30-60 minutes for a firmer texture. If frozen much longer, it will need thaw time at room temp before serving (actual thaw time depends on your room temp.)"],"tags":[],"time":{"prep":"","cook":"","total":"15 mins"},"servings":null,"image":"https://www.chewoutloud.com/wp-content/uploads/2016/07/Dairy-Free-Ice-Cream-in-a-dish-squre-150x150.jpg","slug":"5-dairy-free-ice-cream-rich-n-creamy.json","url":"https://www.chewoutloud.com/dairy-free-ice-cream/"},{"name":"Dutch Baby","ingredients":["\n                  \n                    \n                      3\n                    \n                    \n                      eggs\n                    \n                  \n                  \n                    \n                      ½\n                    \n                    \n                      cup flour\n                    \n                  \n                  \n                    \n                      ½\n                    \n                    \n                      cup milk\n                    \n                  \n                  \n                    \n                      1\n                    \n                    \n                      tablespoon sugar\n                    \n                  \n                  \n                    \n                      \n                    \n                    \n                      Pinch of nutmeg\n                    \n                  \n                  \n                    \n                      4\n                    \n                    \n                      tablespoons unsalted butter\n                    \n                  \n                  \n                    \n                      \n                    \n                    \n                      Syrup, preserves, confectioners' sugar or cinnamon sugar\n                    \n                  \n                "],"instructions":["Preheat oven to 425 degrees.","Combine eggs, flour, milk, sugar and nutmeg in a blender jar and blend until smooth. Batter may also be mixed by hand.","Place butter in a heavy 10-inch skillet or baking dish and place in the oven. As soon as the butter has melted (watch it so it does not burn) add the batter to the pan, return pan to the oven and bake for 20 minutes, until the pancake is puffed and golden. Lower oven temperature to 300 degrees and bake five minutes longer.","Remove pancake from oven, cut into wedges and serve at once topped with syrup, preserves, confectioners' sugar or cinnamon sugar."],"tags":[],"time":{"prep":"","cook":"","total":"40 minutes"},"servings":null,"image":"","slug":"4-dutch-baby.json","url":"https://cooking.nytimes.com/recipes/6648-dutch-baby"},{"name":"Dutch Oven Peach Cobbler","ingredients":["6 tablespoons unsalted butter","3 pounds ripe peaches about 5-6 large or 8-9 small/medium peaches","1/3 cup honey","2 tablespoons cornstarch","1 teaspoon vanilla extract","½ teaspoon ground cinnamon","½ teaspoon ground ginger","3/4 cup granulated sugar","1/3 cup white whole wheat flour","1/3 cup all purpose flour","2 teaspoons baking powder","1/2 teaspoon kosher salt","1/2 cup milk","Vanilla ice cream homemade whipped cream, Greek yogurt, or a pour of heavy cream"],"instructions":["If baking in the oven, preheat the oven to 350 degrees F (See recipe notes to if cooking this cobbler over a campfire.) Place the butter in the bottom of a 10-inch dutch oven or a 3-quart baking dish with high sides. Once the butter is melted, remove the dish from the oven.","To quickly and easily peel the peaches: Bring a very large pot with enough water to cover the peaches to a boil. While the water comes to a boil, prepare an ice bath by placing a handful of ice cubes in a large bowl and then filling it with cold water. Once the water is boiling, with a slotted spoon or tongs to protect your fingers, gently lower the peaches into the water. Add the peaches in two batches so that the water temperature does not rapidly drop. Boil for 1 minute. Remove peaches from the pot and plunge into the ice bath to stop the cooking. The skins can now be easily slipped off with your fingers. Cut peaches into 1/3-ish inch wide slices, then place the slices into a large mixing bowl. If you prefer, you can peel the peaches with a vegetable peeler.","To the bowl with the peaches, add the honey, cornstarch, vanilla extract, cinnamon, and ginger. Stir gently to combine. Set aside.","In a separate bowl, prepare the topping. Whisk together the sugar, white whole wheat flour, all purpose flour, baking powder, and salt. Add the milk, and whisk to combine. Gently pour the batter over the melted butter. DO NOT STIR. Now, carefully spoon the fruit and any juices that have collected in the bottom of the bowl on top of the batter. Again, DO NOT STIR.","Bake for 50 to 60 minutes, until the topping is deep golden at the edges and a toothpick inserted in the middle of the topping (not the peach filling) comes out clean. The topping will rise above the peaches, puff up, and turn golden so that you have a cake with fruit beneath. Serve the cobbler warm with whipped cream, a scoop of ice cream, or our family favorite: a pour of heavy cream."],"tags":[],"time":{"prep":"30","cook":"50","total":"20"},"servings":null,"image":"data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20250%20250'%3E%3C/svg%3E","slug":"38-dutch-oven-peach-cobbler.json","url":"https://www.wellplated.com/dutch-oven-peach-cobbler/"},{"name":"Easy 20 Minute Chicken Tacos","ingredients":["1 pound chicken thighs, boneless skinless or chicken breasts","2 cloves garlic minced","1 tablespoon lime juice  optional","2 tablespoons olive oil","1 tablespoon chili powder","1/2 teaspoon paprika optional","½ teaspoon garlic powder or onion powder","1/2 teaspoon salt or to taste","1/4 teaspoon black pepper","8 small  corn or flour tortillas ","1/2 cup finely chopped onion","1/2  cup finely chopped tomato","1/4 cup finely chopped cilantro","1 finely chopped jalapeño deseeded ","1  tsp lime juice ","pinch  salt and pepper to taste"],"instructions":["Add the chicken, garlic, olive oil, lime, and spices, to a large bowl or zip-seal bag and stir or shake to combine.","Heat a large pan to medium-high heat. Cook chicken 6-7 minutes per side or until it is no longer pink and the internal temperature of 165 degrees F. Remove from heat and cool for at least 5 minutes. Slice or chop into small cubes.","While the chicken is cooking, combine the chopped tomato, jalapeno, onion, cilantro, and lime juice in a small bowl. Char tortillas on the stovetop over the flame until lightly charred (this step is optional).","Assemble tacos by placing about 1/4 cup of chicken into each tortilla. Top with a few tablespoons of the onion-tomato mixture and a drizzle of cilantro sauce (*optional, see recipe in notes). "],"tags":[],"time":{"prep":"5","cook":"15","total":"20"},"servings":null,"image":"data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20200%20200'%3E%3C/svg%3E","slug":"53-easy-20-minute-chicken-tacos.json","url":"https://gimmedelicious.com/chicken-tacos/"},{"name":"Easy Cake Mix Cookies","ingredients":["\n\t\t\t\t\t\t1 cake mix (any flavor)\t\t\t\t\t","\n\t\t\t\t\t\t2 large eggs\t\t\t\t\t","\n\t\t\t\t\t\t1/2 cup oil\t\t\t\t\t","\n\t\t\t\t\t\tmix-ins or frosting of choice\t\t\t\t\t"],"instructions":["Facebook","Twitter","Instagram","Pinterest","RSS","Home","Aboutprivacy policy","privacy policy","Work with Cheryl","Contact","Food & DrinkAll RecipesRecipe Indexrecipe videos","All Recipes","Recipe Index","recipe videos","Lifestyle & DIY","Tidy Home","Travel","SeasonalChristmasEasterFallHalloweenJuly 4thMardi GrasMother’s DaySt. Patricks DaySummerThanksgivingValentines","Christmas","Easter","Fall","Halloween","July 4th","Mardi Gras","Mother’s Day","St. Patricks Day","Summer","Thanksgiving","Valentines","Share","Pin","Tweet","Yum","Strawberry White Chocolate Chip: A strawberry cake mix and some white chocolate chips turn this cookie into a strawberries and cream delight! ","Chocolate Peanut Butter: Who needs Reese’s peanut butter cup when you have a chocolate cake mix, and a bag full of peanut butter chips? ","Chocolate M&M: What compliments chocolate better than more chocolate? A chocolate cake mix sprinkled with M&M’s is just the chocolate fix you need. ","Birthday Cake: It doesn’t have to be your birthday to enjoy this white cake mix, and sprinkles combo. ","Vanilla M&M: For a classic M&M cookie, break out your vanilla cake mix, and a bag of your favorite M&Ms. ","1 cake mix (any flavor)","2 large eggs","1/2 cup oil","mix-ins or frosting of choice","<img class=\"mv-create-products-img obj-fit no_pin ggnoads\" src=\"https://m.media-amazon.com/images/I/41yUR8mDUZL._SL500_.jpg\" alt=\"KitchenAid Hand Mixer \" nopin=\"nopin\" height=\"240\" width=\"240\" />KitchenAid Hand Mixer","<img class=\"mv-create-products-img obj-fit no_pin ggnoads\" src=\"https://m.media-amazon.com/images/I/41Jl62AdeIL._SL500_.jpg\" alt=\"KitchenAid 7-Quart Pro Stand Mixer\" nopin=\"nopin\" height=\"240\" width=\"240\" />KitchenAid 7-Quart Pro Stand Mixer","<img class=\"mv-create-products-img obj-fit no_pin ggnoads\" src=\"https://m.media-amazon.com/images/I/414TMDEnXPL.jpg\" alt=\"Cookie Scoop\" nopin=\"nopin\" height=\"240\" width=\"240\" />Cookie Scoop","<img class=\"mv-create-products-img obj-fit no_pin ggnoads\" src=\"https://m.media-amazon.com/images/I/51rOZeDaVaL._SL500_.jpg\" alt=\"Reynolds Cookie Baking Sheets Non-Stick Parchment Paper \" nopin=\"nopin\" height=\"240\" width=\"240\" />Reynolds Cookie Baking Sheets Non-Stick Parchment Paper","<img class=\"mv-create-products-img obj-fit no_pin ggnoads\" src=\"https://m.media-amazon.com/images/I/31ItL9H56VL._SL500_.jpg\" alt=\"Aluminum Baker&#039;s Half Sheet Pan\" nopin=\"nopin\" height=\"240\" width=\"240\" />Aluminum Baker's Half Sheet Pan","New Posts","Weekly Newsletter","Billie Glisson—May 16, 2020 @ 3:24 pmReplyMy granddaughter and myself made these. They were super easy to make and delicious. Fun to make with kids. Love them.","TidyMom—August 23, 2010 @ 12:32 pmReplyYUM!!!..love the idea of mixing in the mini choc chips too","TidyMom—August 23, 2010 @ 12:32 pmReplyThat’s a GREAT idea Pam!","TidyMom—August 23, 2010 @ 12:31 pmReplyDiane those sound REALLY yummy!!","TidyMom—August 23, 2010 @ 12:30 pmReplynot sure, but that would take the “easy” out of them LOL……..if you try it Paula, let me know!","TidyMom—August 23, 2010 @ 12:30 pmReplythey are!! I promise!!","TidyMom—August 23, 2010 @ 12:55 pmReplyFixed it!………thanks for pointing that out Amanda……..there’s now a Stumble icon at the bottom of each post!","Michelle V—August 28, 2010 @ 1:03 pmReplyYUM!I am sure these 30 cookies will not last the whole day.Now to mix icing and let the kids get messy.Did I just say that?OH MY WORD!What is right with me today?Thank you, thank you, thank you!","carolyn HAYES—October 2, 2021 @ 2:16 pmReplyi am allergic to peanut butter, too and all nuts.i get wow butter, which is soy nuts, and use for any recipe calling for peanut butter and you can not tell difference from peanut butter.","TidyMom—February 6, 2012 @ 8:37 amReplysorry Sarah, no I don’t have this post in my pin boards – but I added a pin it button to the post for you! thanks!","TidyMom—May 4, 2020 @ 5:09 pmReplyyou can add about 1/4 flour to the dough to make them a little fluffier","TidyMom—October 2, 2020 @ 12:11 pmReplyyou can put them on a greased cookie pan without parchment, they may just spread a little more than they would with the parchment","TidyMom—December 16, 2020 @ 6:30 amReplyyes 1/4 cup! thanks for catching that!","TidyMom—December 26, 2020 @ 10:47 amReplyyep!! butter is fine!!","TidyMom—February 19, 2021 @ 11:13 amReplyyou should be able to use any cake mix (I mostly use Duncan Hines, so I can’t say much for other brands).\nAlso, I prefer to use canola oil","TidyMom—November 20, 2021 @ 3:42 pmReplyI have not tried that.If you do, please let us know how they turn out.","New Posts","Weekly Newsletter","^ Top","Home","About","Contact","Work with Cheryl","Contest Disclosures","Disclosure","Privacy","Facebook","Twitter","Instagram","Pinterest","RSS","Food & DrinkAll RecipesRecipe Indexrecipe videos","All Recipes","Recipe Index","recipe videos","Lifestyle & DIY","Tidy Home","Travel","SeasonalChristmasEasterFallHalloweenJuly 4thMardi GrasMother’s DaySt. Patricks DaySummerThanksgivingValentines","Christmas","Easter","Fall","Halloween","July 4th","Mardi Gras","Mother’s Day","St. Patricks Day","Summer","Thanksgiving","Valentines","privacy policy","Facebook","Twitter","Instagram","Pinterest","RSS",""],"tags":[],"time":{"prep":"5 minutes","cook":"10 minutes","total":"15 minutes"},"servings":null,"image":"","slug":"18-easy-cake-mix-cookies.json","url":"https://tidymom.net/cake-mix-cookies/"},{"name":"Easy Chicken Tacos","ingredients":["2 teaspoons chili powder","1 teaspoon ground cumin","1 teaspoon smoked paprika","1 teaspoon dried oregano","1/2 teaspoon garlic powder","Kosher salt and freshly ground black pepper, to taste","1 1/2 pounds boneless, skinless chicken thighs","1 tablespoon canola oil","12 mini flour tortillas, warmed","1 cup pico de gallo, homemade or store-bought","1 avocado, halved, peeled, seeded and diced","1/2 cup chopped fresh cilantro leaves","1 lime, cut into wedges"],"instructions":["In a small bowl, combine chili powder, cumin, paprika, oregano, garlic powder, 1 teaspoon salt and 1/2 teaspoon pepper. Season chicken with chili powder mixture.","Heat canola oil in a large skillet over medium high heat. Working in batches, add chicken to the skillet in a single layer and cook until golden brown and cooked through, reaching an internal temperature of 165 degrees F, about 4-5 minutes per side. Let cool before dicing into bite-size pieces.","Serve chicken in tortillas, topped with pico de gallo, avocado, cilantro and lime."],"tags":[],"time":{"prep":"15 minutes","cook":"15 minutes","active":"","inactive":"","ready":"","total":"30 minutes"},"servings":"6 servings","image":"https://s23209.pcdn.co/wp-content/uploads/2019/08/Easy-Chicken-TacosIMG_9890.jpg","slug":"1-easy-chicken-tacos.json","url":"https://damndelicious.net/2019/08/06/easy-chicken-tacos/"},{"name":"Easy Honey Chipotle Chicken Tacos","ingredients":["2 tablespoons avocado oil or neutral high smoke point oil of choice","1 ½ pounds boneless, skinless chicken thighs or breasts (if using breasts, pound to even thickness or butterfly into 2 (two) 1-inch pieces)","1 teaspoon chili powder","1 teaspoon ground cumin","1 teaspoon smoked paprika","½ teaspoon onion powder","2 chipotle peppers (from a can, packed in adobo sauce), finely chopped","1 tablespoon adobo sauce (from a can of chipotle peppers)","¼ cup honey","½ cup light beer of choice (such as Modelo Especial)","1 lime, juiced","optional: cornstarch slurry (1 teaspoon cornstarch whisked into ¼ cup water)","kosher salt & ground black pepper, to season","for serving, as desired: charred corn or flour tortillas, cilantro lime rice, black beans, sour cream or cashew crema, pickled red onions, freshly chopped cilantro, queso fresco or cheese of choice, salsa of choice, lime wedges, etc."],"instructions":["Preheat the oven to 375 degrees F. Gather & prep all ingredients according to Ingredients List, above. ","Brown the chicken: Add the oil to a medium oven-safe skillet over medium heat. While the oil heats, season the chicken with chili powder, cumin, smoked paprika, onion powder, 1 ½ teaspoons kosher salt & ground black pepper as desired. Once the oil is hot & shimmers in the pan, carefully add the chicken to the skillet. Cook 2-3 minutes per side, until browned. The chicken will not yet be fully cooked – this is expected & totally fine.","Mix the chipotle honey sauce: Meanwhile, as the chicken browns, whisk together the chipotle honey sauce. Add the chipotle peppers, adobo sauce, honey, & beer to a small bowl or jar. Whisk or shake to combine. Set aside. ","Roast the chicken: Once browned, remove the skillet from the heat. Pour the chipotle honey sauce over the browned chicken, turning to coat in the sauce. Transfer to the oven & roast for 15-20 minutes, or until an instant-read thermometer inserted in the thickest portion of the chicken registers an internal temperature of 165 degrees F. Set aside to cool slightly.","Shred the honey chipotle chicken: Once cool enough to handle, carefully shred the chicken into bite-sized pieces – you can do so using 2 forks, or my favorite trick: pop the chicken thighs directly into in a stand mixer & let the paddle attachment do the work for you (I swear this works!). Transfer the shredded chicken back into the skillet. Squeeze in the lime juice, and toss to combine. If needed or desired, stir in a cornstarch slurry to tighten up the sauce a bit. ","Serve immediately as desired. Place in tortillas for honey chipotle chicken tacos or make a burrito bowl with rice & beans. Finish with your favorite taco night toppings of choice: sour cream or Mexican crema (or try our famous dairy-free Cashew Crema!), pickled red onions, cilantro, etc. Enjoy!"],"tags":[],"time":{"prep":"","cook":"","total":"35 minutes"},"servings":null,"image":"https://playswellwithbutter.com/wp-content/uploads/2020/12/Chipotle-Honey-Chicken-8-150x150.jpg","slug":"63-easy-honey-chipotle-chicken-tacos.json","url":"https://playswellwithbutter.com/honey-chipotle-chicken-tacos/"},{"name":"Easy Indian Chicken Curry - 15 Minutes","ingredients":[" 2 lb  (1 kg) Boneless chicken"," 1   Tomato chopped"," 1 tablespoon   Tomato paste mostly for color"," ½ cup  (120 ml) Sour cream"," 1 tablespoon   Lemon juice "," 2 tablespoon   Canola oil"," ½ tso   Salt "," ½ teaspoon   Pepper"," 1 medium   Onion ½ cup chopped"," 4 cloves   Garlic"," 2 tablespoon   Ginger"," ¼ cup   Cilantro leaves"," 5   Curry leaves"," 2 teaspoon    Red chilly powder Cayenne (med or hot)"," 1 teaspoon   Sweet Paprika for color"," 2 tablespoon   Coriander powder"," 1 teaspoon   Cumin powder"," ½ teaspoon   Turmeric powder"," ½ teaspoon   Garam masala"],"instructions":["Add all marinade ingredients to a food processor and blend until smooth. Set aside ","Wash, drain and pat dry the chicken. Season with salt and pepper.Set asideTip- never cook the chicken when cold or frozen as it will cook unevenly. And, a wet chicken means too much gravy, so wipe dry.","Masala - In a saute pan, add the oil and ground paste. Cook on medium for about 2 to 3 minutes. If necessary add a few tablespoons of water to prevent the spices from burning. Tip- cooking the spices is important for flavor so don't rush. Cook until you have a wonderful aroma from the spices. ","Tomatoes - Next, add the chopped tomatoes and tomato paste. Cook another minute","Chicken - Finally, add the chicken pieces and coat well with the mixture. Add one cup of water and stir.","Cook for about 8 to 10 minutes or until the chicken is cooked. Tip - if you use chicken breast it should be done in about 6 to 8 minutes, boneless chicken thighs or legs will take about 10 to 12 minutes. ","Sour cream - Add sour cream and stir well. Check and adjust seasoning.","Sprinkle with more chopped cilantro before you serve."],"tags":[],"time":{"prep":"5","cook":"15","total":"20"},"servings":null,"image":"//veenaazmanov.com/wp-content/plugins/a3-lazy-load/assets/images/lazy_placeholder.gif","slug":"58-easy-indian-chicken-curry---15-minutes.json","url":"https://veenaazmanov.com/quick-easy-indian-chicken-curry/"},{"name":"German Oven Pancakes","ingredients":["2 cups  milk","4 eggs","1 tsp vanilla extract","1 1/3 cup all-purpose flour","4 tbsp granulated sugar","1/2 cup butter (melt in pan)","1 lemon for serving","powdered sugar for serving"],"instructions":["Place 1/2 cup butter in a heavy 9 x 13 glass baking dish.","Set baking dish (with butter) in the oven and preheat to 400 degrees.","In a blender, combine milk, eggs, vanilla, flour, and granulated sugar.","When the butter is completely melted (before it browns or burns, though!), pour the batter over a metal spoon into the baking dish.","Cook 30-40 minutes or until the pnacake is set in the middle and the edges are very puffy and golden brown.","Remove from oven. Garnish with lemon juice and powdered sugar and serve immediately."],"tags":[],"time":{"prep":"5","cook":"30","total":"35"},"servings":null,"image":"data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20220%20220'%3E%3C/svg%3E","slug":"45-german-oven-pancakes.json","url":"https://thegirlinspired.com/german-oven-pancakes/"},{"name":"Gluten-Free Oatmeal Chocolate Chip Cookies","ingredients":[" 1 ½ cups gluten-free 1:1 baking flour"," ¼ cup almond flour, (or and additional ¼ cup gluten-free 1:1 baking flour for nut free)"," ¾ teaspoon salt"," ½ teaspoon baking soda"," ½ cup butter, softened"," ¼ cup coconut oil, softened"," 1 cup brown sugar"," ½ cup white sugar"," 2 teaspoons vanilla"," 2 eggs"," 2 ¼ cups gluten-free rolled oats"," ½ cup coconut, or an additional ½ cup oatmeal"," 1 cup chocolate chips"],"instructions":["In the bowl of a stand or hand mixer, combine the butter, coconut oil, brown sugar and white sugar. Beat until smooth and fully incorporated. Add the vanilla and eggs and beat on medium until light and fluffy, about 2-3 minutes.","Add the dry ingredients to the bowl. Mix until fully incorporated. Add the oats, coconut, and chocolate chips and mix on low until combined.","Refrigerate the dough for 1 hour. ","Preheat the oven to 375F. Line 2 baking sheets with parchment paper or a silicone mat. Scoop out 2 tablespoon-size rounds and bake for 12-15 minutes. Cool on the pan for 2 minutes, then transfer to a wire rack to continue cooling. Enjoy!"],"tags":[],"time":{"prep":"","cook":"15","total":"15"},"servings":null,"image":"data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20200%20200'%3E%3C/svg%3E","slug":"0-gluten-free-oatmeal-chocolate-chip-cookies.json","url":"https://meaningfuleats.com/the-best-gluten-free-oatmeal-chocolate-chip-cookies/"},{"name":"Greek Chicken Kabobs","ingredients":["4 tablespoons olive oil, divided","2 tablespoons freshly squeezed lemon juice","1 tablespoon lemon zest","1 teaspoon paprika","2 teaspoons dried oregano","2 teaspoons dried basil","1 teaspoon dried thyme","3 cloves garlic, minced","1 shallot, minced","Kosher salt and freshly ground black pepper, to taste","2 pounds boneless, skinless chicken thighs, cut into 1-inch chunks"],"instructions":["In a medium bowl, combine 2 tablespoons olive oil, lemon juice, lemon zest, paprika, oregano, basil, thyme, garlic, shallot, 1 1/4 teaspoons salt and 1 1/4 teaspoons pepper.","Stir in chicken until well combined; marinate for at least 2 hours to overnight, turning occasionally. Drain the chicken from the marinade.","Thread chicken onto skewers. Brush with remaining 2 tablespoons olive oil; season with salt and pepper, to taste.","Preheat grill to medium heat.","Add skewers to grill, and cook, turning occasionally, until the chicken is completely cooked through, reaching an internal temperature of 165 degrees F, about 10 minutes.","Serve immediately."],"tags":[],"time":{"prep":"2 hours 30 minutes","cook":"20 minutes","active":"","inactive":"","ready":"","total":"2 hours 50 minutes"},"servings":"6 servings","image":"https://s23209.pcdn.co/wp-content/uploads/2019/08/Greek-Chicken-KabobsIMG_9984.jpg","slug":"50-greek-chicken-kabobs.json","url":"https://damndelicious.net/2019/08/28/greek-chicken-kabobs"},{"name":"Hanging Gingerbread Biscuits","ingredients":["Beat the butter and brown sugar together until fully mixed.","Add 1 egg and mix until smooth. Set aside.","Sift together the flour, baking powder, salt, and spices into a large bowl.","Add the butter mixture made earlier and incorporate until a stiff dough is formed.","Roll out between two pieces of clingfilm until about 3 mm (⅛ inch) thick. Refrigerate for 30 minutes.","Preheat oven to 350°F (180°C).","Cut out the shapes you would like with a cookie cutter and place on a baking tray lined with paper.","Use a small cocktail stick to create a small hole in each biscuit for the ribbon.","Bake for 8-10 minutes until golden brown. Cool on the tray for two minutes, opening up the hole again if closed while baking.","Transfer to a wire rack and let cool completely.","Decorate with chocolate or icing sugar, and use string/ribbon to hang off your tree.","Enjoy!","Beat the butter and brown sugar together until fully mixed.","Add 1 egg and mix until smooth. Set aside.","Sift together the flour, baking powder, salt, and spices into a large bowl.","Add the butter mixture made earlier and incorporate until a stiff dough is formed.","Roll out between two pieces of clingfilm until about 3 mm (⅛ inch) thick. Refrigerate for 30 minutes.","Preheat oven to 350°F (180°C).","Cut out the shapes you would like with a cookie cutter and place on a baking tray lined with paper.","Use a small cocktail stick to create a small hole in each biscuit for the ribbon.","Bake for 8-10 minutes until golden brown. Cool on the tray for two minutes, opening up the hole again if closed while baking.","Transfer to a wire rack and let cool completely.","Decorate with chocolate or icing sugar, and use string/ribbon to hang off your tree.","Enjoy!"],"instructions":["","Recipes","Tips & Tricks","Shop","Begin typing to search, use arrow keys to navigate, press Enter to select and submit search query.Search for recipes","","Easy Dinners","Work Lunches","Thanksgiving Recipes","5 Ingredients","One-Pot Recipes","Slow Cooker Recipes","Live Cooking","Family Dinners","Thanksgiving Leftovers","Pet Treats","Chicken","Pasta","Chocolate","Potato","Ground Beef","Healthy","Vegetarian","Low Carb","Keto","Vegan","Breakfast","Lunch","Dinner","Desserts","Snacks","Appetizers","Side Dishes","Crockpot Sides","Pies","Easy Desserts","Our Best Everyday Tips","Mistakes to Avoid","Advice from Chefs","Baking Basics","Culinary School Secrets","Flavor Hacks","Storage Hacks","Baking Hacks","Egg Hacks","Pizza Hacks","Instant Pot Tricks","Slow Cooker Tips","Air Fryer Recipes","Microwave Meals","Food Processor Hacks","Easy Meal Prep","Family Dinners","Trader Joe's Lunches","$40 A Week","$50 A Week","Easy Dinners","Slow Cooker Recipes","Work Lunches","Thanksgiving Recipes","Live Cooking","Family Dinners","Easy Dinners","Work Lunches","Thanksgiving Recipes","Slow Cooker Recipes","Live Cooking","Family Dinners","1 cup butter (225 g), softened","1 ½ cups light brown sugar (330 g)","1 egg","2 ¾ cups plain flour (340 g)","1 teaspoon baking powder","½ teaspoon salt","½ teaspoon nutmeg","2 teaspoons cinnamon","3 teaspoons ground ginger","white chocolate, or icing to decorate","Calories 110","Fat 6g","Carbs 12g","Fiber 0g","Sugar 4g","Protein 1g","1 cup butter (225 g), softened","1 ½ cups light brown sugar (330 g)","1 egg","2 ¾ cups plain flour (340 g)","1 teaspoon baking powder","½ teaspoon salt","½ teaspoon nutmeg","2 teaspoons cinnamon","3 teaspoons ground ginger","white chocolate, or icing to decorate","Calories 110","Fat 6g","Carbs 12g","Fiber 0g","Sugar 4g","Protein 1g","","","","","Send feedback","Recipes by Ingredient","Community Recipes","Privacy Policy","User Agreement"],"tags":[],"time":{"prep":"","cook":"","total":""},"servings":null,"image":"","slug":"59-hanging-gingerbread-biscuits.json","url":"https://tasty.co/recipe/hanging-gingerbread-biscuits"},{"name":"Hasselback Potatoes","ingredients":["4 (8 ounce) baking potatoes","2 tablespoons butter, melted","salt and pepper to taste","2 tablespoons finely grated fresh Romano cheese","1 tablespoon seasoned dry bread crumbs"],"instructions":["Preheat the oven to 425 degrees F (220 degrees C).","Peel the potatoes, and place in bowl of cold water to prevent browning. Place potatoes into a large wooden or metal spoon. Using a sharp knife, make slices across the potato the short way about 1/8 to 1/4 inch apart, making sure to cut down to the lip of the spoon, not all the way through the potato. The slices should stay connected at the bottom, and the spoon helps keep the depth even. Return the potato to the bowl of water, and proceed with the remaining potatoes.","When all of the potatoes are cut, place them cut side up in a shallow baking dish or small roasting pan. Drizzle with half of the butter, then season with salt and pepper.","Bake for 35 to 40 minutes in the preheated oven. Remove from the oven, and drizzle with the remaining butter. Sprinkle Romano cheese and bread crumbs onto the tops of the potatoes, and season with a little more salt and pepper. Return to the oven, and bake for an additional 20 minutes, or until nicely browned."],"tags":[],"time":{"prep":"20 mins ","cook":"55 mins ","active":"","inactive":"","ready":"","total":"1 hr 15 mins "},"servings":"4 ","image":"https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=3067&h=1534&url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F2918307.jpg","slug":"11-hasselback-potatoes.json","url":"https://www.allrecipes.com/recipe/79518/hasselback-potatoes/"},{"name":"Honey Mustard Grilled Chicken","ingredients":[" 2 lbs. Chicken Breast"," 1/3 cup Mustard (Dijon, Stone Ground, Yellow, or any combination)"," 1/3 cup Honey"," 2-3 Tablespoons Olive Oil (may use canola or vegetable)"," 1/4 teaspoon Garlic Powder"," 1 teaspoon Salt"," 1 teaspoon Pepper"],"instructions":["Place chicken breast in a large Ziploc bag. Using a fork, pierce small holes in the chicken.","In a small bowl, whisk together mustard, honey, olive oil, garlic powder, salt, and pepper.","Pour 1/2 of honey mustard marinade into bag with chicken. Set aside remaining honey mustard sauce to use to baste on the chicken. Let marinate for at least 30 minutes in the refrigerator.","Heat grill to medium or medium-high heat. Once the grill is heated, place chicken on the clean grill.","Cook for 3-5 minutes per side, depending on the thickness of chicken breast. The FDA recommends the internal temperature to be 165 degrees. The chicken will continue to cook for 1-2 minutes after removing from the grill.","After turning the chicken one time, brush remaining honey mustard sauce all over chicken. After removing chicken from the grill, brush the second coat of sauce so it is completely covered.","Let rest for several minutes before cutting so it stays nice and juicy."],"tags":[],"time":{"prep":"30","cook":"10","total":"40"},"servings":null,"image":"https://www.modernhoney.com/wp-content/uploads/2018/05/Honey-Mustard-Grilled-Chicken-1-150x150.jpg","slug":"39-honey-mustard-grilled-chicken.json","url":"https://www.modernhoney.com/honey-mustard-grilled-chicken/"},{"name":"Kentucky Butter Cake","ingredients":["1 cup butter, cubed at room temperature ","2 cups granulated sugar","4 eggs","1 tablespoon vanilla","3 cups all purpose flour","1 teaspoon kosher salt","1 teaspoon baking powder","1/2 teaspoon baking soda","1 cup buttermilk","1/3 cup butter","3/4 cup granulated sugar","2 tablespoons water","2 teaspoons vanilla","Cake","1 cup butter, cubed at room temperature ","2 cups granulated sugar","4 eggs","1 tablespoon vanilla","3 cups all purpose flour","1 teaspoon kosher salt","1 teaspoon baking powder","1/2 teaspoon baking soda","1 cup buttermilk","Butter Glaze","1/3 cup butter","3/4 cup granulated sugar","2 tablespoons water","2 teaspoons vanilla"],"instructions":["Preheat the oven to 325°F/165°C","Grease a 10″ bundt pan with butter or shortening very liberally. Dust the pan with flour and set aside.","Place all the cake ingredients in the bowl of your stand mixer fitted with the paddle attachment. Mix on low for 30 seconds and then increase the speed to medium and mix for 3 minutes.","Pour the batter into the prepared pan and bake for 65-75 minutes until a toothpick entered into the center comes out clean.","When the cake is done make the glaze. Combine all ingredients into a small saucepan over medium-low heat. Stir continuously until the butter is melted and the sugar is dissolved. Do not bring to a boil.","Poke holes all over the warm cake using a knife and pour the glaze evenly on the cake while still in the pan.","Allow the cake to cool completely in the pan and then invert the cake onto a serving plate.","I actually like to make this cake a day in advance, finding it to be more moist and flavorful when it rests overnight.","\nInstructions\n","Preheat the oven to 325°F/165°C","Grease a 10″ bundt pan with butter or shortening very liberally. Dust the pan with flour and set aside.","Place all the cake ingredients in the bowl of your stand mixer fitted with the paddle attachment. Mix on low for 30 seconds and then increase the speed to medium and mix for 3 minutes.","Pour the batter into the prepared pan and bake for 65-75 minutes until a toothpick entered into the center comes out clean.","When the cake is done make the glaze. Combine all ingredients into a small saucepan over medium-low heat. Stir continuously until the butter is melted and the sugar is dissolved. Do not bring to a boil.","Poke holes all over the warm cake using a knife and pour the glaze evenly on the cake while still in the pan.","Allow the cake to cool completely in the pan and then invert the cake onto a serving plate.","I actually like to make this cake a day in advance, finding it to be more moist and flavorful when it rests overnight."],"tags":[],"time":{"prep":"","cook":"","total":"1 hour 35 minutes"},"servings":null,"image":"data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20150%20150'%3E%3C/svg%3E","slug":"37-kentucky-butter-cake.json","url":"https://cookiesandcups.com/kentucky-butter-cake/"},{"name":"Lemon Poppy Seed Muffins","ingredients":[" 1 ⅓ cups flour"," ½ teaspoon baking soda"," ½ teaspoon salt"," ¼ cup butter - (4 tablespoons)"," ¾ cup sugar"," 2 eggs"," 1 teaspoon vanilla - (or almond) "," zest of 2 small lemons  - (or 1 large lemon - about 2 tablespoons)"," 1 tablespoon fresh lemon juice"," ¾ cup plain fat free greek yogurt"," 1 tablespoon poppyseeds "," 2 tablespoons butter - softened"," 2 ounces  cream cheese - softened"," 3-4 cups powdered sugar"," 1-2 teaspoons fresh lemon juice"],"instructions":["Preheat oven to 450 (see note) and grease a muffin pan or line with cupcake liners. ","In a medium bowl whisk together flour, baking soda, and salt.","In a large bowl cream together butter, sugar, eggs, vanilla extract, lemon zest and juice, and greek yogurt. ","Add dry ingredients to wet ingredients and mix until combined. Stir in poppyseeds.","Fill muffin tins about 2/3 full with muffin batter. Bake for 12-16 minutes until an inserted toothpick comes out clean. Allow to cool on a wire rack.","(See note about icing) To make the icing, cream softened butter and cream cheese for 2 minutes until very fluffy. Add powdered sugar and lemon juice and mix well. Taste and add more lemon juice if desired. Drizzle icing over cooled muffins. (If icing is too thick you can warm it up in the microwave for a few seconds ) Serve immediately or store at room temperature in an airtight container for up to 3-5 days."],"tags":[],"time":{"prep":"10","cook":"15","total":"25"},"servings":null,"image":"data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20200%20200'%3E%3C/svg%3E","slug":"47-lemon-poppy-seed-muffins.json","url":"https://www.lecremedelacrumb.com/lemon-poppyseed-muffins/"},{"name":"Lemon Poppyseed Muffins","ingredients":[" 1 1/3 cups flour"," 1/2 teaspoon baking soda"," 1/2 teaspoon salt"," 1/4 cup butter (4 tablespoons)"," 3/4 cup sugar"," 2 eggs"," 1 teaspoon vanilla (or almond) "," zest of 2 small lemons  (or 1 large lemon - about 2 tablespoons)"," 1 tablespoon fresh lemon juice"," 3/4 cup plain fat free greek yogurt"," 1 tablespoon poppyseeds "," 2 tablespoons butter, softened"," 2 ounces  cream cheese, softened"," 3-4 cups powdered sugar"," 1-2 teaspoons fresh lemon juice"],"instructions":["Preheat oven to 450 and grease a muffin pan. In a medium bowl whisk together flour, baking soda, and salt.","In a large bowl cream together butter, sugar, eggs, vanilla extract, lemon zest and juice, and greek yogurt. Add dry ingredients to wet ingredients and mix until combined. Stir in poppyseeds.","Fill muffin tins about 2/3 full with muffin batter. Bake for 12-16 minutes until an inserted toothpick comes out clean. Allow to cool on a wire rack.","To make the icing, cream softened butter and cream cheese for 2 minutes until very fluffy. Add powdered sugar and lemon juice and mix well. Taste and add more lemon juice if desired. Drizzle icing over cooled muffins. (If icing is too thick you can warm it up in the microwave for a few seconds ) Serve immediately or store at room temperature in an airtight container for up to 3-5 days."],"tags":["dessert","muffins"],"time":{"prep":"10 minutes","cook":"15 minutes","active":"","inactive":"","ready":"","total":"25 minutes"},"servings":"12","url":"https://www.lecremedelacrumb.com/lemon-poppyseed-muffins/"},{"name":"Mexican Street Corn off the Cob","ingredients":[" 1 tablespoon unsalted butter"," 4 ears of corn, shucked and kernels removed (about 3-4 cups depending on how large your corn is)"," 2 tablespoons mayo"," 3 ounces cotija cheese, freshly grated or crumbled"," ½ teaspoon smoked paprika"," 1 green onion stalk, finely chopped"," Handful of freshly of chopped parsley"," Salt and pepper, to taste"],"instructions":["In a cast iron skillet, melt butter over medium-high heat then add the corn kernels. Spread in an even layer and cook for 10-15 minutes, or until exterior is charred/browned, stirring frequently. Be careful of the popping action of the heated kernels!","Once charred/browned, place into a large bowl then mix in mayo, cotija, paprika, green onion, parsley, salt, and pepper.","Mix to combine then divide evenly and serve!"],"tags":[],"time":{"prep":"15","cook":"20","total":"35"},"servings":null,"image":"data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20300%20300'%3E%3Crect%20width='300'%20height='300'%20style='fill:%23e3e3e3'/%3E%3C/svg%3E","slug":"23-mexican-street-corn-off-the-cob.json","url":"https://www.tablefortwoblog.com/mexican-street-corn-off-the-cob/"},{"name":"Mini Dutch Baby Pancakes","ingredients":["Arrange a rack in the middle of the oven and remove any racks above it. Place a standard (12-well) muffin pan on the rack, and heat the oven to 425ºF. ","Place 1 cup all-purpose flour, 1 cup whole or 2% milk, 4 large eggs, 1/4 cup granulated sugar, 1 teaspoon vanilla extract, and 1/2 teaspoon kosher salt in a blender or food processor fitted with the blade attachment. Blend for 1 minute — it will be very liquidy. Let the batter rest in the blender or processor for 10 minutes. Meanwhile, cut 6 tablespoons unsalted butter into 12 pieces. ","Carefully remove the preheated muffin pan from the oven. Add 1 piece of butter to each well. Pour the batter into the wells, about 1/3 cup per well (don’t worry if the butter isn’t completely melted). ","Bake until the Dutch babies are puffed and lightly golden brown, 12 to 15 minutes. Let cool for 1 minute before dusting with powdered sugar or filling with jam before serving. "],"instructions":[""," Newsletters","","Dinner Ideas","Breakfasts & Brunch","Lunch","Appetizers","Side Dishes","Snacks","Desserts","Drinks & Cocktails","More...","Chicken","Beef & Steak","Pork","Salmon","Potatoes","Eggs","Rice","Ingredient Explainers & Swaps","More...","Casseroles","Lasagna & Pasta","Pizza","Sauces & Marinades","Salad Dressings","Pancakes & Waffles","Cookies","Air Fryer","More...","Italian","French","English","Mediterranean","Indian","Korean","Filipino","Latin American","More...","Back to School","Thanksgiving ","Halloween","Christmas","Gift Ideas","Entertaining Tips","Organizing & Storage","Cleaning","Decluttering","Pantries","Design & Remodeling","Renovation Diaries","Knife Skills","Ingredient Prep","Baking Tips","Grilling Tips","Freezing & Preserving Tips","Cooking School","More...","Stovetop Cookware","Small Appliances","Knives & Cutlery","Gadgets & Utensils","Coffee Gear","Oven Bakeware","Grocery Taste Tests","Pet Essentials","Best Lists","The Way We Eat","Personal Essays","Grocery Diaries","Love Letters","Food News","Food History","","","","","","shellfish-free","kidney-friendly","fish-free","alcohol-free","low-potassium","vegetarian","peanut-free","pork-free","pescatarian","tree-nut-free","soy-free","red-meat-free","Calories 280","Fat 15.7 g (24.1%)","Saturated 8.9 g (44.4%)","Carbs 26.5 g (8.8%)","Fiber 0.6 g (2.3%)","Sugars 10.7 g","Protein 7.8 g (15.6%)","Sodium 225.4 mg (9.4%)","1 cup all-purpose flour ","1 cup whole or 2% milk ","4 large eggs ","1/4 cupgranulated sugar ","1 teaspoon vanilla extract ","1/2 teaspoon kosher salt","6 tablespoons unsalted butter ","Powdered sugar or jam, for serving","","","","","Recipes","Occasions","Kitchens","Cooking Tips","Tools & Groceries","Food & Culture","Partner with Us","About","Contact","Press","Terms of Use","Privacy Policy","Our team","Jobs","EU and California Data Subject Requests","Site map"],"tags":[],"time":{"prep":"","cook":"","total":""},"servings":null,"image":"","slug":"44-mini-dutch-baby-pancakes.json","url":"https://www.thekitchn.com/these-mini-dutch-babies-are-perfect-for-family-valentines-day-breakfast-22994357"},{"name":"No-Cook Homemade Pizza Sauce","ingredients":["14.5-ounce   can diced tomatoes, undrained","6-ounce   can tomato paste","1 teaspoon   sugar","½ teaspoon   dried oregano","¼ teaspoon   garlic salt","½ teaspoon   dried basil","Pinch   of crushed red pepper"],"instructions":["Combine all ingredients in food processor or blender and blend until desired consistency. Adjust seasonings and salt and pepper to taste. "],"tags":[],"time":{"prep":"10","cook":"","total":"10"},"servings":null,"image":"data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20200%20200'%3E%3C/svg%3E","slug":"27-no-cook-homemade-pizza-sauce.json","url":"https://www.melskitchencafe.com/homemade-pizza-sauce/"},{"name":"No-Fail Homemade Pizza Sauce","ingredients":["\n\t\t\t\t\t\t1 (14 1/2-ounce) can diced tomatoes, undrained\t\t\t\t\t","\n\t\t\t\t\t\t1 (6-ounce) can tomato paste\t\t\t\t\t","\n\t\t\t\t\t\t1 teaspoon sugar\t\t\t\t\t","\n\t\t\t\t\t\t1/2 teaspoon dried oregano\t\t\t\t\t","\n\t\t\t\t\t\t1/4 teaspoon garlic salt\t\t\t\t\t","\n\t\t\t\t\t\t1/2 teaspoon dried basil\t\t\t\t\t","\n\t\t\t\t\t\tPinch of crushed red pepper\t\t\t\t\t"],"instructions":["Combine all ingredients in food processor or blender and blend until desired consistency. I leave mine slightly chunky. You can adjust the seasonings to taste. This recipe is open to interpretation. Use what you like, taste it along the way and it is sure to be delicious!"],"tags":["main dish","pizza","dinner"],"time":{"prep":"5 minutes","cook":"","active":"","inactive":"","ready":"","total":"5 minutes"},"servings":"2-3 cups","image":"https://www.melskitchencafe.com/wp-content/uploads/2008/01/featured-image.jpg"},{"name":"Oatmeal Cake","ingredients":["1 1/2 cups hot water","1 cup old fashioned oats","1 cup brown sugar","1 cup white sugar","1/2 cup butter, at room temperature","2 eggs","1 1/3 cups all-purpose flour","1 teaspoon cinnamon","1 teaspoon baking soda","1/2 teaspoon salt","1/2 cup butter","1 cup brown sugar","1 tablespoon milk","1 cup coconut"],"instructions":["Preheat the oven to 350°F. Spray a 9×13-inch baking dish with nonstick cooking spray.","Combine the water and the oatmeal and allow to soak while you prepare the remaining ingredients.","Cream together the butter and both sugars. Beat in the eggs. In another bowl, mix together the flour, cinnamon, baking soda and salt. Add half of the flour to the creamed butter mixture, followed by the soaked oatmeal, then the remaining flour, mixing between additions. Pour into the prepared baking dish and bake until set, 35-40 minutes.","For the topping, turn the oven to broil. Combine the butter, brown sugar and milk in a saucepan. Bring to a boil, while stirring. Boil for one minute. Stir in the coconut. Pour over the cake, spread, then broil for one minute.","Instructions","Preheat the oven to 350°F. Spray a 9×13-inch baking dish with nonstick cooking spray.","Combine the water and the oatmeal and allow to soak while you prepare the remaining ingredients.","Cream together the butter and both sugars. Beat in the eggs. In another bowl, mix together the flour, cinnamon, baking soda and salt. Add half of the flour to the creamed butter mixture, followed by the soaked oatmeal, then the remaining flour, mixing between additions. Pour into the prepared baking dish and bake until set, 35-40 minutes.","For the topping, turn the oven to broil. Combine the butter, brown sugar and milk in a saucepan. Bring to a boil, while stirring. Boil for one minute. Stir in the coconut. Pour over the cake, spread, then broil for one minute."],"tags":[],"time":{"prep":"","cook":"","total":"1 hour 5 mins"},"servings":null,"image":"https://www.tasteandtellblog.com/wp-content/uploads/2014/12/Oatmeal-Cake-Taste-and-Tell-1-opt-160x160.jpg","slug":"35-oatmeal-cake.json","url":"https://www.tasteandtellblog.com/oatmeal-cake/"},{"name":"Oreo Frosting","ingredients":[" ½ cup all-purpose flour"," 1 ½ cups milk"," 1 teaspoon vanilla extract"," 1 ½ cups salted butter (at cool room temperature)"," 1 ½ cups granulated sugar"," Pinch of salt"," 10 OREO cookies (cookie and filling crushed to fine crumbs**)"],"instructions":["In a small saucepan, whisk flour into milk and heat, stirring constantly, until it thickens. It will be the consistency of a thick paste.*","Remove from heat, and let it cool to room temperature. This step is key. If the milk mixture is at all warm, it won't come together properly.","Stir in vanilla.","Once the mixture is cool, cream the butter, sugar, and salt together until light and fluffy on medium-high, about 5 minutes.","Then add the completely cooled milk mixture.","Beat it for about 5 minutes on medium-high to high until it looks like whipped cream. It may look separated at first, so keep beating it until it comes together and looks likewhipped cream.","Fold in cookie crumbs.","Frost cake or cupcakes of your choice. "],"tags":[],"time":{"prep":"15","cook":"15","total":"30"},"servings":null,"image":"data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20215%20215'%3E%3C/svg%3E","slug":"48-oreo-frosting.json","url":"https://www.ihearteating.com/oreo-frosting/"},{"name":"Quick and Easy Foolproof Pizza Dough","ingredients":["1 cup   warm water","1 tablespoon   honey","1 tablespoon   oil","1 tablespoon   instant yeast","1 teaspoon   salt","2-3 cups   flour (see note)"],"instructions":["In a large bowl or in the bowl of an electric stand mixer fitted with the dough hook, mix the water, honey, oil, yeast and salt. Add the flour gradually until a soft dough forms and pulls away from the sides of the bowl. The exact flour amount will vary so go by the touch and feel of the dough versus the exact cup measurements in the recipe. The dough should be soft and smooth (not leaving a residue on your fingers but not super stiff, either).","Knead the dough for 2-3 minutes (more like 5-6 minutes if kneading by hand or if using whole wheat flour).","Let the dough rest, covered, for 10 minutes. Shape the dough into pizza(s), spread with sauce and toppings, and bake at 475 or 500 degrees on a preheated pizza stone or on a lightly greased baking sheet for 8-10 minutes (for an in-depth look at baking methods, here is a great tutorial)."],"tags":[],"time":{"prep":"25","cook":"10","total":"35"},"servings":null,"image":"data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20200%20200'%3E%3C/svg%3E","slug":"29-quick-and-easy-foolproof-pizza-dough.json","url":"https://www.melskitchencafe.com/quick-and-easy-pizza-dough/"},{"name":"Raspberry Crumb Cake {Paleo, Gluten-Free, Dairy-Free}","ingredients":["\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t2/3\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tcup\n\t\t\t\t\t\t\t\t\t\t\t\t\t\tblanched almond flour\n\t\t\t\t\t\t\t\t\t\t\t\t\t","\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t1/4\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tcup\n\t\t\t\t\t\t\t\t\t\t\t\t\t\tghee\n\t\t\t\t\t\t\t\t\t\t\t\t\t\trefined coconut oil, or grass fed butter, solid\n\t\t\t\t\t\t\t\t\t\t\t\t\t","\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t6\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tTbsp\n\t\t\t\t\t\t\t\t\t\t\t\t\t\tmaple sugar\n\t\t\t\t\t\t\t\t\t\t\t\t\t","\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t3\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\teggs\n\t\t\t\t\t\t\t\t\t\t\t\t\t\troom temperature\n\t\t\t\t\t\t\t\t\t\t\t\t\t","\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t2\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tTbsp\n\t\t\t\t\t\t\t\t\t\t\t\t\t\talmond milk\n\t\t\t\t\t\t\t\t\t\t\t\t\t","\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tGrated zest of one medium lemon\n\t\t\t\t\t\t\t\t\t\t\t\t\t","\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t2\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tTbsp\n\t\t\t\t\t\t\t\t\t\t\t\t\t\tfresh lemon juice\n\t\t\t\t\t\t\t\t\t\t\t\t\t","\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t1/4\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tcup\n\t\t\t\t\t\t\t\t\t\t\t\t\t\tmelted refined coconut oil \n\t\t\t\t\t\t\t\t\t\t\t\t\t\tor melted ghee, cooled a bit (not hot)\n\t\t\t\t\t\t\t\t\t\t\t\t\t","\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t1\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\ttsp\n\t\t\t\t\t\t\t\t\t\t\t\t\t\tpure vanilla extract\n\t\t\t\t\t\t\t\t\t\t\t\t\t","\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t1\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\ttsp\n\t\t\t\t\t\t\t\t\t\t\t\t\t\tpure almond extract\n\t\t\t\t\t\t\t\t\t\t\t\t\t","\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t2/3\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tcup\n\t\t\t\t\t\t\t\t\t\t\t\t\t\tpure maple sugar\n\t\t\t\t\t\t\t\t\t\t\t\t\t\tcoconut sugar will work too, the color will be much darker\n\t\t\t\t\t\t\t\t\t\t\t\t\t","\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t2 1/4\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tcups\n\t\t\t\t\t\t\t\t\t\t\t\t\t\tblanched almond flour\n\t\t\t\t\t\t\t\t\t\t\t\t\t","\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t1/4\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tcup\n\t\t\t\t\t\t\t\t\t\t\t\t\t\ttapioca flour\n\t\t\t\t\t\t\t\t\t\t\t\t\t","\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t3/4\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\ttsp\n\t\t\t\t\t\t\t\t\t\t\t\t\t\tbaking soda\n\t\t\t\t\t\t\t\t\t\t\t\t\t","\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t1/4\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\ttsp\n\t\t\t\t\t\t\t\t\t\t\t\t\t\tsalt\n\t\t\t\t\t\t\t\t\t\t\t\t\t","\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t1\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tcup\n\t\t\t\t\t\t\t\t\t\t\t\t\t\tfresh raspberries\n\t\t\t\t\t\t\t\t\t\t\t\t\t\tabout 4.5 oz\n\t\t\t\t\t\t\t\t\t\t\t\t\t","\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t2/3\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tcup\n\t\t\t\t\t\t\t\t\t\t\t\t\t\torganic powdered sugar  \n\t\t\t\t\t\t\t\t\t\t\t\t\t\tor powdered maple sugar for a Paleo option*\n\t\t\t\t\t\t\t\t\t\t\t\t\t","\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t2-3\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\ttsp\n\t\t\t\t\t\t\t\t\t\t\t\t\t\talmond milk\n\t\t\t\t\t\t\t\t\t\t\t\t\t","\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t1/2\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\ttsp\n\t\t\t\t\t\t\t\t\t\t\t\t\t\tpure vanilla extract or almond extract\n\t\t\t\t\t\t\t\t\t\t\t\t\t"],"instructions":["Blend all ingredients with a fork or pastry blender until the texture is crumbly. Chill in the refrigerator while you prepare the cake batter.","Preheat your oven to 350° F and place an oven rack in the middle of the oven. Line an 8 x 8” square baking pan with parchment paper on the bottom and sides, for easy removal.","In a large bowl, whisk together the eggs, lemon juice and zest, coconut oil or ghee, vanilla and almond extract, and sugar. In a separate bowl, combine the almond flour, baking soda and salt.","Stir the dry mixture into the wet until well combined and smooth. Fold in half the raspberries.","Using a silicone spatula, transfer cake batter into the parchment lined cake pan and smooth out evenly. Sprinkle the remaining raspberries on top, then sprinkle all the crumb topping over the raspberries to evenly cover.","Bake on the middle rack in the preheated oven for 30-35 minutes or until golden brown and a toothpick inserted near the center of the cake comes out with a few crumbs.","Place the cake pan on a wire rack to allow it to cool in the pan for at least 15 minutes. Use the parchment overhang to remove the cake from the pan to continue cooling on the wire rack.","While the cake cools, make the glaze. Combine the powdered sugar of choice with 1 1/2 Tbsp of almond milk and the vanilla, adding drop by drop more almond milk if needed to get a drizzly consistency.Hint - replace the almond milk with lemon and omit the vanilla for a lemon glaze.","Drizzle the glaze over the partially cooled or cooled cake as desired. Serve cake either slightly warm or at room temperature. Enjoy!"],"tags":[],"time":{"prep":"20","cook":"30","total":""},"servings":null,"image":"data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20189%20189'%3E%3C/svg%3E","slug":"7-raspberry-crumb-cake-paleo-gluten-free-dairy-free.json","url":"https://www.paleorunningmomma.com/raspberry-crumb-cake-paleo-gluten-free-dairy-free/"},{"name":"Ravioli Alfredo Bake with Spinach and Bacon","ingredients":[" 2 10 ounce packages cheese ravioli"," 3 tablespoons butter"," 2 teaspoos minced garlic"," 3 tablespoons flour"," 3 cups milk  - or heavy cream, (fat free half and half is my favorite for this recipe)"," 1 cup shaved or shredded parmesan cheese - divided"," salt and pepper to taste  - (I used about 1 teaspoon salt and ½ teaspoon pepper)"," 2 cups packed baby spinach"," 4 strips  bacon - cooked and chopped"," grated parmesan cheese - for topping"," fresh basil or thyme, for garnish  - (optional)"],"instructions":["Preheat oven to 375 degrees and grease a medium casserole dish.","In a large sauce pan melt butter over medium-high heat. Stir in garlic until fragrant. Sprinkle flour into the pan and stir. Gradually whisk milk into the pan until completely combined and mixture is smooth.","Stir 2/3 cup parmesan cheese, salt, and pepper into the sauce and stir until cheese is melted and combined with sauce. Stir in spinach and bacon and continue to stir until spinach is softened.","Toss the ravioli in the sauce, then pour past and sauce into your prepared casserole dish. Top with remaining 1/3 cup parmesan cheese. (I added additional bacon for garnish, this is completely optional!)","Cover the dish with foil and bake for 15-20 minutes until sauce is bubbly and pasta is hot throughout. Switch oven to broil. Cook, uncovered, another 5 minutes until cheese on top begins to brown slightly.","Sprinkle grated parmesan cheese over the top and garnish with fresh basil or thyme. Serve hot."],"tags":[],"time":{"prep":"15","cook":"25","total":"40"},"servings":null,"image":"data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20200%20200'%3E%3C/svg%3E","slug":"41-ravioli-alfredo-bake-with-spinach-and-bacon.json","url":"https://www.lecremedelacrumb.com/ravioli-alfredo-bake-spinach-bacon/"},{"name":"Slow Cooker Barbecue Ribs","ingredients":["\n\t\t\t\t\t\t\t\t\t\t4\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tpounds\n\t\t\t\t\t\t\t\t\t\tpork baby back ribs\n\t\t\t\t\t\t\t\t\t","\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tsalt and pepper\n\t\t\t\t\t\t\t\t\t","\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tgarlic powder, onion powder (about 1/2 teaspoon each)\n\t\t\t\t\t\t\t\t\t","\n\t\t\t\t\t\t\t\t\t\t2\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tcups\n\t\t\t\t\t\t\t\t\t\tof your favorite barbecue sauce\n\t\t\t\t\t\t\t\t\t","\n\t\t\t\t\t\t\t\t\t\t1\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tcup\n\t\t\t\t\t\t\t\t\t\tketchup\n\t\t\t\t\t\t\t\t\t","\n\t\t\t\t\t\t\t\t\t\t1/2\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tcup\n\t\t\t\t\t\t\t\t\t\tpacked brown sugar\n\t\t\t\t\t\t\t\t\t","\n\t\t\t\t\t\t\t\t\t\t4\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\ttablespoons\n\t\t\t\t\t\t\t\t\t\tred wine vinegar\n\t\t\t\t\t\t\t\t\t","\n\t\t\t\t\t\t\t\t\t\t2\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tteaspoons\n\t\t\t\t\t\t\t\t\t\tWorcestershire sauce\n\t\t\t\t\t\t\t\t\t","\n\t\t\t\t\t\t\t\t\t\t2\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tteaspoons\n\t\t\t\t\t\t\t\t\t\tdried oregano\n\t\t\t\t\t\t\t\t\t","\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\toptional 1 Tablespoon liquid smoke\n\t\t\t\t\t\t\t\t\t\tif you like a smokey flavor\n\t\t\t\t\t\t\t\t\t","\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\toptional dash hot sauce\n\t\t\t\t\t\t\t\t\t\tmy bbq sauce was spicy enough already\n\t\t\t\t\t\t\t\t\t"],"instructions":["Preheat oven to 400 degrees. If the ribs still have a membrane, slide a table knife under the silver skin of the ribs. Use a paper towel to pull the membrane carefully off.","Place ribs in a shallow baking dish and season with salt, pepper, garlic powder, and onion powder. Bake for 15 minutes and then turn over and bake for 15 more minutes. Drain fat. Note: You can skip this step if you don't want to render the fat off","In a medium bowl combine BBQ sauce, ketchup, brown sugar, vinegar, Worcestershire, oregano, and liquid smoke and hot sauce if desired.","SLOW COOKER: Place ribs in a large slow cooker (at least 6 quart). I curled mine around but you can cut them in half if you need to. Pour sauce on top and cook on low for 6-8 hours or until tender. INSTANT POT: Place ribs in instant pot and pour sauce on top. Cook on high pressure for 30 minutes. Let it naturally release the pressure.","If you want to carmelize your bbq sauce put them back in the oven and broil for 5 minutes to carmelize the sauce. Totally your preference though."],"tags":[],"time":{"prep":"10","cook":"","total":"10"},"servings":null,"image":"data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20300%20300'%3E%3C/svg%3E","slug":"22-slow-cooker-barbecue-ribs.json","url":"https://www.the-girl-who-ate-everything.com/slow-cooker-barbecue-ribs/"},{"name":"Smothered Baked Chicken Burritos","ingredients":["1 Recipe Slow Cooker Mexican Chicken","6 burrito size tortillas (I prefer raw/undercooked tortillas)*","1 cup shredded sharp cheddar cheese","olive oil or nonstick cooking spray","2 tablespoons olive oil","1 tablespoon butter","3 tablespoons flour","2 cups low sodium chicken broth, warmed","1/2 teaspoon cumin","1/4-1/2 teaspoon salt","1/4 teaspoon pepper","1/2 cup sour cream","1/2 4 oz. can mild chopped green chilies, or more to taste","1/2 cup shredded sharp cheddar cheese","Hot sauce to taste (optional)","Tomatoes","Avocados/guacamole","cilantro","salsa","tortilla strips or chips"],"instructions":["Prepare Mexican Chicken according to recipe directions (click on 1 Recipe Slow Cooker Mexican Chicken for recipe). Drain any excess liquid from chicken.","Preheat oven to 400 degrees F. Line a baking sheet with foil and add a baking rack on top. Prepare burritos by adding a heaping ½ cup filling to each tortilla (uncooked if using raw tortillas), top with desired amount of cheese and roll up burrito style. Place burritos on the baking rack and brush both sides lightly with olive oil or spray with nonstick cooking spray. Cook for 18-20 minutes or until golden. Broil to desired crispiness, flip over and broil the other side until golden.","Meanwhile, prepare Sauce by melting butter in olive oil in a medium saucepan over medium heat. Whisk in flour and cook, stirring constantly for 3 minutes. Reduce heat to low then gradually whisk in chicken broth. Add spices and bring to a simmer while stirring until thickened, about 2-3 minutes. Remove from heat and stir in green chilies, cheese until melted then sour cream. Add hot sauce to taste (optional).","To serve, top burritos Cheesy Green Chili Sour Cream Sauce and desired toppings."],"tags":[],"time":{"prep":"10","cook":"20","total":""},"servings":null,"image":"data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20187%20280'%3E%3C/svg%3E","slug":"32-smothered-baked-chicken-burritos.json","url":"https://carlsbadcravings.com/smothered-baked-chicken-burritos-recipe/"},{"name":"Stuffed French Bread Sandwich","ingredients":["1 loaf french bread","1 pound lean ground beef","2 tablespoons finely chopped onion","1/2 cup chopped celery","1 teaspoon minced garlic","1 can cream of mushroom soup","2 tablespoons milk","2 teaspoons Worcestershire sauce","Salt and pepper, to taste","1 1/2 cups shredded cheddar cheese","1/2 tablespoon chopped parsley (optional)"],"instructions":["Preheat oven to 350° FSlice the french bread in half, lengthwise, so you have two equal pieces. Scoop out the bread in the center of each piece. Place bread in a large bowl and tear into small chunks. Set the two halves of french bread onto a large baking sheet. Set aside.Brown the ground beef and onion in a large skillet, over medium-high heat. Drain any grease. Add the celery and garlic to skillet. Cook a few minutes until celery is tender. Next, add soup, milk and Worcestershire sauce. Season with salt and pepper. Stir and cook mixture until heated; another 5 minutes or so.Add the beef mixture to the bread in the large bowl. Stir to combine. Pour mixture into the center of one-half of the French bread. Spread out evenly. Top the mixture with the shredded cheese. Top with the other half of bread.Bake for 10 to 15 minutes, or until cheese is melted. Remove from oven and let stand 5 minutes before slicing and serving. Enjoy!"],"tags":[],"time":{"prep":"10mins","cook":"45mins","total":""},"servings":null,"image":"","slug":"16-stuffed-french-bread-sandwich.json","url":"https://www.keyingredient.com/recipes/1852025034/stuffed-french-bread-sandwich/"},{"name":"Sweet & Spicy Chili Polenta","ingredients":["\n\t\t\t\t\t\t\t\t\t\t2\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\ttablespoons\n\t\t\t\t\t\t\t\t\t\toil\n\t\t\t\t\t\t\t\t\t","\n\t\t\t\t\t\t\t\t\t\t1\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tyellow onion\n\t\t\t\t\t\t\t\t\t\tchopped\n\t\t\t\t\t\t\t\t\t","\n\t\t\t\t\t\t\t\t\t\t2\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tgarlic cloves\n\t\t\t\t\t\t\t\t\t\tminced\n\t\t\t\t\t\t\t\t\t","\n\t\t\t\t\t\t\t\t\t\t1/2\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tred, orange or yellow bell pepper\n\t\t\t\t\t\t\t\t\t\tchopped\n\t\t\t\t\t\t\t\t\t","\n\t\t\t\t\t\t\t\t\t\t1/2 - 1\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\ttablespoon\n\t\t\t\t\t\t\t\t\t\tchili powder\n\t\t\t\t\t\t\t\t\t\tdepending on how spicy you like things\n\t\t\t\t\t\t\t\t\t","\n\t\t\t\t\t\t\t\t\t\t2\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tteaspoons\n\t\t\t\t\t\t\t\t\t\tcumin\n\t\t\t\t\t\t\t\t\t","\n\t\t\t\t\t\t\t\t\t\t2\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tteaspoons\n\t\t\t\t\t\t\t\t\t\tsmoked paprika\n\t\t\t\t\t\t\t\t\t","\n\t\t\t\t\t\t\t\t\t\t1/4 - 1/2\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tteaspoon\n\t\t\t\t\t\t\t\t\t\tchipotle chili powder\n\t\t\t\t\t\t\t\t\t","\n\t\t\t\t\t\t\t\t\t\t1/8\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tteaspoon\n\t\t\t\t\t\t\t\t\t\tcrushed red pepper flakes\n\t\t\t\t\t\t\t\t\t","\n\t\t\t\t\t\t\t\t\t\t1/4\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tteaspoon\n\t\t\t\t\t\t\t\t\t\tsalt\n\t\t\t\t\t\t\t\t\t","\n\t\t\t\t\t\t\t\t\t\t1/4\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tteaspoon\n\t\t\t\t\t\t\t\t\t\tblack pepper\n\t\t\t\t\t\t\t\t\t","\n\t\t\t\t\t\t\t\t\t\t2\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\ttablespoons\n\t\t\t\t\t\t\t\t\t\ttomato paste\n\t\t\t\t\t\t\t\t\t","\n\t\t\t\t\t\t\t\t\t\t1/2\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tpound\n\t\t\t\t\t\t\t\t\t\tground beef\n\t\t\t\t\t\t\t\t\t","\n\t\t\t\t\t\t\t\t\t\t1\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\ttablespoons\n\t\t\t\t\t\t\t\t\t\tbrown sugar\n\t\t\t\t\t\t\t\t\t","\n\t\t\t\t\t\t\t\t\t\t1 14.5-\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\toz\n\t\t\t\t\t\t\t\t\t\tcan tomato sauce\n\t\t\t\t\t\t\t\t\t","\n\t\t\t\t\t\t\t\t\t\t2\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tcups\n\t\t\t\t\t\t\t\t\t\twater\n\t\t\t\t\t\t\t\t\t","\n\t\t\t\t\t\t\t\t\t\t2\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tcups\n\t\t\t\t\t\t\t\t\t\tmilk\n\t\t\t\t\t\t\t\t\t","\n\t\t\t\t\t\t\t\t\t\t3/4\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tcup\n\t\t\t\t\t\t\t\t\t\tcornmeal\n\t\t\t\t\t\t\t\t\t","\n\t\t\t\t\t\t\t\t\t\t2\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\ttablespoons\n\t\t\t\t\t\t\t\t\t\tbutter\n\t\t\t\t\t\t\t\t\t","\n\t\t\t\t\t\t\t\t\t\t1/2\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tcup\n\t\t\t\t\t\t\t\t\t\tgrated Parmesan cheese\n\t\t\t\t\t\t\t\t\t","\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tsalt and pepper to taste\n\t\t\t\t\t\t\t\t\t","\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tGrated cheddar cheese\n\t\t\t\t\t\t\t\t\t","\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tSour cream\n\t\t\t\t\t\t\t\t\t","\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tDiced red onion\n\t\t\t\t\t\t\t\t\t","\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tDiced avocado\n\t\t\t\t\t\t\t\t\t","\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tCorn chips\n\t\t\t\t\t\t\t\t\t"],"instructions":["In a medium-large saucepan, warm the oil over medium heat and then stir in the onions and pepper. Cook, stirring occasionally, until softened, about five minutes. Add the garlic and let cook for 30 seconds.","Stir in the spices and then add the tomato paste. Cook about 2 minutes, then add the ground beef. Let the beef cook mostly through, then add the sugar and tomato sauce. Stir to combine, then bring to a simmer, cover, and let cook on medium-low for about 15 minutes. Salt to taste.","While the chili simmers, make the polenta.","Warm the water and milk over medium heat in a saucepan, then stir in the cornmeal (every recipe I've ever read says to bring the liquid to a boil before adding the cornmeal, but when I do that, I can't keep the cornmeal from forming lumps, so I always add it while it's warm but not simmering or boiling).","Stir until smooth, then let it cook about 5 minutes, stirring frequently to keep the bottom from burning. Be careful, because it pops out of the pan a lot!","Reduce the heat, and stir in the butter and cheese until melted, then salt to taste.","In a bowl or on a plate, layer the polenta, then the chili, followed by your desired toppings."],"tags":[],"time":{"prep":"10","cook":"25","total":"35"},"servings":null,"image":"data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20150%20150'%3E%3C/svg%3E","slug":"24-sweet--spicy-chili-polenta.json","url":"https://everyday-reading.com/sweet-spicy-chili-polenta/"},{"name":"Sweet Potato Hash with Sausage and Eggs {Paleo & Whole30}","ingredients":["\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t3\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tTbsp\n\t\t\t\t\t\t\t\t\t\t\t\t\t\tcoconut oil\n\t\t\t\t\t\t\t\t\t\t\t\t\t\tdivided, for cooking\n\t\t\t\t\t\t\t\t\t\t\t\t\t","\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t2\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tsmall/med sweet potatoes chopped into small pieces\n\t\t\t\t\t\t\t\t\t\t\t\t\t\tabout 1/2 inch\n\t\t\t\t\t\t\t\t\t\t\t\t\t","\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t1\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tmed onion\n\t\t\t\t\t\t\t\t\t\t\t\t\t\tchopped\n\t\t\t\t\t\t\t\t\t\t\t\t\t","\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t1\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tsmall/med bell pepper\n\t\t\t\t\t\t\t\t\t\t\t\t\t\tred, orange, yellow, chopped\n\t\t\t\t\t\t\t\t\t\t\t\t\t","\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t1/2\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tlb\n\t\t\t\t\t\t\t\t\t\t\t\t\t\tfresh bulk sausage\n\t\t\t\t\t\t\t\t\t\t\t\t\t\tsugar free for Whole30*- see note\n\t\t\t\t\t\t\t\t\t\t\t\t\t","\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t1/4-1/2\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\ttsp\n\t\t\t\t\t\t\t\t\t\t\t\t\t\tpaprika or smoked paprika\n\t\t\t\t\t\t\t\t\t\t\t\t\t","\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tSea salt and black pepper\n\t\t\t\t\t\t\t\t\t\t\t\t\t","\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tPinch\n\t\t\t\t\t\t\t\t\t\t\t\t\t\tred pepper flakes\n\t\t\t\t\t\t\t\t\t\t\t\t\t\tOptional, for the sausage\n\t\t\t\t\t\t\t\t\t\t\t\t\t","\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t4\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\teggs\n\t\t\t\t\t\t\t\t\t\t\t\t\t","\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tThinly sliced scallions for garnish\n\t\t\t\t\t\t\t\t\t\t\t\t\t"],"instructions":["**Note - You will cook the sausage in the same pan with the onions and peppers and the potatoes separately, until the end.","Preheat oven to 400 degrees (you will use it to bake the eggs into the skillet at the very end)","Heat a large skillet, preferably cast iron, over medium heat and add 1 Tbsp of the coconut oil to melt. Once sizzling, crumble the sausage into the pan, and stir while cooking to evenly brown. Sprinkle with a pinch of red pepper flakes.","When sausage is about 3/4 of the way done, add the onions and peppers and continue to cook and stir until the sausage is browned and the onions and peppers are soft and fragrant. Remove from heat and set aside until the potatoes are done.","Meanwhile in a separate skillet over medium heat, add the remaining 2 Tbsp of coconut oil to melt. Add the chopped sweet potatoes and stir to coat. Sprinkle with smoked paprika, sea salt and pepper to taste.","Cook and stir, uncovered, until the outside begins to brown, then cover the skillet (any cover that mostly fits will do!) and continue to cook to soften the inside of the potatoes, uncovering to stir once in a while. Adjust the heat if necessary to prevent burning, and add a bit more coconut oil if necessary. This step should take about 7 minutes total, give or take.","Once the potatoes are softened and browned, transfer them to the sausage mixture and stir to combine. Create 4 indents where you will crack each egg - then carefully crack the eggs into the spaces (I like to create a bit of space for the eggs so the yolks don't break and the whites don't run all over!)","Put the entire skillet in the 400 degree oven to bake the eggs to preference, about 10-15 minutes. Alternatively, you can cook the eggs by covering the skillet and cooking over medium-low heat until the eggs are done. I prefer the oven method to avoid burning the bottom of the hash, but either way should work!","Serve hot and enjoy!"],"tags":[],"time":{"prep":"10","cook":"25","total":"35"},"servings":null,"image":"data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20189%20189'%3E%3C/svg%3E","slug":"17-sweet-potato-hash-with-sausage-and-eggs-paleo--whole30.json","url":"https://www.paleorunningmomma.com/sweet-potato-hash-sausage-paleo-whole30/"},{"name":"Texas Sheet Cake Bites","ingredients":["2 cups all-purpose flour","2 cups granulated sugar","1 teaspoon baking soda","1/2 teaspoon salt","1 cup butter","3/4 cup water","5 tablespoons unsweetened cocoa powder","1/2 cup buttermilk","2 eggs beaten","1/2 cup butter","1/3 cup buttermilk","5 tablespoons unsweetened cocoa powder","1 teaspoon vanilla extract","1 pound powdered sugar"],"instructions":["Preheat oven to 325F. Spray mini muffin pan generously with non-stick cooking spray or line with mini muffin liners.","In a large bowl, whisk together the flour, sugar, baking soda, and salt; set aside.","In a medium saucepan, combine the butter, water, and cocoa powder and heat over medium heat until boiling, stirring often. Pour into the dry mixture and mix just until combined. Gently stir in the buttermilk and beaten eggs. The batter will be quite thin.","Scoop the batter into the prepared mini muffin pan, filling each well about 2/3 full. Bake at 325F for 10-12 minutes until a toothpick inserted into the center comes out clean.","Cool the cake bites in the pan for 5 minutes, then remove and cool completely on a wire cooling rack.","In a medium saucepan, combine the buttermilk, butter, and cocoa. Heat over medium heat until the mixture comes to a boil, whisking often. Remove from the heat and whisk in the vanilla extract and powdered sugar until smooth. ","Spoon the frosting over the cake bites and allow a few minutes for the frosting to set."],"tags":[],"time":{"prep":"15","cook":"15","total":"30"},"servings":null,"image":"data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20250%20250'%3E%3C/svg%3E","slug":"8-texas-sheet-cake-bites.json","url":"https://kitchenfunwithmy3sons.com/texas-sheet-cake-bites/"},{"name":"Thai Red Curry","ingredients":[" 2 tablespoon olive oil"," 1 lb boneless, skinless chicken thighs or breasts, sliced into strips (see note)"," 1 teaspoon  kosher salt"," 1  1/2 inch piece fresh ginger, peeled and minced"," 1 large clove garlic, minced"," 1 small yellow onion, thinly sliced"," 1 small zucchini, cut in half lengthwise and sliced about 1/4 inch thick"," 1/2 red bell pepper, sliced"," 1/2 yellow or orange bell pepper, sliced"," 1 13.5 oz can coconut milk"," 2 tablespoons Thai red curry paste"," 2 Kaffir lime leaves (optional)*"," 1 tablespoon sugar"," 2 tablespoons freshly squeezed lime juice"," 1 tablespoon fish sauce (optional)"," 1/4 cup chopped fresh cilantro"," coconut lime rice  for serving (see note)"],"instructions":["Heat 1 tablespoon olive oil in a large non-stick skillet over medium-high heat. Sprinkle the chicken with salt and cook until lightly browned, about 3 minutes. Remove the chicken to a plate.","In the same skillet, heat another tablespoon of olive oil. Add the onion and sauté until softened. Add the ginger and garlic and cook, stirring constantly until fragrant, about 30 seconds.","Add the bell peppers and zucchini, and continue cooking until softened, about 4-5 minutes longer.","Stir in the red curry paste and lime leaves, and stir-fry for another minute. Add the coconut milk, sugar fish sauce and lime juice and stir until well combined, Add in the chicken and simmer for 2-3 minutes until chicken is cooked through.","Serve over plain or coconut lime rice (see note), and sprinkle with cilantro."],"tags":[],"time":{"prep":"10","cook":"20","total":"30"},"servings":null,"image":"data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20200%20200'%3E%3C/svg%3E","slug":"21-thai-red-curry.json","url":"https://www.ourhappymess.com/thai-red-curry-5/"},{"name":"The Best Buttermilk Pancakes","ingredients":["▢ 2 cups all-purpose flour","▢ 2 teaspoons baking powder","▢ 1 teaspoon baking soda","▢ 1/2 teaspoon salt","▢ 3 tablespoons sugar","▢ 2 large eggs lightly beaten","▢ 3 cups buttermilk","▢ 4 tablespoons unsalted butter melted"],"instructions":["Preheat the griddle to 375 degrees. In a large mixing bowl, whisk flour, baking powder, baking soda, salt and sugar together. Add the eggs, buttermilk and melted butter. Mix until incorporated but leave small lumps in the batter.","Spray the griddle with non stick cooking spray. Add about ½ cup of the batter to the hot griddle. Once the edges start to harden and small bubbles form, about 2 minutes, flip to the other side. Cook until golden at the bottom.","Repeat with the remaining batter. Serve with buttermilk syrup or fresh fruit. Makes about 9 pancakes."],"tags":[],"time":{"prep":"10 minutes","cook":"","active":"","inactive":"","ready":"","total":"15 minutes"},"servings":"99","image":"data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20300%20300'%3E%3C/svg%3E","slug":"56-the-best-buttermilk-pancakes.json","url":"https://therecipecritic.com/best-buttermilk-pancakes/"},{"name":"The Best Gluten Free Cake Recipe","ingredients":[" 1 ½ cups (202.5 grams) gfJules® All Purpose Gluten Free Flour"," 1 cup less 1 Tbs. granulated cane sugar (Monkfruit works as a sub)"," 2 tsp. baking powder"," 1/3 tsp. baking soda"," 1/2 tsp. salt (optional)"," 2 eggs or substitute (for white cake, use 4 egg whites instead)**"," 1/3 cup mild flavored vegetable oil of choice (safflower, non-GMO canola, avocado oil, extra virgin olive oil, coconut oil melted, etc.)"," 1 Tbs. white vinegar (lemon juice works as a sub but imparts lemon flavor)"," 1 tsp. pure vanilla extract (I like Rodelle®)"," ½ cup milk of choice (dairy or non-dairy; skim or fat-free not recommended)"],"instructions":["Preheat oven to 325° F.","Line with parchment rounds or oil one 8 or 9-inch round cake pan or line 12 muffin cups with cupcake papers.","Bring all ingredients to room temperature. Sift the dry ingredients (including sugar) together in a bowl.","In a separate mixing bowl, whisk together liquid ingredients except milk. If making white cake, first whip egg whites quickly to fluff, then add other liquids: oil; vinegar and vanilla.","Slowly pour dry mix into the liquids and begin to stir, adding the milk while stirring to keep the flour from flying up and out of the bowl while mixing. Continue to beat at medium speed just until the lumps are gone and the batter is smooth and no longer lumpy.","Pour batter into prepared pan(s). Allow to rest in the pan before baking for 10 minutes (not required if pressed for time).","Bake for approximately 30-35 minutes for cakes or 20-25 minutes for cupcakes. Test with a toothpick before removing from the oven. When done, the toothpick should come out clean (not wet) or with a few crumbs attached when inserted into the center of the cake.","Glass, metal and ceramic pans all alter the bake time, so check for done-ness before removing from the oven. Pressing gently onto the top of the cake, it should feel firm and bounce back.","Remove to cool on a wire rack. To remove the cake, gently invert the cake by flipping it upside down onto your hand, removing the pan, then returning the cake to the wire rack or a serving plate.","Frost with white or chocolate frosting. (There are plenty more frosting recipes where that came from - just search the \"recipes\" tab on my site!)"],"tags":[],"time":{"prep":"15 minutes","cook":"45 minutes","total":""},"servings":null,"image":"","slug":"6-the-best-gluten-free-cake-recipe.json","url":"https://gfjules.com/recipes/the-best-gluten-free-cake-recipe/"},{"name":"The Best Grilled Chicken For Tacos, Burritos, or Salads","ingredients":["1 pound Boneless, Skinless chicken thighs or breasts we prefer thighs ","2 cloves garlic  minced","1  tablespoon lime juice optional","1  tablespoon olive oil","1 tablespoons chili powder","1 teaspoon cumin","1 teaspoon paprika","1 teaspoon salt","1/2 teaspoon oregano","1/4 teaspoon black pepper","1 teaspoon corn starch  optional"],"instructions":["Add the chicken, garlic, olive oil, lime, spices, and cornstarch to a large bowl or zip-seal bag.","Place in fridge and let marinate for at least 15-30 minutes or up to 24 hours. ","Remove chicken from marinade and discard marinade. Place chicken on a grill or pan heated to medium-high heat. Let chicken cook until it is no longer pink on the inside, about 6-7 minutes per side(or until it has reached an internal temperature of 165 degrees F). ","Serve chicken in tacos, burritos, on salads or rice."],"tags":[],"time":{"prep":"5","cook":"15","total":"20"},"servings":null,"image":"data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20200%20200'%3E%3C/svg%3E","slug":"19-the-best-grilled-chicken-for-tacos-burritos-or-salads.json","url":"https://gimmedelicious.com/the-best-taco-grilled-chicken/"},{"name":"The Best Steak Marinade","ingredients":["¼ cup olive oil","¼ cup balsamic vinegar","¼ cup Worcestershire sauce","¼ cup soy sauce","2 teaspoons Dijon mustard","2 teaspoons minced garlic","1 pinch salt and pepper to taste"],"instructions":["Mix olive oil, balsamic vinegar, Worcestershire sauce, soy sauce, Dijon mustard, and garlic in a small bowl. Season with salt and pepper."],"tags":[],"time":{"prep":"5 mins ","cook":"","active":"","inactive":"","ready":"","total":"5 mins "},"servings":"4 ","image":"https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=960&h=480&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2021%2F07%2F07%2F7968044-the-best-steak-marinade-trusted-brands.jpeg","slug":"9-the-best-steak-marinade.json","url":"https://www.allrecipes.com/recipe/176770/the-best-steak-marinade/"},{"name":"The Hasselback potato – The perfect cross between baked and roasted","ingredients":["Pre heat the oven to 220C (425F)","First prepare the potatoes. If you wish to leave the skins on, then give them a wash, otherwise peel them.\nCut slices into the potato, roughly 3-4mm (1/8 inch) using a wooden spoon as a cutting board (see picture above)","Place the potatoes onto a baking tray. Brush with the butter and sprinkle with salt.","Put the baking tray into the oven for 60 mins, re basting with the butter from the tray after about 30 mins, making sure that it gets into the openings of the potato","Serve","\n\t\t\t\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\n\t\t\t\t\t\n                        \n                \n                Christina Rioux on February 4, 2021 at 9:12 am\n                #\n                Reply\n            \n    \n\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\tI made them for the first time this week using the Hasselback tool.  You still have to be careful about cutting down too far. I melted butter with sea salt, fresh ground pepper and Herbs de Provence then drizzled over the potatoes. They were fabulous and looked gorgeous. Wish I could post the picture.\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\n\t\t\t\n\t\t\t\t\t\t\t\n\t"],"instructions":["","","","","","","","Home","RecipesAppetizerAsianBarbequeBeefBread and BakingCocktails and other drinksDesserts Desserts, Sweets, Puddings, Candy and other sweet thingsItalianLunchOne Pot MealsPorkPoultrySandwichesSauce & GravySeafoodSide DishSnackVegetables and Salads","Appetizer","Asian","Barbeque","Beef","Bread and Baking","Cocktails and other drinks","Desserts Desserts, Sweets, Puddings, Candy and other sweet things","Italian","Lunch","One Pot Meals","Pork","Poultry","Sandwiches","Sauce & Gravy","Seafood","Side Dish","Snack","Vegetables and Salads","ReviewsRestaurant ReviewsFood ReviewsBook ReviewsDrink ReviewsProduct Reviews","Restaurant Reviews","Food Reviews","Book Reviews","Drink Reviews","Product Reviews","The Kitchen SinkEssential Kitchen RequirementsTechniquesNuggetsWeirdFood GardeningThe Kitchen Sink","Essential Kitchen Requirements","Techniques","Nuggets","Weird","Food Gardening","The Kitchen Sink","AboutWhy we are not foodiesGet in touch","Why we are not foodies","Get in touch","By Stuart in Recipe, Side Dish, Techniques, Vegetables and Salads","2 medium sized potatoes per person","4 tbsp of butter, olive oil or duck fat","Coarse Salt","Hasselback Cutting Board","Wooden Spoon","Potatoes","Hasselback Cutting Rack"," baked potato, hasselback potato, hasselback potato recipe, hasselback potatoes, Hasselbacken, Hasselbackspotatis, kitchen secret, roast potato, Sweden","","Christina Rioux on February 4, 2021 at 9:12 am","#","Reply","\nCarving the Turkey Early, Reducing the Stress of the Holiday Meal\n","\nMacGyver’s Fat Separator, Simple Way to Make Homemade Gravy\n","\nGiblets and Everything but the Kitchen Sink Gravy\n","\nJalapeno Brined Roasted Chicken\n","\nHomemade Garden Grape Jam, Welch’s Take Note!\n","We are not foodies on Pinterest","Home Skillet","GGlaRua","Young Grasshopper","We are not foodies on Twitter"],"tags":[],"time":{"prep":"","cook":"","total":""},"servings":null,"image":"","slug":"12-the-hasselback-potato--the-perfect-cross-between-baked-and-roasted.json","url":"https://wearenotfoodies.com/the-hasselback-potato-the-perfect-cross-between-baked-and-roasted/"},{"name":"True Belgian Waffles","ingredients":["2 cups all-purpose flour","3/4 cup sugar","3-1/2 teaspoons baking powder","2 large eggs, separated","1-1/2 cups whole milk","1 cup butter, melted","1 teaspoon vanilla extract","Sliced fresh strawberries or syrup"],"instructions":["In a bowl, combine flour, sugar and baking powder. In another bowl, lightly beat egg yolks. Add milk, butter and vanilla; mix well. Stir into dry ingredients just until combined. Beat egg whites until stiff peaks form; fold into batter. "," Bake in a preheated waffle iron according to manufacturer's directions until golden brown. Serve with strawberries or syrup."],"tags":[],"time":{"prep":"","cook":"","active":"","inactive":"","ready":"","total":""},"servings":"","image":"","slug":"55-true-belgian-waffles.json","url":"https://www.tasteofhome.com/recipes/true-belgian-waffles/"},{"name":"Zucchini Bread Muffins","ingredients":[" 1 ½ cups flour"," 1 cup sugar"," 1 teaspoon cinnamon"," ½ teaspoon baking powder"," ½ teaspoon baking soda"," ½ teaspoon salt"," 2 large eggs - at room temperature"," ½ cup oil"," 1 teaspoon vanilla"," 2 cup finely grated unpeeled zucchini"],"instructions":["Preheat oven to 350 degrees and grease or line a muffin tin with paper liners. ","In a large bowl, whisk together flour, sugar, cinnamon, baking powder, baking soda, and salt. ","Whisk eggs into oil, then stir in vanilla. Stir wet ingredients into dry ingredients until just combined (mixture will be very thick and somewhat dry). ","Fold zucchini into batter until incorporated. ","Fill muffin tins 3/4 full. ","Bake for 20-22 minutes until an inserted toothpick comes out clean. ","Store at room temperature in airtight container up to 5 days or wrap individually with plastic wrap and store in the fridge or freezer up to 3 weeks. Serve at room temperature or pop them in the microwave for a few seconds and slather on a bit of butter. "],"tags":[],"time":{"prep":"15","cook":"20","total":"35"},"servings":null,"image":"data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20200%20200'%3E%3C/svg%3E","slug":"42-zucchini-bread-muffins.json","url":"https://www.lecremedelacrumb.com/zucchini-bread-muffins/"},{"name":"the best gluten-free pizza crust","ingredients":["\n\t\t\t\t\t\t\t\t\t\t6\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tcups\n\t\t\t\t\t\t\t\t\t\tstone ground white rice flour *\n\t\t\t\t\t\t\t\t\t\t(36 ounces / 1,020 grams)\n\t\t\t\t\t\t\t\t\t","\n\t\t\t\t\t\t\t\t\t\t3 1/4\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tcups\n\t\t\t\t\t\t\t\t\t\tsorghum flour\n\t\t\t\t\t\t\t\t\t\t(16 ounces / 455 grams)\n\t\t\t\t\t\t\t\t\t","\n\t\t\t\t\t\t\t\t\t\t1 3/4\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tcups\n\t\t\t\t\t\t\t\t\t\ttapioca flour or starch\n\t\t\t\t\t\t\t\t\t\t(8 ounces / 225 grams)\n\t\t\t\t\t\t\t\t\t","\n\t\t\t\t\t\t\t\t\t\t1 1/4 \n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tcups\n\t\t\t\t\t\t\t\t\t\tpotato starch **\n\t\t\t\t\t\t\t\t\t\t(8 ounces / 225 grams)\n\t\t\t\t\t\t\t\t\t","\n\t\t\t\t\t\t\t\t\t\t1/4\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tcup\n\t\t\t\t\t\t\t\t\t\txanthan gum ***\n\t\t\t\t\t\t\t\t\t\t(1.4 ounces / 40 grams)\n\t\t\t\t\t\t\t\t\t","\n\t\t\t\t\t\t\t\t\t\t5\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tcups\n\t\t\t\t\t\t\t\t\t\tmixture #1: gluten-free all-purpose flour\n\t\t\t\t\t\t\t\t\t\t(27 ounces / 755 grams)\n\t\t\t\t\t\t\t\t\t","\n\t\t\t\t\t\t\t\t\t\t1 1/2\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tcups\n\t\t\t\t\t\t\t\t\t\tcornmeal\n\t\t\t\t\t\t\t\t\t\t(9 ounces / 255 grams)\n\t\t\t\t\t\t\t\t\t","\n\t\t\t\t\t\t\t\t\t\t1\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tcup\n\t\t\t\t\t\t\t\t\t\tpotato starch\n\t\t\t\t\t\t\t\t\t\t(6 ounces / 170 grams)\n\t\t\t\t\t\t\t\t\t","\n\t\t\t\t\t\t\t\t\t\t2\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tteaspoons\n\t\t\t\t\t\t\t\t\t\txanthan gum \n\t\t\t\t\t\t\t\t\t\t(or ground psyllium husk****)\n\t\t\t\t\t\t\t\t\t","\n\t\t\t\t\t\t\t\t\t\t1\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\ttablespoon\n\t\t\t\t\t\t\t\t\t\tgranulated yeast\n\t\t\t\t\t\t\t\t\t\t(0.35 ounce / 10 grams)\n\t\t\t\t\t\t\t\t\t","\n\t\t\t\t\t\t\t\t\t\t1 1/2\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\ttablespoons\n\t\t\t\t\t\t\t\t\t\tkosher salt\n\t\t\t\t\t\t\t\t\t\t(0.9 ounce / 25 grams)\n\t\t\t\t\t\t\t\t\t","\n\t\t\t\t\t\t\t\t\t\t1/4\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tcup\n\t\t\t\t\t\t\t\t\t\tgranulated sugar\n\t\t\t\t\t\t\t\t\t\t(1.75 ounces / 50 grams)\n\t\t\t\t\t\t\t\t\t","\n\t\t\t\t\t\t\t\t\t\t3 3/4\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tcups\n\t\t\t\t\t\t\t\t\t\tlukewarm water, at 100° or below\n\t\t\t\t\t\t\t\t\t\t(30 ounces / 850 grams)\n\t\t\t\t\t\t\t\t\t","\n\t\t\t\t\t\t\t\t\t\t1/2\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tcup\n\t\t\t\t\t\t\t\t\t\tolive oil\n\t\t\t\t\t\t\t\t\t\t(3.75 ounces / 110 grams)\n\t\t\t\t\t\t\t\t\t","\n\t\t\t\t\t\t\t\t\t\t4\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tegg whites\n\t\t\t\t\t\t\t\t\t\t(4 ounces / 115 grams)\n\t\t\t\t\t\t\t\t\t","\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tparchment paper\n\t\t\t\t\t\t\t\t\t\t(or cornmeal for the pizza peel)\n\t\t\t\t\t\t\t\t\t","\n\t\t\t\t\t\t\t\t\t\t6\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tounces\n\t\t\t\t\t\t\t\t\t\tgluten-free pizza & flatbread dough\n\t\t\t\t\t\t\t\t\t\t(large peach-sized portion)\n\t\t\t\t\t\t\t\t\t","\n\t\t\t\t\t\t\t\t\t\t1/3\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tcup\n\t\t\t\t\t\t\t\t\t\tthick prepared tomato sauce\n\t\t\t\t\t\t\t\t\t","\n\t\t\t\t\t\t\t\t\t\t3\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tounces\n\t\t\t\t\t\t\t\t\t\tfresh mozzarella cheese, torn into 1/2-inch pieces\n\t\t\t\t\t\t\t\t\t","\n\t\t\t\t\t\t\t\t\t\t6\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tfresh basil leaves, thinly slivered or torn\n\t\t\t\t\t\t\t\t\t\t(plus more for garnish)\n\t\t\t\t\t\t\t\t\t","\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tcoarse salt, for sprinkling\n\t\t\t\t\t\t\t\t\t","\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tgluten-free flour\n\t\t\t\t\t\t\t\t\t\t(for dividing dough)\n\t\t\t\t\t\t\t\t\t","\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tparchment paper\n\t\t\t\t\t\t\t\t\t\t(for forming dough & baking pizza)\n\t\t\t\t\t\t\t\t\t","\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tolive oil\n\t\t\t\t\t\t\t\t\t\t(for forming dough)\n\t\t\t\t\t\t\t\t\t"],"instructions":["Whisk and mix the ingredients in a 5- to 6-quart lidded container. Finish by picking up the container and vigorously shaking until the flours are completely blended.","The ingredients must be very well mixed, otherwise, the xanthan gum will not be evenly distributed and your baked or fried goods will be inconsistent. ","* Do not substitute with sweet white rice flour.","** Do not substitute with potato flour.","*** Psyllium can be used as a substitute for xanthan gum only if the dough is to be used in recipes that are baked in a loaf pan.Psyllium causes the dough to become crumbly after refrigeration. ","If you’re measuring using U.S. cup-measures, be sure to pack the flour tightly into the cup, as if you were measuring brown sugar.","Whisk together the flour, cornmeal, potato starch, xanthan gum, yeast, salt, and sugar in a 5-quart bowl or the large bowl of a heavy-duty stand mixer.","Combine the liquid ingredients in a medium-sized bowl and add the mixture to the dry ingredients.Mix well using a wooden spoon or a heavy-duty stand mixer fitted with the paddle attachment, until all of the dry ingredients are well incorporated.","Cover (not airtight) and allow to rest at room temperature until the dough rises, approximately 2 hours.","The dough can be used immediately after the initial rise, though it is easier to handle when cold.Refrigerate in a lidded (not airtight) container and use over the next 5 days. Or store the dough for up to 2 weeks in 1/2-pound portions in the freezer then thaw in the refrigerator overnight before use.","**** If replacing xanthan gum with ground psyllium husk, double the quantity.","Preheat a baking stone (or heavy-duty baking sheet) to your oven's highest temperature at 500°F to 550°F, placing the stone near the bottom of the oven to help crisp the bottom crust without burning the cheese.Most stones will be hot enough in 20 to 30 minutes.","Prepare and measure all toppings in advance.","Brush a piece of parchment paper with a teaspoon of olive oil in a 10-inch circle.Dust the surface of the prepared dough with gluten-free flour and pull off a 6-ounce piece.Quickly pat into a ball on the prepared parchment paper and drizzle with more oil.Cover with a piece of plastic wrap or another piece of parchment paper.Press with your fingers or roll out to form a 10-inch circle.Check occasionally to be sure the dough is not sticking to the top layer.If it is, gently peel back the paper or wrap and drizzle a tiny bit more olive oil.","Once the dough is the right size (keep in mind that it doesn't have to be perfect - rustic is good) remove the top layer of paper or plastic wrap.Spread the tomato sauce evenly over the dough, using the back of a spoon or a pastry brush.Scatter the torn mozzarella and basil over the surface and give it a light sprinkling of coarse salt.","Slide the pizza into the oven, along with the bottom layer of parchment paper, onto the preheated stone or pan.For the crispiest crust, carefully slide the parchment paper out from under the pizza once it's set, about 5 minutes into the baking.","Check for doneness in 8 to 10 minutes.The time will vary depending on your pizza's thickness and your oven's temperature.When ready, remove from the oven and let the pizza cool slightly on a rack to allow the cheese to set before serving.Top with additional fresh basil and enjoy."],"tags":[],"time":{"prep":"","cook":"","total":""},"servings":null,"image":"https://i2.wp.com/ahintofrosemary.com/wp-content/uploads/2018/04/IMG_1090.jpg?resize=150%2C150&ssl=1","slug":"57-the-best-gluten-free-pizza-crust.json","url":"http://ahintofrosemary.com/recipes/the-best-gluten-free-pizza-crust/"}]